{"title":"Head First Networking","uid":4940557,"size":37215814,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00a81c3c5097b573a4f22c49f49317ba8ee7c068&amp;dn=Head+First+Networking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1244436311,"description":"Frustrated with networking books so chock-full of acronyms that your brain goes into sleep mode? Head First Networking's unique, visually rich format provides a task-based approach to computer networking that makes it easy to get your brain engaged. You'll learn the concepts by tying them to on-the-job tasks, blending practice and theory in a way that only Head First can.\n\nWith this book, you'll learn skills through a variety of genuine scenarios, from fixing a malfunctioning office network to planning a network for a high-technology haunted house. You'll learn exactly what you need to know, rather than a laundry list of acronyms and diagrams. This book will help you:\n\n* Master the functionality, protocols, and packets that make up real-world networking\n* Learn networking concepts through examples in the field\n* Tackle tasks such as planning and diagramming networks, running cables, and configuring network devices such as routers and switches\n* Monitor networks for performance and problems, and learn troubleshooting techniques\n* Practice what you've learned with nearly one hundred exercises, questions, sample problems, and projects\n\nHead First's popular format is proven to stimulate learning and retention by engaging you with images, puzzles, stories, and more. Whether you're a network professional with a CCNA/CCNP or a student taking your first college networking course, Head First Networking will help you become a network guru.","torrent":{"xt":"urn:btih:00a81c3c5097b573a4f22c49f49317ba8ee7c068","amp;dn":"Head+First+Networking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00a81c3c5097b573a4f22c49f49317ba8ee7c068","infoHashBuffer":{"type":"Buffer","data":[0,168,28,60,80,151,181,115,164,242,44,73,244,147,23,186,142,231,192,104]},"announce":[],"urlList":[]}}