{"title":"Lenny Kravitz - Fly Away","uid":4915473,"size":135671812,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:01491d55b305c00a919b4cefb3e5a367237d6fea&amp;dn=Lenny+Kravitz+-+Fly+Away&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"2nafish","files":-1,"time":1243401468,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Fly Away&quot; is the fourth single by American rock musician Lenny Kravitz from his 1998 album 5.\n\nThe music video for the single was directed by Paul Hunter. It featured Kravitz and his band playing in a club. They were surrounded by the crowd dancing to the rhythm of the song, some of them were having fun and getting drunk, while other people were making out. There were also some topless women, but they were censored.\n\nSome visual effects were done to make the video something less quiet and get the sensation of adrenaline, by shaking the camera, using different kinds of lighting, and slowing down the playback of the song in order to speed up the movements of the people on the video.\n\nThe video is featured on the DVD for the special Kravitz's Greatest Hits album tour edition.\n\n&quot;Fly Away&quot; is one of Kravitz's most successful songs to date. The song was a hit in both the United Kingdom and United States. It topped the UK Singles Chart, while in USA it reached #12 on the Billboard Hot 100. It also topped the Billboard Hot Mainstream Rock Tracks and Hot Modern Rock Tracks charts in the US. In New Zealand it peaked at #8 and was certified gold. The song also helped to expand the success of his album 5 in Europe and earned Kravitz a Grammy Award in 1998 for Best Male Rock Performance.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:01491d55b305c00a919b4cefb3e5a367237d6fea","amp;dn":"Lenny+Kravitz+-+Fly+Away","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01491d55b305c00a919b4cefb3e5a367237d6fea","infoHashBuffer":{"type":"Buffer","data":[1,73,29,85,179,5,192,10,145,155,76,239,179,229,163,103,35,125,111,234]},"announce":[],"urlList":[]}}