{"title":"Earl Palmer","uid":4443407,"size":67548928,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:01bee3ec08ddd1699ab39a471610c047e95cb24c&amp;dn=Earl+Palmer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"snackie829","files":30,"time":1223927373,"description":"Earl Palmer-The most recorded drummer in history\n\nBorn in New Orleans, he started his career at five as a tap dancer, joining his mother and aunt on the black vaudeville circuit in its twilight and touring the country extensively with Ida Cox&amp;#039;s Darktown Scandals Review. His father was thought to be local pianist and bandleader Walter &quot;Fats&quot; Pichon.[3]\n\nPalmer served in the United States Army during World War II, eventually being posted in the European Theatre.[2] His biographer states,\n\n        Most Negro recruits were assigned to noncombatant service troops: work gangs in uniform. &quot;They didn&amp;#039;t want no niggers carrying guns,&quot; says Earl; they carried shovels, and garbage cans instead. Earl&amp;#039;s job, loading and handling ammunition was relatively technical, but his duty was clear: to serve white infantrymen.[4]\n\nAfter the war ended he studied piano and percussion at the Gruenwald School of Music in New Orleans, where he also learned to read music. He started drumming with the Dave Bartholomew Band in the late 1940s.[3] Palmer was known for playing on New Orleans recording sessions, including Fats Domino&amp;#039;s &quot;The Fat Man&quot; (and all the rest of Domino&amp;#039;s hits), &quot;Tutti Frutti&quot; by Little Richard (and most of Richard&amp;#039;s hits), &quot;Lawdy Miss Clawdy&quot; by Lloyd Price, and &quot;I Hear You Knockin&amp;#039;&quot; by Smiley Lewis.\n\nHis playing on &quot;The Fat Man&quot; featured the back beat that has come to be the most important element in rock and roll. Palmer said, &quot;That song required a strong afterbeat throughout the whole piece. With Dixieland you had a strong afterbeat only after you got to the shout last chorus. . . . It was sort of a new approach to rhythm music.&quot; Reportedly, he was the first to use the word &quot;funky&quot;, to explain to other musicians that their music should be made more syncopated and danceable.[3]\n\nPalmer left New Orleans for Hollywood in 1957, initially working for Aladdin Records. For more than 30 years he was to play drums on the scores and soundtracks of many movies and television shows. His career as a session drummer included work with Frank Sinatra, Phil Spector, Rick Nelson, Ray Charles, Eddie Cochran, Ritchie Valens, Bobby Day, Don and Dewey, Jan and Dean, the Beach Boys, Larry Williams, Gene McDaniels, Bobby Darin, Neil Young and B. Bumble and the Stingers, as well as jazz sessions with Dizzy Gillespie, Earl Bostic and Count Basie, and appearing on blues recordings with B. B. King. He was also in demand for TV and film scores.\n\nPalmer played drums in a recording session with west-coast folk singer-songwriter Jim Sullivan around 1969 or 1970. The album was released twice with different audio mixes. On the Monnie Records album, &quot;U.F.O.&quot;, Palmer&amp;#039;s drumming can be clearly heard, but on the Century City Record, &quot;Jim Sullivan&quot; the drums, percussion and bass were moved back in the mix.[2]\n\nHe remained in demand as a drummer throughout the 1970s and 1980s, playing on albums by Randy Newman, Tom Waits, Bonnie Raitt, Tim Buckley, Little Feat and Elvis Costello.[3]\n\nIn 1982, Palmer was elected treasurer of the Local 47 of the American Federation of Musicians. He served until he was defeated in 1984 and was re-elected in 1990.[2]\n\nHis biography, Backbeat: the Earl Palmer Story, written by Tony Scherman, was published in 1999. In 2000, he became one of the first session musicians to be inducted into the Rock and Roll Hall of Fame. In recent years, he played with a jazz trio in Los Angeles. [3]","torrent":{"xt":"urn:btih:01bee3ec08ddd1699ab39a471610c047e95cb24c","amp;dn":"Earl+Palmer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01bee3ec08ddd1699ab39a471610c047e95cb24c","infoHashBuffer":{"type":"Buffer","data":[1,190,227,236,8,221,209,105,154,179,154,71,22,16,192,71,233,92,178,76]},"announce":[],"urlList":[]}}