{"title":"Rage.Update.1-SKIDROW","uid":6731273,"size":1043724909,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:01e9c4f890fcb001f40c662e30263657a01b12f6&amp;dn=Rage.Update.1-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rlf-rls","files":-1,"time":1318165564,"description":"Rage.Update.1-SKIDROW\n\n09-10-2011........Release Date ... Protection...............Steam\nFPS..................Game Type ... Disk(s)....................DOX\n\nRELEASE NOTES\n\nRage Update 1 info:\n \n \nRAGE Patch Release Notes - October 8th 2011\n\nRAGE defaults to lower video settings to allow the game to work on a\nwide variety of hardware and software configurations.\nUnfortunately, it is not possible to anticipate all possible graphics\ndriver issues in combination with unique end user hardware and software\nconfigurations. For this reason RAGE does not automatically increase\nvideo/graphics settings as this could result in negative side effects\non specific hardware and software configurations. The original release\nof RAGE does not expose many video/graphics options for people to tweak\nbecause some of these settings, although desirable from a quality\nperspective, simply will not work on specific configurations either due\nto hardware limitations and/or driver bugs. Due to popular demand for\nmore video and graphics options, this patch updates the video settings\nmenu and exposes several quality and performance settings. However, not\neveryone may be able to increase the settings due to hardware limitations\nand/or driver bugs.\n\n\nVSync\n \n\nThe new &quot;VSync&quot; option in the video settings menu allows you to remove\nscreen tearing. There are three options: ON, OFF and SMART.\n\nWhen VSync is turned OFF you may experience screen tearing.\n\nWhen VSync is turned ON you should not see screen tearing. However,\nany time your frame rate drops below 60 frames per second you will\nget a sudden more severe drop to 30 frames per second. This is how VSync\ninherently works. If your computer cannot maintain 60 frames per\nsecond and you miss the synchronization to the vertical retrace of\nyour monitor then you will miss a whole frame and synchronize to\nthe next frame instead.\n\nSome graphics drivers now support a so called &quot;swap-tear&quot; extension.\nYou can try using this extension by setting VSync to SMART.\nIf your graphics driver supports this extension and you set VSync\nto SMART then RAGE will synchronize to the vertical retrace of\nyour monitor when your computer is able to maintain 60 frames per\nsecond and the screen may tear if your frame rate drops below 60 frames\nper second. In other words the SMART VSync option trades a sudden drop\nto 30 frames per second with occasional screen tearing. Occasional\nscreen tearing is usually considered less distracting than a more\nsevere drop in frame rate.\n\nIf your graphics driver does not support SMART VSync and you set VSync\nto SMART in the video settings then RAGE will automatically fall back to\nturning VSync OFF and you may experience screen tearing. The &quot;swap-tear&quot;\nextension is brand new and may still present some issues on certain\ngraphics hardware. If you experience any problems using SMART Vsync\nthen set VSync to either ON or OFF. We are actively working with the\ngraphics hardware vendors to improve the &quot;swap-tear&quot; extension.\n\nIf changing VSync in the RAGE video settings menu does not appear to\nmake any difference then make sure you are not overriding the VSync\nsetting in the graphics vendor control panel. You can find the\ngraphics vendor control panel by right-clicking on the Windows desktop\nand selecting the &quot; control panel&quot; option from the pop-up menu.\n\nIf you force VSync to the 'on' setting in the graphics vendor control\npanel then you should not see any screen tearing in RAGE but you may\nget a more severe drop in frame rate if your computer cannot maintain\n60 frames per second.\n\nIf you force VSync to the 'off' setting in the graphics vendor control\npanel then you may experience screen tearing no matter what setting you\nuse for the VSync option in the RAGE video settings menu.\n\n\nTexture Cache\n \n\nThe new &quot;Texture Cache&quot; option in the video settings menu allows you\nto increase the texture cache size to keep more texture data in\nvideo memory.\n\nIf the Texture Cache is set to LARGE then RAGE will keep more texture\ndata in video memory. This may not only significantly reduce blurry\ntextures and texture popping, it will also allow complex scenes to be\nrendered with more texture detail.\n\nHowever, this may not work on computers that do not have enough system\nor video memory, or you may experience a significant drop in performance.\nIf you experience issues due to hardware limitations you will have to set\nthe Texture Cache back to SMALL.\n\nIf after changing the Texture Cache to LARGE you experience a crash or\ntexture corruption (like a partially or completely blue world) then\nthe graphics driver may have run out of memory.\n\nWe are actively working with the graphics card vendors to resolve\nany crashes.\n\nIf you do not experience a crash but you see texture corruption then you\nmay be able to get the large Texture Cache to work by accepting the change\nand restarting the game. If you still experience texture corruption after\nrestarting the game you will have to set the Texture Cache back to SMALL.\n\nYou may also be able to improve the memory situation on your computer by\nchanging the Windows paging file management. Note that making changes to\nthe Windows paging file management may change the performance characteristics\nof your computer. Any changes you make to your system configuration are\nat your own risk. Always make backups of your system and revert these\nchanges if you notice undesirable side effects.\n\nTo change the paging file management on Windows Vista and Windows 7, first\npress the &quot;Start&quot; button, then right-click on &quot;Computer&quot; and then select\n&quot;Properties&quot; from the popup menu. Then select &quot;Advanced system settings&quot;\non the window that appears. Select the &quot;Advanced&quot; tab on the\n&quot;System Properties&quot; window that is displayed and press the &quot;Settings&quot;\nbutton under &quot;Performance&quot;. Select the &quot;Advanced&quot; tab on the\n&quot;Performance Options&quot; window that shows up next and press the\n&quot;Change...&quot; button under &quot;Virtual memory&quot;. Now uncheck the option\n&quot;Automatically manage paging file size for all drives&quot; and make\nsure that the option &quot;System managed size&quot; is selected on the\n&quot;Virtual Memory&quot; window. Confirm the change by pressing the &quot;OK&quot; button\non each window. After making this change you will have to restart your\ncomputer for the change to take effect.\n\nTo change the paging file management on Windows XP, first press the\n&quot;Start&quot; button, then right-click on &quot;My Computer&quot; and then select\n&quot;Properties&quot; from the popup menu. Select the &quot;Advanced&quot; tab on the\n&quot;System Properties&quot; window that is displayed and press the &quot;Settings&quot;\nbutton under &quot;Performance&quot;. Select the &quot;Advanced&quot; tab on the\n&quot;Performance Options&quot; window that shows up next and press the &quot;Change&quot;\nbutton under &quot;Virtual memory&quot;. Make sure that the option\n&quot;System managed size&quot; is selected on the &quot;Virtual Memory&quot; window.\nConfirm the change by pressing the &quot;OK&quot; button on each window.\nAfter making this change you will have to restart your computer for\nthe change to take effect.\n\n\nAnisotropic Filter\n\n\nThe new &quot;Anisotropic Filter&quot; option in the video settings menu allows\nyou to increase the anisotropic texture filtering.\n\nAnisotropic filtering is a method to enhance the image quality of\ntextures on surfaces that are at oblique viewing angles.\n\nThe anisotropic texture filtering in RAGE defaults to a low value to\naccommodate for low-end graphics hardware. However, the anisotropic\nfiltering can be increased for high-end graphics hardware by setting\nthe Anistropic Filter option to HIGH in the video settings menu.\n\nDo not force anisotropic filtering to the on setting in the graphics\nvendor control panel because this may cause rendering artifacts in\nthe game.\n\nNote that increasing the anisotropic filtering may improve the\ntexture quality while it may also decrease the frame rate.\n\n\nPatch Changes / Fixes\n\n\n- Implemented workaround for AMD driver crash right after intro cinematic\n  on Win 7 32-bit systems.\n- Disabled UBOs because they are causing animation issues with AMD drivers.\n- Don't allow swap-tear to be enabled on AMD while the extension is not\n  exposed because it may crash.\n- Support for new video settings: &quot;texture cache&quot;, &quot;vsync&quot; and\n &quot;anisotropic filter&quot;\n- Automatically adjust vt_maxPPF based on the number of available cores.\n- Improved performance for SLI cards when GPU transcode is enabled.\n- Fix for GPU Transcoding option being disabled after exiting gameplay.\n- Added safe mode to restore video settings to default values.\n- Allow g_fov to be changed from the RAGE launch options in Steam.\n- Server now forwards text chat from clients to all other clients while\n  in-game.\n\n\nKnown Graphical Issues\n \n\nThe following issues were found using NVIDIA graphics hardware with\nthe GeForce R285 Driver or AMD graphics hardware with the AMD Catalyst\n11.10 Version 2 Preview Driver.\n\n\n- If you turn up both the screen resolution and anti-aliasing settings\n  to high values in the video settings menu and/or you enable\n  &quot;GPU Transcode&quot; then the screen may no longer update on some hardware\n  configurations. This means your system does not have the necessary\n  video memory to run with these high settings. You can re-enter the video\n  settings menu and lower your settings to restart screen updates.\n\n- If you turn up both the screen resolution and anti-aliasing settings\n  to high values in the video settings menu you may experience a crash\n  if your system does not have the necessary memory to run with these\n  high settings. To avoid this problem you will have to re-enter the\n  video settings menu to lower the settings. If you can no longer launch\n  the game after changing the video settings to high values you can add\n  the following to your RAGE launch options in Steam:\n\n+com_safemode 1\n\nThe launch options can be found by right-clicking on RAGE in Steam\nand selecting &quot;Properties&quot;. Then click on &quot;Set Launch Options&quot; in\nthe dialog that pops up. Adding this option will reset your video\nsettings to the default values the next time the game is launched.\nWhen the game is launched in safe mode the game will show &quot;safe mode&quot;\nin the corners of the screen. Do not forget to remove the safe mode\nlaunch option after launching the game once to make sure you do not\nlose your video settings each time you launch the game.\n\n- Using a NVIDIA graphics card on Windows XP 32-bit or XP 64-bit, you\n  may experience a crash or hang when changing the screen resolution in\n  full screen mode or switching from windowed mode to full screen mode.\n  This has been identified as a graphics driver problem. We have spent\n  significant effort trying to work around this problem and were\n  successful in reducing the frequency of occurrence but a driver update\n  is necessary to completely fix the problem. We are actively working with\n  NVIDIA to make a solution to this problem available as soon as possible.\n\n- Using an AMD graphics card, you may experience black flickering\n  artifacts on flags, banners and zip-lines if you run in full screen\n  mode. This has been identified as a graphics driver problem. We are\n  actively working with AMD on a solution to this problem.\n\n- Using an AMD graphics card, you may experience black grid lines on\n  some graphical user interface (GUI) elements like the in-game mini-map.\n  This has been identified as a graphics driver problem. We are actively\n  working with AMD on a solution to this problem. If you find the grid\n  lines particularly distracting, you can add the following to the RAGE\n  launch options in Steam as a temporary workaround.\n\n+vt_maxAniso 1\n\nThe launch options can be found by right-clicking on RAGE in Steam\nand selecting &quot;Properties&quot;. Then click on &quot;Set Launch Options&quot; in\nthe dialog that pops up. However, note that adding this setting will\nlower the general texture quality in the game.\n\n- If you have an AMD graphics card with a dual core CPU system you may\n  experience severe hitching and low frame rates. This has been\n  identified as a driver problem. We are actively working with AMD on\n  a solution to this problem. As a temporary workaround you may add the\n  following to the RAGE launch options in Steam:\n\n+jobs_numThreads 0\n\nThe launch options can be found by right-clicking on RAGE in Steam\nand selecting &quot;Properties&quot;. Then click on &quot;Set Launch Options&quot; in\nthe dialog that pops up.\n\n- If you are running RAGE in full-screen mode and you ALT-TAB to a\n  different application you may lose your VSync setting. When you\n  switch to a different application VSync stops functioning.\n  RAGE detects that VSync is no longer working and automatically switches\n  back to synchronizing to real-time to make sure the game time advances\n  in a consistent manner. We are actively working with the graphics\n  vendors on a solution to this problem.\n\nINSTALL NOTES\n\n1. Unpack release\n2. Run Rage.Update.1.exe\n3. Install\n4. Copy the cracked content from the SKIDROW folder to the main install\n   folder and overwrite\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n\nADDITIONAL NOTES\n\nUse the included Launcher.exe to select and set languages, if you also\ngot our language pack installed\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!","torrent":{"xt":"urn:btih:01e9c4f890fcb001f40c662e30263657a01b12f6","amp;dn":"Rage.Update.1-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01e9c4f890fcb001f40c662e30263657a01b12f6","infoHashBuffer":{"type":"Buffer","data":[1,233,196,248,144,252,176,1,244,12,102,46,48,38,54,87,160,27,18,246]},"announce":[],"urlList":[]}}