{"title":"Gravity Guy 2 v1.0.1 Mod (Free Shopping)","uid":8997643,"size":18946067,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0456f201153637045cf5613cffab36bb53b6f075&amp;dn=Gravity+Guy+2+v1.0.1+Mod+%28Free+Shopping%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1380896649,"description":"\nTHE LONG AWAITED SEQUEL TO ONE OF OUR MOST SUCCESSFUL GAMES IS FINALLY HERE! GET READY FOR GRAVITY GUY 2!\n\nSTORY\n\nIn a world where gravity laws were broken, a brave guy was held captive for rebelling and defying the rules! Being the first one ever to rise against the system, he found himself in danger, and in need to run for his life.\n\nHowever, after being relentlessly chased down by the Gravity Troops, our hero was finally captured and beamed up to a space ship, only to find a terrifying truth: they were going to clone him.\n\nAs an evil plan to organize dangerous races across Gravity Guy's once free world, his DNA was collected and the cloning process began. Along with our hero, other inhabitants were also cloned, so that every time someone loses, the race can be restarted.\n\nABOUT THE GAME\n\nOur brave Guy now finds himself on top of towers running for his life, jumping from one platform to another, while avoiding many hazards placed across his path. Just tap the button on the right side of the screen to raise the lifts and on the right to perform a jump - which will definitely come in handy!\n\nThere are 7 different clones to be used, each with its own special abilities:\nNeon, Troop, Girl, Slim, Beast, Mech and Beauty!\n\nCollect coins and earn points in order to unlock new power slots, and level up to get bonuses. Choose the power up you want in your next level! You can use the coins to purchase the power supplies in the shop!\n\nKEY FEATURES:\n\n- Amazing retina graphics \n- Simple two-button tap controls \n- Interactive tutorial to learn how to play\n- Google Games services integration: Achievements and Leaderboards\n- Fast and fun gameplay\n- 7 Different characters to choose from\n- Fully stocked shop and many power ups\n\nAny in-app purchase will remove the ads.\n\nMore info:\n  &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.miniclip.ggorigins&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.miniclip.ggorigins&lt;/a&gt;\n\n\nInstructions: Mod by Twingo\n\nInstall apk file and play the game, select anything you want to purchase! it's free!.\n","torrent":{"xt":"urn:btih:0456f201153637045cf5613cffab36bb53b6f075","amp;dn":"Gravity+Guy+2+v1.0.1+Mod+%28Free+Shopping%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0456f201153637045cf5613cffab36bb53b6f075","infoHashBuffer":{"type":"Buffer","data":[4,86,242,1,21,54,55,4,92,245,97,60,255,171,54,187,83,182,240,117]},"announce":[],"urlList":[]}}