{"title":"Tubeway Army - Are 'Friends' Electric [Old Grey Whistle Test, 19","uid":10983183,"size":167610368,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:05e0440e20e1c3667166022831424c75026c5f3b&amp;dn=Tubeway+Army+-+Are+%27Friends%27+Electric+%5BOld+Grey+Whistle+Test%2C+19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1409885483,"description":"Tubeway Army - Are 'Friends' Electric [Old Grey Whistle Test, 1979].VOB\n\n\nHQ rare live performance music video from a promo DVD. &quot;Are 'Friends' Electric?&quot; is a song by English new wave band Tubeway Army from their 1979 album Replicas. It was released as a single in May 1979 and reached No. 1 in the UK Singles Chart, staying there for four weeks. It was written by Gary Numan, the band's frontman and lead vocalist.\n\nDespite being over five minutes long and possessing, in the words of its composer, &quot;no recognisable hook-line whatsoever&quot;, the single topped the UK charts. Whilst the track's distinctive sound stood out at the time, sales also benefited from the record company's use of a picture disc and Numan's striking, &quot;robotic&quot; performance on the TV shows The Old Grey Whistle Test and Top of the Pops. &quot;Are 'Friends' Electric?&quot; has been a mainstay of Numan's concerts since its release and appears on all ten of his official live recordings to date. A semi-acoustic version appeared on the 2006 Jagged tour setlist.\n\nA special picture-disc helped boost sales but what particularly grabbed the British public's imagination was Tubeway Army's appearance on the BBC show The Old Grey Whistle Test\n\n\nTubeway Army were a London-based punk rock and new wave band led by lead singer Gary Numan. They were the first band of the post-punk era to have a synthesizer-based number one hit, with their single &quot;Are 'Friends' Electric?&quot; and its parent album Replicas both topping the UK Album Chart in mid-1979. After its release, Numan opted to drop the Tubeway Army name and release music under his own name as he was the sole songwriter, producer and public face of the band, but he retained the musicians from Tubeway Army as his backing band.\n\nGary Numan (born Gary Anthony James Webb on 8 March 1958) is an English singer, composer, and musician, most widely known for his chart-topping 1979 hits &quot;Are 'Friends' Electric?&quot; (as Tubeway Army) and &quot;Cars&quot;. His signature sound consisted of heavy synthesiser hooks fed through guitar effects pedals.\n\nNuman is considered a pioneer of commercial electronic music. His use of themes from science fiction, and his combination of aggressive punk energy with electronics, have been widely imitated.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Are_'Friends'_Electric%3F&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Are_'Friends'_Electric%3F&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/CAAmbAAGd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CAAmbAAGd&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 9800kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:05:05\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.6\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:05e0440e20e1c3667166022831424c75026c5f3b","amp;dn":"Tubeway+Army+-+Are+%27Friends%27+Electric+%5BOld+Grey+Whistle+Test%2C+19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05e0440e20e1c3667166022831424c75026c5f3b","infoHashBuffer":{"type":"Buffer","data":[5,224,68,14,32,225,195,102,113,102,2,40,49,66,76,117,2,108,95,59]},"announce":[],"urlList":[]}}