{"title":"Clusters and Economic Growth in Asia - Pdf - Yeal","uid":9380622,"size":3240303,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06a3f6b1795aecb5949a089648c07036094ccc68&amp;dn=Clusters+and+Economic+Growth+in+Asia+-+Pdf+-+Yeal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KhushSidhu","files":1,"time":1387707583,"description":"Clusters and Economic Growth in Asia\n\nBy Soren Eriksson\n\n208 pages - Publisher: Edward Elgar Pub\nYear - 2013 - Language: English - Pdf\nISBN-10: 0857930087 - ISBN-13: 978-0857930088\n\nThis detailed book explores and provides insights into the development and transformation of various clusters, economies and industrial sectors in East and Southeast Asia.\n\nThe authors study a number of important issues including the role of information and communication technology in economic growth, an emerging biomedical cluster in South Korea, an industrial agglomeration of Taiwanese electronics firms in China, and different sectorial and regional growth models in China. They also investigate the increasing relevance of cluster policies and the need to understand them in the context of the institutional and structural transition of newly industrializing East Asian economies. The book moves on to study the technology intensity of FDI in Vietnam and the implications for economic growth and emerging clusters, as well as the origin and characteristics of foreign technology transfer in a Chinese aircraft industry cluster.\n\nClusters and Economic Growth in Asia will greatly appeal to academics, researchers, politicians, policy planners and industrial specialists, as well as those with a specific interest in clusters and economic growth in Asian economies.","torrent":{"xt":"urn:btih:06a3f6b1795aecb5949a089648c07036094ccc68","amp;dn":"Clusters+and+Economic+Growth+in+Asia+-+Pdf+-+Yeal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06a3f6b1795aecb5949a089648c07036094ccc68","infoHashBuffer":{"type":"Buffer","data":[6,163,246,177,121,90,236,181,148,154,8,150,72,192,112,54,9,76,204,104]},"announce":[],"urlList":[]}}