{"title":"Johnny Ringo","uid":15566609,"size":9591361525,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:06e6c89b8cdd55b4bf7befea0486cd44a717d382&amp;dn=Johnny+Ringo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Psychodad149","files":47,"time":1471207396,"description":"Classic Western series from the Golden Age of the American TV Western!\r\n&quot;Johnny Ringo&quot; aired on CBS from October 1, 1959 until June 30, 1960, with 38 episodes. Starred Don Durant as Johnny Ringo, co-starred Mark Goddard as Cully, better known later as Maj. Don West on &quot;Lost In Space,&quot; in his first TV role. One of Aaron Spelling's early productions.\r\n\r\nThe character of Johnny Ringo in the series can be described as being extremely loosly based on the real Ringo, if one is being generous. Little more than the name and era are accurate. The real Ringo was a standard Western outlaw who tangled with the Wyatt Earp gang, and was never a lawman himself.\r\nRingo and Cully are sheriff and deputy of the fictional frontier town of Velardi, Arizona Territory. Ringo comes to town as a gunslinger to rid them of the villainous saloonkeeper and cheating gambler played by James Coburn. When his job is done, he is persuaded to stay on as sheriff. By the second episode, Cully has arrived and is likewise persuaded to serve as deputy. (He has come to town as a trick shooter with a traveling show.)\r\n\r\nTerence DeMarney played Case Thomas, storekeeper, town drunk, and sheriff's deputy in the first episode only. Karen Sharp played his daughter Laura, who provides a love interest for Ringo.\r\n\r\nAs in a few other Westerns of the time, Sheriff Ringo has a distinctive sidearm, a LeMat-style pistol which carries the customary six .45 rounds in a revolver cylinder, but also loads a single .410 shotgun shell in the underbarrel. The title sequence shows the effect of all seven rounds being discharged against a wall.\r\n\r\nDurant was known also as one of the era's &quot;singing cowboys,&quot; who not only wrote but actually performed the show's (unremarkable) theme song, and occasionally sings in the show.\r\n\r\nThe show attracted a number of guest stars with still-recognized names, some before they were well-known, including James Coburn (as noted above), a VERY young Ron Howard, John Carradine, Vic Morrow, Buddy Ebsen, Wayne Rogers, Robert Culp, and others (including a few who would appear again with Goddard on &quot;Lost In Space.&quot;)\r\n\r\n&quot;Johnny Ringo&quot; is, to the best of our knowledge, in the public domain. These episodes were recorded by a third party from a local TV station and bear indicia of local broadcast","torrent":{"xt":"urn:btih:06e6c89b8cdd55b4bf7befea0486cd44a717d382","amp;dn":"Johnny+Ringo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06e6c89b8cdd55b4bf7befea0486cd44a717d382","infoHashBuffer":{"type":"Buffer","data":[6,230,200,155,140,221,85,180,191,123,239,234,4,134,205,68,167,23,211,130]},"announce":[],"urlList":[]}}