{"title":"From Darkness Comes- The Horror Box Set (EPUB, MOBI, PDF, AZW3)","uid":10781452,"size":11485529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07453b3ed1194abf26e9190aa8d37503366762dc&amp;dn=From+Darkness+Comes-+The+Horror+Box+Set+%28EPUB%2C+MOBI%2C+PDF%2C+AZW3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1408166697,"description":"The new anthology from Thorn Publishing, including many authors currently ranked on Amazon's Top 100 Most Popular Authors in Horror. Add it to your cart NOW because it is available for a limited time! \nFANS OF HORROR -&gt; 8 TITLES FROM 8 INCREDIBLE AUTHORS! Do you love horror? From Darkness Comes will keep you reading for days. Get this collection now. It includes 8 novels from 8 of today's best-selling writers of horror. \n*This anthology contains scenes of graphic violence that are intended for adults and may be offensive to sensitive readers. Some titles in the anthology are the first book in a series, and others are standalone novels (review average and count accurate as of February 28th, 2014). \n\n\nFrom Darkness Comes includes:\n\n\n~That Ghoul Ava by TW Brown (4.6 stars on 18 reviews)\n\n~Kin by Kealan Patrick Burke (4.5 stars on 87 reviews)\n\n~The Colony: Genesis by Michaelbrent Collings (4.3 stars on 56 reviews)\n\n~Chronicler of the Undead by Mainak Dhar (4.4 stars on 26 reviews)\n\n~Painted Darkness by Brian James Freeman (3.8 stars on 48 reviews)\n\n~Chasing Spirits by Glynn James (4.2 stars on 22 reviews)\n\n~The Home by Scott Nicholson (3.7 stars on 299 reviews)\n\n~Preta's Realm: The Haunting (Book 1 of The Hidden Evil Trilogy) by J. Thorn (4.0 stars on 50 reviews)\n\n\nAny fan of &quot;American Horror Story&quot; or &quot;The Twilight Zone&quot; will love From Darkness Comes","torrent":{"xt":"urn:btih:07453b3ed1194abf26e9190aa8d37503366762dc","amp;dn":"From+Darkness+Comes-+The+Horror+Box+Set+%28EPUB%2C+MOBI%2C+PDF%2C+AZW3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07453b3ed1194abf26e9190aa8d37503366762dc","infoHashBuffer":{"type":"Buffer","data":[7,69,59,62,209,25,74,191,38,233,25,10,168,211,117,3,54,103,98,220]},"announce":[],"urlList":[]}}