{"title":"Reminiscences of Nehru Age (1978) Truth about Jawharlal Nehru@Ma","uid":6075656,"size":110934579,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:077ff8589afce073bf051d16cb79a1504dea0ca4&amp;dn=Reminiscences+of+Nehru+Age+%281978%29+Truth+about+Jawharlal+Nehru%40Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"amanrulz","files":2,"time":1293821790,"description":"mastitorrents.com\n &lt;a href=&quot;\nhttp://mastitorrents.com/forums/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mastitorrents.com/forums/index.php&lt;/a&gt;\n\n# Hardcover: 316 pages\n\n# Publisher: Vikas Publishing House (1978)\n\n# Language: English\n\n# Scanned Copy\n\n# Credit to original releaser\n\n\n\n\n\n\nREVIEW\n\nThe book is about Jawaharlal Nehru, his political, family and social life.\n\nOne case is very graphically described by M.O. Mathai on page 206. Mathai writes: &quot;In the autumn of 1948 (India became free in 1947 and a great deal of work needed to be done) a young woman from Banaras arrived in New Delhi as a Sanyasini named Shraddha Mata (an assumed and not a real name).\n\nShe was a Sanskrit scholar well versed in the ancient Indian scriptures and mythology. People, including MPs, thronged to her to hear her discourses. One day S.D. Upadhyaya, Nehru?s old employee, brought a letter in Hindi from Shraddha Mata. Nehru gave her an interview in the PM?s house. As she departed, I noticed (Mathai is speaking here) that she was young, and beautiful. Chatings with her became rather frequent, mostly after Nehru finished his work at night.\n\nDuring one of Nehru?s visits to Lucknow, Shraddha Mata turned up there, and Upadhyaya brought a letter from her as usual. Nehru sent her the reply; and she visited Nehru late in the night ... Suddenly Shraddha Mata disappeared.\n\nIn November 1949 a convent in Bangalore sent a decent looking person to Delhi with a bundle of letters. He said that a young woman from northern India arrived at the convent a few months ago and gave birth to a baby boy. She refused to divulge her name or give any particulars about herself. She left the convent as soon as she was well enough to move out but left the child behind. She however forgot to take with her a small cloth bundle in which, among other things, several letters in Hindi were found. The Mother Superior, who was a foreigner, had the letters examined and was told they were from the Prime Minister. The person who brought the letters surrendered them...&quot;I (Mathai) made discreet inquiries repeatedly about the boy but failed to get a clue about his whereabouts. Convents in such matters are extremely tight-lipped and secretive. Had I succeeded in locating the boy, I would have adopted him. He must have grown up as a Catholic Christian blissfully ignorant of who his father was.&quot;\n\n\n\n\n\nAbout the Author\n\nM.O. Mathai (1909-1981) was assistant to India's first Prime Minister, Jawaharlal Nehru. Mathai worked with the United States Army in India before becoming an assistant to Nehru in 1946. He resigned in 1959 following Communist allegations of misuse of power. Later he wrote two books on his alleged experieces of Nehru and his times, which became controversial.\n\nOne of Mathai's letters (UO No D/S13170 of 2/12/1954) digged out by the Delhi-based non-profit trust Mission Netaji had become controversial in 2006.[1] The letter indicated that the ashes of Netaji Subhas Chandra Bose was received in India in the 1950s. This information is contradictory to the Indian government's opinion that Bose's ashes are kept in Renkoji temple in Japan.\n\nMathai died in 1981 of a heart attack in Madras at the age of 72 years.","torrent":{"xt":"urn:btih:077ff8589afce073bf051d16cb79a1504dea0ca4","amp;dn":"Reminiscences+of+Nehru+Age+%281978%29+Truth+about+Jawharlal+Nehru%40Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"077ff8589afce073bf051d16cb79a1504dea0ca4","infoHashBuffer":{"type":"Buffer","data":[7,127,248,88,154,252,224,115,191,5,29,22,203,121,161,80,77,234,12,164]},"announce":[],"urlList":[]}}