{"title":"The Nightingale - Kristin Hannah","uid":13024522,"size":613154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:092bf8d1bdbb5922b4e3fef9c8da77cdaf0feab8&amp;dn=The+Nightingale+-+Kristin+Hannah&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1450388818,"description":"The Nightingale - Kristin Hannah\r\n\r\n\r\nIn love we find out who we want to be.\r\n\r\nIn war we find out who we are.\r\n\r\nFRANCE, 1939\r\n\r\nIn the quiet village of Carriveau, Vianne Mauriac says goodbye to her husband, Antoine, as he heads for the Front. She doesn't believe that the Nazis will invade France … but invade they do, in droves of marching soldiers, in caravans of trucks and tanks, in planes that fill the skies and drop bombs upon the innocent. When a German captain requisitions Vianne's home, she and her daughter must live with the enemy or lose everything. Without food or money or hope, as danger escalates all around them, she is forced to make one impossible choice after another to keep her family alive.\r\n\r\nVianne's sister, Isabelle, is a rebellious eighteen-year-old girl, searching for purpose with all the reckless passion of youth. While thousands of Parisians march into the unknown terrors of war, she meets Gäetan, a partisan who believes the French can fight the Nazis from within France, and she falls in love as only the young can … completely. But when he betrays her, Isabelle joins the Resistance and never looks back, risking her life time and again to save others.\r\n\r\nWith courage, grace and powerful insight, bestselling author Kristin Hannah captures the epic panorama of WWII and illuminates an intimate part of history seldom seen: the women's war. The Nightingale tells the stories of two sisters, separated by years and experience, by ideals, passion and circumstance, each embarking on her own dangerous path toward survival, love, and freedom in German-occupied, war-torn France--a heartbreakingly beautiful novel that celebrates the resilience of the human spirit and the durability of women. It is a novel for everyone, a novel for a lifetime.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:092bf8d1bdbb5922b4e3fef9c8da77cdaf0feab8","amp;dn":"The+Nightingale+-+Kristin+Hannah","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"092bf8d1bdbb5922b4e3fef9c8da77cdaf0feab8","infoHashBuffer":{"type":"Buffer","data":[9,43,248,209,189,187,89,34,180,227,254,249,200,218,119,205,175,15,234,184]},"announce":[],"urlList":[]}}