{"title":"Big business poor peoples - How transnational Corporations damag","uid":7928849,"size":914217,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b3af886735ee55a8017a37b11083626f6ad4bbd&amp;dn=Big+business+poor+peoples+-+How+transnational+Corporations+damag&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KatQwerty","files":3,"time":1355671250,"description":"Are Transnational Corporations the solution to poverty in the Third World or, alternatively, are they part of the problem? \n\nThis is John Madeley's central concern in this exploration of a little-investigated aspect of large corporations. TNCs are usually promoted as bringing rapid economic growth, jobs, and development generally. Yet inequality between North and South, and within countries, continues to grow. So what really is happening?\n\n\nThe author examines the impact on the poor of TNC activities in the main economic sectors where the invest and sell their products--agriculture, forestry, fisheries, mining, oil extraction, manufacturing and tourism. He charts how natural resources are being ceded to TNCs at the expense of local communities. He shows how weak are the productive links that much TNC activity actually makes with national economies. He documents how the power of governments to control these corporations is declining. \n\n\nYet the news is not all bad. Producers, consumers, local communities, even shareholders are beginning to demand that large corporations behave in ways where profits are only one of the obligations incumbent upon them.","torrent":{"xt":"urn:btih:0b3af886735ee55a8017a37b11083626f6ad4bbd","amp;dn":"Big+business+poor+peoples+-+How+transnational+Corporations+damag","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b3af886735ee55a8017a37b11083626f6ad4bbd","infoHashBuffer":{"type":"Buffer","data":[11,58,248,134,115,94,229,90,128,23,163,123,17,8,54,38,246,173,75,189]},"announce":[],"urlList":[]}}