{"title":"Chief Architect X2 v12.4.0.23 Update","uid":4932877,"size":128926723,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0b661718b7d65f41d26d83d9523c9ffdf0643f8a&amp;dn=Chief+Architect+X2+v12.4.0.23+Update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Knight-Mage","files":-1,"time":1244121591,"description":"This was released on the Green Demon a couple days ago. This is a full working crack of Chief Architect X2 v12.4.0.23. This contains the update and the crack.\n\nFirst, you need to make sure that you install the full version of Chief Architect, which can be found on this site or elsewhere. Then update to the new version with the updater found in this torrent. Last, copy of &quot;Chief Architect X2.exe&quot; found in this torrent to the install directory of Chief Architect X2, usually C:\\Program Files\\Chief Architect\\Chief Architect X2\\, and overwrite that exe. Or you can back up the original if you wish.\n\nEDIT:\nDoes anybody know the link to the Full ISO of Chief Architect X2 here on TPB? I can't seem to find it. :S I think a lot of torrent sites deleted the GRB ISO since their crack didn't work. But this crack makes it work. If you have the full ISO or you still have it installed then you can just install this. :) If you need to download the ISO again, then you can find it on the Green Demon and Mininova. I used asearch and could not find TPB on any of the torrents. Maybe someone can re-upload the torrent now that a working crack is here?\nEnd Edit\n\nWhy this crack exists:\nThe GRB release left some copy protection in so that after 80 mouse clicks the program shut down. A proper release of their 12.3.x.x release was released by by the same person as this crack, but then there was a new update, so a new crack had to be made for it.\n\nSo this is a fully working proper crack of CA X2. So enjoy.\n\nRemember, if love this software, buy it!\n\nPlease help seed.\n\n\nThis is clean. If any anti-virus says otherwise, then stop using it because it's giving you a false positive and then use a real anti-virus that doesn't have false positives. I don't like viruses as much as the other person, so I will not upload that crap.\n\nEnjoy.","torrent":{"xt":"urn:btih:0b661718b7d65f41d26d83d9523c9ffdf0643f8a","amp;dn":"Chief+Architect+X2+v12.4.0.23+Update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b661718b7d65f41d26d83d9523c9ffdf0643f8a","infoHashBuffer":{"type":"Buffer","data":[11,102,23,24,183,214,95,65,210,109,131,217,82,60,159,253,240,100,63,138]},"announce":[],"urlList":[]}}