{"title":"War Walks   (BBC 1996 - Season 1 - Complete)","uid":7256593,"size":1454821968,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b802f470640f586d1cd56d69c4725caa4ad66b8&amp;dn=War+Walks+++%28BBC+1996+-+Season+1+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucybabe","files":8,"time":1336601900,"description":"Series 1 of the this BBC2 military history series presented by Professor Richard Holmes.\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/War_Walks&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/War_Walks&lt;/a&gt;\n\n\n1415 Agincourt\n\n&quot;In October 1415, starving and riddled with disease, a tiny English army defeated a French force that outnumbered it by 5 to 1. This epic victory has flashes of storybook heroism, set against a darker backdrop of horror and butchery. Today, you can still follow in King Henry V's footsteps on the road that leads to Agincourt.&quot; (Opening Narration)\n\nTransferred from an analogue VHS recording from the original Television broadcast. The quality is not as good as the other recent episode uploads unfortunately so if anyone has a better copy I will gladly delete this one.\n\n\nWar Walks 2 Waterloo\n\nIn this series looking at warfare, Professor Richard Holmes visits the site of Wellington's victory against Napoleon-Waterloo. He quotes from the diaries and letters of those who fought at Waterloo.\n\nTransferred from an analogue VHS recording from the original Television broadcast.\n\n\nWar Walks 3 Mons\n\nThe history of the 1914 Battle of Mons, when 100,000 British troops were forced to retreat into France by German forces equipped with machine-guns and heavy artillery.\n\nProfessor Richard Holmes charts the course of the conflict and hears the experiences of men who fought in it.\n\nTransferred from an analogue VHS recording from the original Television broadcast.\n\n\n\nWar Walks 4 The Somme\n\nRichard Holmes traces the events of the Battle of the Somme, the blackest episode in British military history, when 57,000 Allied soldiers were killed or wounded in a matter of hours.\n\nTransferred from VHS Tape of the original television broadcast.\n\n\nWar Walks 5 Arras\n\nMilitary historian Richard Holmes recounts the German invasion of France in 1940, when Allied forces attempted to halt the Panzer divisions' relentless advance. Nazi commanders bypassed the fortified Maginot line by invading via Belgium, sweeping aside a makeshift opposition comprising over-age reservists, a French North African cavalry unit and outmoded British tanks. The Allies eventually launched a counter-attack near Arras : but by then it was too late.\n\nTransferred from an analogue VHS recording from the original Television broadcast.\n\n\n\nWar Walks 6 Goodwood\n\nRichard Holmes provides an insight into the events of Operation Goodwood, the Allied forces' armoured break-out of the bridgehead at Normandy in 1944, revealing how a German officer's order resulted in the destruction of advancing British tanks. However, the battle - later described as the 'death ride of the armoured divisions' - succeeded in distracting enemy forces from a simultaneous American push\n\nTransferred from an analogue VHS recording from the original Television broadcast.\n","torrent":{"xt":"urn:btih:0b802f470640f586d1cd56d69c4725caa4ad66b8","amp;dn":"War+Walks+++%28BBC+1996+-+Season+1+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b802f470640f586d1cd56d69c4725caa4ad66b8","infoHashBuffer":{"type":"Buffer","data":[11,128,47,71,6,64,245,134,209,205,86,214,156,71,37,202,164,173,102,184]},"announce":[],"urlList":[]}}