{"title":"Power Rangers: Mighty Morphin' S03/Movie 1 (Legacy Collection)","uid":11734027,"size":13607850467,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b8ab23740ebcedd9d0bbdcf750f3e672632e6cc&amp;dn=Power+Rangers%3A+Mighty+Morphin%27+S03%2FMovie+1+%28Legacy+Collection%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"CeraKesh","files":35,"time":1425489253,"description":"Rangers Forever! Earth's defenders never surrender!\n\nPrevious torrents have run into problems of my source files hashing differently and therefore can't be completed. I tried remaking it with some variations in piece size and now my local copy rechecks 100%. So please try this (it uses the same folder as the original but I'd HIGHLY recommend backing up your files from the original torrent just in case). If this works, I'll re-make torrents for the other files.\n\nThese are HQ rips from the Power Rangers Legacy Collection DVDs. Included is the (non-canon) Mighty Morphin' Power Rangers The Movie (ripped from the latest DVD version).\n\n \nMighty Morphin Power Rangers: The Movie was created by Saban Entertainment and released by 20th Century Fox in the summer of 1995. The movie stars the same actors from the 1994-1995 version of the Mighty Morphin Power Rangers television series.\n\nWhen an egg in Angel Grove is unearthed, Lord Zedd and Rita Repulsa release the creature inside, Ivan Ooze. Zordon trapped him inside thousands of years ago, so Ivan leaves to seek revenge. Ivan destroys the interior of the Command Center, almost killing Zordon, weakening and slightly diswiring Alpha 5, and causing the Power Rangers to lose their powers. The Power Rangers must go on a quest to find new Ninja powers on Phaedos, granted to them by Dulcea (played by Gabrielle Fitzpatrick). The Rangers find the powers located in a temple, along with new Zords, themed to the Ape, Frog, Wolf, Bear, Crane, and Falcon. The Zords' appearances are based on those of the Super Stealth Beast Gods from the Super Sentai series Ninja Sentai Kakuranger.\n\n \nMighty Morphin Power Rangers Season 3 was the final season to carry the &quot;Mighty Morphin'&quot; name. Its Sentai source was Ninja Sentai Kakuranger, which translated into Ninja Squadron Hidden Ranger. However, alongside Season 2, it did not use the Kakuranger suits for the core Rangers and were used for the Alien Ranger series instead. Much of the season was also heavily serialized, with multiple-part storylines sowing the seeds for events such as the Masked Rider television series, the eventual departure of long-running character Kimberly and the events that would tie directly into the opening episodes of Mighty Morphin Alien Rangers.\n\nDuring the last airing of this Season until Power Rangers Zeo premiered, the &quot;Today on Power Rangers&quot; segments were replaced with the Zeo Serial shorts","torrent":{"xt":"urn:btih:0b8ab23740ebcedd9d0bbdcf750f3e672632e6cc","amp;dn":"Power+Rangers%3A+Mighty+Morphin%27+S03%2FMovie+1+%28Legacy+Collection%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b8ab23740ebcedd9d0bbdcf750f3e672632e6cc","infoHashBuffer":{"type":"Buffer","data":[11,138,178,55,64,235,206,221,157,11,189,207,117,15,62,103,38,50,230,204]},"announce":[],"urlList":[]}}