{"title":"GAY PORN-[Eurocreme] BBMC - FOR A FEW INCHES MORE.avi","uid":4155920,"size":1172339130,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0daa86df86f96b718f127c207e9b23b9baf72c2e&amp;dn=GAY+PORN-%5BEurocreme%5D+BBMC+-+FOR+A+FEW+INCHES+MORE.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"NOFXMAC","files":1,"time":1209152679,"description":"Running Time: 95 mins\nYear: 2008\nStarring: Jeffery Radden, Julien Breeze, Leo Coat, John Magiaty, Jerry Draw, Chris Ralf, David Garret, Mark Zebro, Mike Sorrow, Andrew Shut, Billy Jay\nDirector: Vlado Iresch\nStudio: Eurocreme\nCountry: UK, Language: English\n\nSummary:\nStunningly sexy blonde beauties and slim smoothies getting their butts ripped apart by hung young studs, forcing their rock hard weapons into their tight butts and then getting them to bounce hard and fast onto them, so their own dicks throb and wave about as they enjoy every extra inch slipping into them totally raw.\n\nDescription / Review:\nScene One: Cute blonde boy Julien and his slim sexy mate Andrew are getting hot and horny watching massive dicks on their computer when dark haired stud David pops round with a toy designed perfectly for young Julien. Working his smooth body and getting rock hard, Julien uses the pumping action to massage his cock until the whole thing fills with creamy boy juice!! Wanting to dump their loads, David and Andrew get busy with each other when Julien zips up and leaves, taking in as much cock into their mouths as possible, Andrew getting a great face fuck as his tonsils are hammered by solid dick. After all that tongue teasing, it?s no wonder Andrew wants to enjoy the fruits of his labour and have his ass pummelled by David?s big dick totally bareback. Andrew?s bouncing dick stay rock hard as he gets every inch deeper. The doggy style fucking gives us the best view of that veiny dick sliding in as Andrew jerks himself into a frenzy.\n\nScene Two: Craving hot action in the station toilets, cute Chris and his tall dark haired mate stumble across the truly monstrously huge dicked Billy Jay taking a piss next to them. Unable to let the opportunity pass them, they ask for a feel, and soon get much more than that!! Both guys take it in turns to drop to their knees and suck two cocks at once, stretching their lips around Billy?s enormous meat. Chris gets spit roasted there and then, his mate giving it up the ass as Chris is still latched onto Billy, not that we can blame him!! Being loosened up, Chris is spun round to have his hole ripped apart by Billy?s thick dick as he chows down on his mate, getting a final spunking from both lads all over his face.\n\nScene Three: Hung dude Mark Zebro is joined by two mates as they strip each other and get to work on hot cocks and slim smooth bodies. Tattooed Jerry and dark haired John share his cock, taking it down their throats as he truly fucks their faces hard. Blondie Andrew from scene 1 is back working out on the chest press, and swiftly moves to his dick as he watches these three hotties go at it on the sofa. Sexy new face Jerry has great hair, great legs, and an awesome body which you?d just love to rub up and down all day long. Mark?s got serious energy reserves and is constantly sucking, jerking and soon fucking the nearest tight ass his long cock can find!! Blowing his load, Andrew leaves the threesome just as the fucking starts, and John squats over Jerry, getting pounded from both ends. Mark gives John an almighty fucking, absolutely using the poor boys ass with his long, rock hard cock, making him all but scream with each thrust forward.\n\nScene Four: Dr Radden sees his patients into his surgery and gives them a proper going over. Sucking both dicks and getting blonde Julien to slide down onto a dildo, working his hole loose ready for the tanned boy to come and spread his cheeks wider and pound his sweet ass hard and fast. Both toned young studs descend on Julien, Jeffery ripping off his suit in anticipation for the awesome fucking he?s going to give, and by the amount of cum that Julien is left splattered over his smooth young body, the job was really worth it!!","torrent":{"xt":"urn:btih:0daa86df86f96b718f127c207e9b23b9baf72c2e","amp;dn":"GAY+PORN-%5BEurocreme%5D+BBMC+-+FOR+A+FEW+INCHES+MORE.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0daa86df86f96b718f127c207e9b23b9baf72c2e","infoHashBuffer":{"type":"Buffer","data":[13,170,134,223,134,249,107,113,143,18,124,32,126,155,35,185,186,247,44,46]},"announce":[],"urlList":[]}}