{"title":"The Search [1948] @ ","uid":7022860,"size":734373888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0e2ca86ba422a246083c0391091a678a343b845b&amp;dn=The+Search+%5B1948%5D+%40+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":-1,"time":1328902814,"description":"This is off a $1.99 disc so no enhancements\ndidn\\'t find any copies of it around so thought i would share it\nthis movie shows what may or does happen after or during any war\n\nStoryline\n\nA silent nine-year-old Czech boy, a survivor of Auschwitz, flees a refugee center in postwar Germany and is found by an American G.I. At the same time, the boy\\'s mother, the sole surviving member of his family, searches refugee centers for her son. Time, distance, and the massive numbers of refugee children are factors hampering the reunion of mother and son. \n\nUser review\n\nMontgomery Clift makes his film debut here, playing an American soldier in postwar Germany who takes in a young Czech boy apparently left orphaned in the wake of the Nazi takeover, unaware the youngster\\'s mother is still alive and is combing all the Location Centers hoping to be reunited with her child. Yes, it\\'s sentimental, but it isn\\'t cloying; the film\\'s tone is balanced with several hard-hitting emotional moments and beautifully eerie black-and-white cinematography (filmed on location in U.S. Occupied Germany). A bit pedantic and overwritten, especially near the climax, but it may be useful as a tentative introduction to young people of this turbulent time in history. Clift, gaunt and somewhat green, is indeed likable and shows fine timing in his scenes with Ivan Jandl, a natural who won a Golden Globe and a Special Oscar for Outstanding Juvenile Performance. The original story also copped a statue.","torrent":{"xt":"urn:btih:0e2ca86ba422a246083c0391091a678a343b845b","amp;dn":"The+Search+%5B1948%5D+%40+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e2ca86ba422a246083c0391091a678a343b845b","infoHashBuffer":{"type":"Buffer","data":[14,44,168,107,164,34,162,70,8,60,3,145,9,26,103,138,52,59,132,91]},"announce":[],"urlList":[]}}