{"title":"The Fat Man - A Tale of North Pole Noir - Ken Harmon.epub","uid":9414666,"size":1086596,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f39c2cedf54a15e43b9e7f0b1e27043d7187e7e&amp;dn=The+Fat+Man+-+A+Tale+of+North+Pole+Noir+-+Ken+Harmon.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1388408856,"description":"A satire of traditional Christmas stories and noir, The Fat Man makes the perfect gift for the literary-minded.\n\nA hardboiled elf is framed for murder in a North Pole world that plays reindeer games for keeps, and where favorite holiday characters live complex lives beyond December.\n\nFired from his longtime job as captain of the Coal Patrol, two-foot-three inch 1,300-year-old elf Gumdrop Coal is angry. He's one of Santa's original elves, inspired by the fat man's vision to bring joy to children on that one special day each year. But somewhere along the way things went sour for Gumdrop. Maybe it was delivering one too many lumps of coal for the Naughty List. Maybe it's the conspiracy against Christmas that he's starting to sense down every chimney. Either way, North Pole disillusionment is nothing new: Some elves brood with a bottle of nog, trying to forget their own wish list. Some get better. Some get bitter. Gumdrop Coal wants revenge. Justice is the only thing he knows, and so he decides to give a serious wakeup call to parents who can't keep their vile offspring from landing on the Naughty List. But when one parent winds up dead, his eye shot out with a Red Ryder Carbine-Action Two-Hundred-Shot Range Model BB gun, Gumdrop Coal must learn who framed him and why. Along the way he'll escape the life-sucking plants of the Mistletoe Forrest, battle the infamous Tannenbomb Giant, and survive a close encounter with twelve very angry drummers and their violent friends. The horrible truth lurking behind the gingerbread doors of Kringle Town could spell the end of Christmas-and of the fat man himself. Holly Jolly!","torrent":{"xt":"urn:btih:0f39c2cedf54a15e43b9e7f0b1e27043d7187e7e","amp;dn":"The+Fat+Man+-+A+Tale+of+North+Pole+Noir+-+Ken+Harmon.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f39c2cedf54a15e43b9e7f0b1e27043d7187e7e","infoHashBuffer":{"type":"Buffer","data":[15,57,194,206,223,84,161,94,67,185,231,240,177,226,112,67,215,24,126,126]},"announce":[],"urlList":[]}}