{"title":"Barbra Streisand -  in Concert 2006 Bluray 720p [MP4-AAC](oan)","uid":6609681,"size":2761051634,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0fca84b4c6fca86fb14947e0ad6ca637392f6ee1&amp;dn=Barbra+Streisand+-++in+Concert+2006+Bluray+720p+%5BMP4-AAC%5D%28oan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"oneanight","files":-1,"time":1313546178,"description":"Barbra Streisand Live in Concert 2006 Bluray 720p [MP4-AAC](oan)\n &lt;a href=&quot;\nhttp://leetleech.org/images/24571514950389956304.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://leetleech.org/images/24571514950389956304.jpg&lt;/a&gt;\n\nA singularly impressive concert film, a record of Barbra Streisand's 2006 tour and shot mainly\nduring performances in Sunrise, Florida, Streisand features a phenomenal late-career\nperformance by the singer-actress and sometimes-director, while the film of the event - codirected\nby Streisand as well - is both intimate and epic, capturing the excitement and\nsynergy between artist and audience exceptionally well. The Blu-ray disc is also impressive,\nwith excellent video and audio, some good extra features, and well-designed menu screens.\nThe show, also known as Streisand: Live in Concert 2006 was broadcast April 25 on CBS;\nthis network airing apparently is the reason behind the Blu-ray's delay in the U.S., as it's\nalready available in the United Kingdom. We received a check disc for this review. (Note:\nReader &quot;tlw404&quot; informs us that it &quot;was delayed until June due to an arrangement with Barnes\nand Noble for an exclusive sale.&quot;)\n\nFull disclosure: I should say right up front that I'm not at all enamored of Barbra Streisand's\nmovies - in both her musicals and non-musicals, in films she's directed herself and those\ndirected by others, she tends to overwhelm with her presence, arguably sacrificing\nverisimilitude for the sake of what generally have been post-Classical Hollywood star-driven\nvehicles. There's nothing wrong with this per se - in one sense Streisand's movies were much\nlike Marlene Dietrich's of the 1930s, or Doris Day's in the 1950s, and it would be unfair to\ncondemn her for wanting to take as much control over her projects as she could get. But as a\nbiopic Funny Girl has less to do with Fanny Brice than Barbra Streisand, and while movies\nlike Yentl and Nuts certainly pleased Barbra Streisand fans, for more general audiences\nthey're just not very credible.\n\nStreisand the concert, on the other hand, is an ideal venue, and ideally suited to the uniquely\ntalented diva. She's clearly feeding off her fans and in return she gives them one of the best\nperformances of her career. Sixty-four at the time, her voice is still strong if throatier (she still\nhits those amazing high notes on &quot;People&quot;) and her interpretation of the songs' lyrics has the\nkind of maturity that can only come with age. Barbra herself jokes about getting older, though\nshe looks great.\n\nAs filmed, the program opens with the Overture from Funny Girl while onscreen there's a\nmontage of the stage being set-up, and there are brief interviews with excited fans entering\nthe area. (An older couple who saw her perform &quot;Happy Days Are Here Again&quot; when she was\n17 wonder if she'll perform it again that evening. She does.) There's also a pretty incredible\nmontage of Big Name celebrities arriving to watch the show (Oprah, Tony Bennett, Stephen\nSondheim, Tom Hanks, Bill and Hillary Clinton, etc.) - including a brief glimpse of Streisand's\nactor-husband, James Brolin.\n\nThe stage, intended to resemble a smoky nightclub, apparently, is an odd jumble of railings\nand platforms - it looks like where they keep the tractor beam on the Death Star, or maybe\nthe kind of labyrinthine line you have to go through to get to those E-ticket rides at\nDisneyland. Streisand is backed by a full orchestra conducted by her arranger, Bill Ross. The\nmultinational, operatic pop vocal quartet Il Divo, a somewhat annoying boy band-type group\nfor old fogies created by Simon Cowell (yes, the) is featured on a couple of songs*, but\notherwise Streisand dominates, as well she should.\n &lt;a href=&quot;\nhttp://leetleech.org/images/34576286912593801260.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://leetleech.org/images/34576286912593801260.jpg&lt;/a&gt;\n\nThe program is as follows:\n\n01. Funny Girl Overture [Original Broadway Version]\n02. Starting Here, Starting Now\n03. Down With Love\n04. The Way We Were\n05. Ma Premiere Chanson\n06. Evergreen [w/ Il Divo]\n07. My Way [Il Divo]\n08. Come Rain or Come Shine\n09. Funny Girl\n10. The Music That Makes Me Dance\n11. My Man\n12. People\n13. The Music Of The Night [w/ Il Divo]\n14. Jason Theme\n15. Carefully Taught/Children Will Listen\n16. Unusual Way\n17. What Are You Doing The Rest Of Your Life?\n18. Q &amp; A Stoney End\n19. Happy Days Are Here Again\n20. [Have I Stayed] Too Long At The Fair?\n21. The Time Of Your Life\n22. A Cockeyed Optimist\n23. Somewhere [w/ Il Divo]\n24. My Shining Hour\n25. Don't Rain On My Parade\n26. Smile\n\n\n::General::\n\nFormat: MPEG-4\nFile Size: 2.57 GiB\nOverall Bit Rate: 3 497 Kbps\nDuration: 1h 45mn\nSample: NO\nSubtitles:NO\n\n::Video Info::\n\nContainer: avc\nVideo Codec Type: x264\nVideo bitrate: 3 000 Kbps\nResolution: 1 280 pixels X 720 pixels\nAspect ratio(AR): 16:9\nQuality Factor(QF): 0.136\nFrame Rate: 23.976 fps\nSource: Not Sure 1080p.Thanks!!\n\n::Audio Info::\n\nAudio Language: English\nAudio Codec: AAC\nBitrate Mode: Variable\nBitrate: 576 Kbps\nMaximum Bitrate: 1 728 Kbps\nSample Rate: 48.0 KHz\nChannel(s): 6 channels\nChannel positions: Front: L C R, Side: L R, LFE\n\n;)","torrent":{"xt":"urn:btih:0fca84b4c6fca86fb14947e0ad6ca637392f6ee1","amp;dn":"Barbra+Streisand+-++in+Concert+2006+Bluray+720p+%5BMP4-AAC%5D%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fca84b4c6fca86fb14947e0ad6ca637392f6ee1","infoHashBuffer":{"type":"Buffer","data":[15,202,132,180,198,252,168,111,177,73,71,224,173,108,166,55,57,47,110,225]},"announce":[],"urlList":[]}}