{"title":"I am Charlotte Simmons","uid":7735823,"size":913984395,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:10bbc11961d8db7796f24f1b58a37683628cdd1e&amp;dn=I+am+Charlotte+Simmons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":null,"files":-1,"time":1350484039,"description":"Dupont University--the Olympian halls of learning housing the cream of America's youth, the roseate Gothic spires and manicured lawns suffused with tradition... Or so it appears to beautiful, brilliant Charlotte Simmons, a sheltered freshman from North Carolina. But Charlotte soon learns, to her mounting dismay, that for the uppercrust coeds of Dupont, sex, Cool, and kegs trump academic achievement every time.\n\nAs Charlotte encounters Dupont's privileged elite--her roommate, Beverly, a Groton-educated Brahmin in lusty pursuit of lacrosse players; Jojo Johanssen, the only white starting player on Dupont's godlike basketball team, whose position is threatened by a hotshot black freshman from the projects; the Young Turk of Saint Ray fraternity, Hoyt Thorpe, whose heady sense of entitlement and social domination is clinched by his accidental brawl with a bodyguard for the governor of California; and Adam Geller, one of the Millennial Mutants who run the university's &quot;independent&quot; newspaper and who consider themselves the last bastion of intellectual endeavor on the sex-crazed, jock-obsessed campus--she gains a new, revelatory sense of her own power, that of her difference and of her very innocence, but little does she realize that she will act as a catalyst in all of their lives. With his signature eye for detail, Tom Wolfe draws on extensive observation of campuses across the country to immortalize college life in the '00s. I Am Charlotte Simmons is the much-anticipated triumph of America's master chronicler.","torrent":{"xt":"urn:btih:10bbc11961d8db7796f24f1b58a37683628cdd1e","amp;dn":"I+am+Charlotte+Simmons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10bbc11961d8db7796f24f1b58a37683628cdd1e","infoHashBuffer":{"type":"Buffer","data":[16,187,193,25,97,216,219,119,150,242,79,27,88,163,118,131,98,140,221,30]},"announce":[],"urlList":[]}}