{"title":"2014 - The Year In Christian Music (Bundle 33)","uid":10469129,"size":2162291718,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11338c98eecd5500f82bbf2e8759904085eae0e1&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+33%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"TorrentTracts","files":268,"time":1404237126,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nSeveral days a week, I read online newspapers from around the world.  Sometimes it's sporting news, other times it's financial news, political, or something else that I am interested in following.  What can I say?  It's just my preferred way of keeping updated on the world around us.\n\nSome of those newspapers have a comments section after each article.  I suppose that would give people like you and I a chance to sound off on what we just read.  And although I have never felt the desire to comment, many readers people do.  So reading through the comment section is another experience entirely.\n\nSpammers have exploited this platform of dialog.  Many threads are filled with &quot;I lost my house, my job, my family, my keys, and my dog.  Then I learned how easy it was to make $1,458/day online.  Click on this link to find out how&quot;, type of propaganda every few posts.\n\nOver the years, I've learned that more readers ignore these spammers than comment on them.  After all, they are nothing more than a daily annoyance.  Eye noise.  But I have to wonder who, while reading that newspaper, would ever take these spammers serious?  Who would ever say to themselves, &quot;That's an unbelievable once in a lifetime opportunity.  Now I can finally quit my job, and make even more money.  I'm going to click on that link right now.&quot;  I hope, nobody.\n\nIn the same sort of way, we sometimes experience that here in these threads.  &quot;Thieves!  You're all going to hell.  TorrentTracts is your Cult Leader.  Repent!  Repent!&quot;  And what do we know of these people?  Well we know they claim to be Christian.  Yet they regularly show us behavior that isn't very Christ-like.  I personally know of no Brethren who would try to derail the ministry of others, as they do here.  Besides, all my Christian friends check themselves at the door, and carry themselves in a way that would be a testimony to the Father, not an audition to the Jerry Springer show.  So what are these individuals really trying to achieve?  Whatever it is, it's certainly not Godly motivated.  And I can't believe any of you would ever take their rhetoric serious.  But the real sad part?  In their minds they probably think you are.\n\nSo a sincere thank you to all of you who have stood up for this ministry.  And posted in it's (and my) defense.  These people are, after all, nothing more parasitic spammers.  And until they come up with a new trick to convince me I'm the devil, I can't believe that any of you will give a moments thought to their misguided ideologies.  &quot;But the real sad part?  In their minds they probably think you are.&quot;\n\nHIP-HOP/RAP: 5ive, Beleaf, DJ I Rock Jesus, Hevn Li Angel, Sundance.  PRAISE &amp; WORSHIP: Campus House Worship, Hillsong, Paul Anleitner.  SINGER-SONGWRITER: Clarensau, Sarah Anne Taylor.  GOSPEL: Dwayne Tryumf, Marty Stuart.  ROCK: Garrett Godsey, Isee, Jars of Clay, Ocean's Edge School Of Worship, Sleep For Sleepers.  BLUEGRASS: Highroad 3.  R&amp;B: Jessica Reedy.  CONTEMPORARY: Kim Dexter, Lights Align, Sean Feucht.  INSTRUMENTAL: Mark Schultz.  COUNTRY: Mike Bowling.  CLASSICAL: Oxford Choir Of Exeter College.  TECHNO: Said The Sky, Sufjan Stevens.\n\nThere are 27 titles being offered for you to pick and choose from today...\n\n * 5ive - 2014 - Ain't Supposed To Be Here\n * Beleaf - 2014 - Red Pills + Black Sugar\n * Campus House Worship - 2014 - Volume 1\n * Clarensau - 2014 - Death Met Grace\n * DJ I Rock Jesus - 2014 - Knowledge Music, Vol 3\n * Dwayne Tryumf - 2014 - Live In Concert\n * Garrett Godsey - 2014 - Intangible\n * Hevn Li Angel - 2014 - To Whom It May Concern, Vol 1\n * Highroad 3 - 2014 - Angel At The Crossroads\n * Hillsong - 2014 - No Other Name - Deluxe Edition\n * Isee - 2014 - Bring You Glory - Single\n * Jars of Clay - 2014 - Jars 20 StageIt Much Afraid\n * Jessica Reedy - 2014 - Better - Single\n * Kim Dexter - 2014 - Reaching\n * Lights Align - 2014 - Before After\n * Mark Schultz - 2014 - Renaissance\n * Marty Stuart - 2014 - The Gospel Music Of Marty Stuart - With His Fabulous Superlatives\n * Mike Bowling - 2014 - The Hinsons Rememered\n * Ocean's Edge School Of Worship - 2014 - All Glory Forever\n * Oxford Choir Of Exeter College - 2014 - Stanford Mass In G Major And Other Choral Works\n * Paul Anleitner - 2014 - Spontaneous Live Collection, Vol 1\n * Said The Sky - 2014 - Faith EP\n * Sarah Anne Taylor - 2014 - Sarah Anne Taylor EP\n * Sean Feucht - 2014 - Messengers\n * Sleep For Sleepers - 2014 - Discovery\n * Sufjan Stevens - 2014 - Enjoy Your Rabbit\n * Sundance - 2014 - Midlife Marauders\n\nGod Bless,\nTorrentTracts, July 2014\n","torrent":{"xt":"urn:btih:11338c98eecd5500f82bbf2e8759904085eae0e1","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+33%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11338c98eecd5500f82bbf2e8759904085eae0e1","infoHashBuffer":{"type":"Buffer","data":[17,51,140,152,238,205,85,0,248,43,191,46,135,89,144,64,133,234,224,225]},"announce":[],"urlList":[]}}