{"title":"LeisureTown.com - Complete Webrip - 51 CBRs - FIXED","uid":6887946,"size":106310463,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1212eb9ff3b362ef7566619021451547f3bac80b&amp;dn=LeisureTown.com+-+Complete+Webrip+-+51+CBRs+-+FIXED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"x30001wtm","files":53,"time":1323899119,"description":".\n\nSORRY! I screwed up that last one but TPB refuses to delete it.\n________________________________________________________________________________\n\nI don't remember when or how I first came across LeisureTown.com but I do know\nthat it was before the site stopped updating. It's still online with a page that\nshows that it ran from 1996 to 2003. Recently I decided to archive the whole\nwebsite in case it disappears someday without notice. I've incorporated the\n'obituary' page into this collection as the first frame of &quot;Features\\A Comedy\nCrisis&quot;. Similarly, there's no online store anymore so I incorporated that\nnotice as the last frame of &quot;Features\\Yay For Me&quot;.\n\nEverything here is presented at the original resolution offered on the website.\nThe Flipbooks are strange; they're only 200 pixels wide and they show a lot of\nartifacts when they're blown up to fit to width. At first I thought they had to\nbe thumbnails of some sort but apparently not. If there are larger versions\navailable I can't find them.\n\nI did some minor touching up such as correcting one typo, adding &quot;The End&quot; to\nbits that didn't already say it, and fabricating title graphics for bits that\ndidn't have one. Other than that I pretty much left everything alone.  Not\ntotally, but pretty much.\n\nThis collection isn't really X-rated but it isn't for holier-than-the-rest-of-us\nreligious nuts who think we'll burn in hell for masturbating, either. Speaking\nof masturbating, the first part of this collection I discovered all those years\nago was American Masturbator. It still cracks me up. It's under the Features\ndirectory in case you want to start at the same place I did but wherever you\nstart, I think you'll have fun... as long as you don't mind dick jokes, bubbling\nbongs, and a tiny little bit of gory splatter violence.\n\nx30001wtm\n\n","torrent":{"xt":"urn:btih:1212eb9ff3b362ef7566619021451547f3bac80b","amp;dn":"LeisureTown.com+-+Complete+Webrip+-+51+CBRs+-+FIXED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1212eb9ff3b362ef7566619021451547f3bac80b","infoHashBuffer":{"type":"Buffer","data":[18,18,235,159,243,179,98,239,117,102,97,144,33,69,21,71,243,186,200,11]},"announce":[],"urlList":[]}}