{"title":"EnigmaT Set Rips { Cuts } - September 12th, 2013","uid":8909320,"size":1169925159,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:130da81a3136a847909e2d36ad1c28ad48de98b1&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+12th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":126,"time":1378980035,"description":"1Touch - Here I Go (Adam Navel Remix) (Cut From Messer Set)-enTc.mp3\n1Touch - Here I Go (Sergey Shemet Remix) (Cut From Lazarus Set)-enTc.mp3\n1Touch feat. Unknown Singer - Here I Go (Sergey Shemet Remix) (Cut From Anna Lee Set)-enTc.mp3\nA.R.D.I. - In Another World (Original Mix) (Cut From Faruk Set)-enTc.mp3\nAce Ventura - Pressence (Daniel Lesden Remix) (Cut From Bluehawk Set)-enTc.mp3\nActiva - Echowave (Solar Movement Remix) (Cut From Bostock Set)-enTc.mp3\nAdam Deane - Retribution (Allen &amp; Envy vs Phil Parry Remix) (Cut 2 From Allen&amp;Envy Set)-enTc.mp3\nAdam Deane - Retribution (Allen &amp; Envy vs Phil Parry Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nAeroloid - You Love To (Cut From Claessen Set)-enTc.mp3\nAirborn - Waiting For You (Kaimo K Remix) (Cut From Saux Set)-enTc.mp3\nAirdraw - Soma's Cube (Original Mix) (Cut From Ferry Set)-enTc.mp3\nAirwave - Game Of Life (Incolumis Remix) (Cut From J00F Set)-enTc.mp3\nAlae Khaldi - Shorelines (Cut From Palagano Set)-enTc.mp3\nAlae Khaldi - Tangier (Set Rip)-enTc.mp3\nAlan Cuevas - Senda (Andromedha Breaking the Habit Remix) (Cut From A Rodriguez Set)-enTc.mp3\nAlan Morris &amp; Trance Arts - Innetic (Cut From Bostock Set)-enTc.mp3\nAlex Ender - Mad Angel (Cut From Palagano Set)-enTc.mp3\nAlexander Zhakulin - Atlantis (Original Mix) (Cut From Jammer Set)-enTc.mp3\nAlexander Zhakulin - Atlantis (Original Mix) (Cut From Nickey Set)-enTc.mp3\nAlexander Zhakulin feat. Eva Kade - Run Away (Chimera State Remix) (Cut From Del Mar Set)-enTc.mp3\nAllan Morrow - Why We Do This (Cut From Ellis Set)-enTc.mp3\nAllen &amp; Envy - Always (Mike van Fabio Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nAllen &amp; Envy - Optimism (Original Mix) (Cut From Photographer Set)-enTc.mp3\nAllen &amp; Envy vs. Chris Cockrill - Acidic (Gareth Weston Remix) (Cut From Thirlwall Set)-enTc.mp3\nAllen &amp; Envy vs. Chris Cockrill - Acidic (Tangle Remix) (Cut From Tangle Set)-enTc.mp3\nAndromedha - From Sunrise to Sunset (Jeremy Rowlett Remix) (Cut From A Rodriguez Set)-enTc.mp3\nAndromedha - From Sunrise to Sunset (Maynee Remix) (Cut From A Rodriguez Set)-enTc.mp3\nAndy Moor - K-Ta (Fady &amp; Mina Remix) (Cut From Sherry Set)-enTc.mp3\nAndy Moor feat. Carrie Skipper - Toras Angel (The Thrillseekers Remix) (Cut From Bobina Set)-enTc.mp3\nAPD &amp; Axezor - Arctic Lady (Original Mix) (Cut From Afternova Set)-enTc.mp3\nAriams feat. Roza - Pure Sensation (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nARMA - Reckless (UCast Lifted Vision) (Cut From A&amp;F Set)-enTc.mp3\nArma - Reckless (Under This Remix) (Cut From KvA Set)-enTc.mp3\nAugust Vila - Paranoia (Tepes Remix) (Cut From Pit Set)-enTc.mp3\nBass Kleph - Tommys Dream (Cut From W&amp;W Set)-enTc.mp3\nBeatsole - Uprising (Original Mix) (Cut From KvA Set)-enTc.mp3\nBen Preston feat. Susie - Remember Me (Rafael Frost Remix) (Cut From Eteson Set)-enTc.mp3\nBen Stone - Timeless (Original Mix) (Cut From GO Set)-enTc.mp3\nBlugazer Feat. Catherine - Blue Embers (Original Mix) (Cut From Shah Set)-enTc.mp3\nBlugazer feat. Catherine - Galaxies Away (Cut From Knowles Set)-enTc.mp3\nBluSkay &amp; KeyPlayer - Nocturne In C# Minor (Cut From A&amp;F Set)-enTc.mp3\nBryan Cox - Illuminatus (Cut From Bjorn Set)-enTc.mp3\nC-Systems - Love Again (Beatsole Remix) (Cut From C-Systems Set)-enTc.mp3\nCash Cash feat. Bebe Rexha - Take Me Home (Jordy Dazz Remix) (Cut From Claessen Set)-enTc.mp3\nChris Voro &amp; The Victims - X-Rated (Original Mix) (Cut From Bluehawk Set)-enTc.mp3\nCiro Visone - Change (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nClaus Backslash - Empire (Ikerya Project Remix) (Cut From EDU NRG Set)-enTc.mp3\nCryptic Air - Let the Games Begin (Cut From Pit Set)-enTc.mp3\nCut Knob - Deep As We Like (Hector Sawiak Remix) (Cut From Valentine Set)-enTc.mp3\nDaniel Meyer - Next Move (DJ ARTAK Remix) (Cut From GO Set)-enTc.mp3\nDaniel Meyer - Next Move (DJ Artak Remix) (Cut From Mazza Set)-enTc.mp3\nDaniel Meyer - Next Move (Jesper Olesen Remix) (Cut From A&amp;F Set)-enTc.mp3\nDaniel Meyer - Next Move (O.B.M Notion Emotional Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nDanny Avilla - Rasta Fun (Cut From W&amp;W Set)-enTc.mp3\nDave Walker - Spirit (Ally Brown Remix) (Cut From Burrows Set)-enTc.mp3\nDelta3 - Land Of Smiles (Original Mix) (Set Rip)-enTc.mp3\nDusky - Careless (ABGT 034 Rip)-enTc.mp3\nElleu - Supreme (Cut From Pit Set)-enTc.mp3\nErick Strong - No Fear (Original Mix) (Cut From Mazza Set)-enTc.mp3\nEvgeny Dovgan - Activation (Cut From M.PRAVDA Set)-enTc.mp3\nEvgeny Dovgan - Beautiful Universe (Original Mix) (Cut From Anna Lee Set)-enTc.mp3\nFedde Le Grand - Rockin' N' Rollin' (Togglehead Remix) (Cut From KvA Set)-enTc.mp3\nFernie - Sector F (Cut From Fernie Set)-enTc.mp3\nFerry Corsten Feat. Jenny Wahlstrom - Many Ways (Cut From Ferry Set)-enTc.mp3\nFher Vizzuett - Romans 8-39 (Touchstone Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nFher Vizzuett - Romans 8-39 (Touchstone Remix) (Cut From Burrows Set)-enTc.mp3\nFlucturion 2.0 - FTP (Original Mix) (Cut From Katadunkass Set)-enTc.mp3\nFollowing Light &amp; Slow Phase - Run (Cut From Valentine Set)-enTc.mp3\nFrench Skies - Blaster (Original Mix) (Cut From EDU NRG Set)-enTc.mp3\nGabriel &amp; Dresden feat. Neil Ormandy - Tomorrow Comes (Moska Remix) (Cut From Claessen Set)-enTc.mp3\nGary Delaney - Evanesence (Jeremy Rowlett Remix) (Cut From A Rodriguez Set)-enTc.mp3\nGordey Tsukanov &amp; Andrey Mirutenko - Breath Of Fire (Sound Fusion Remix) (Cut From Kaeno Set)-enTc.mp3\nGrains of Sound - Turkish Delight (Cut From Angers Set)-enTc.mp3\nGroove &amp; Fillerz - In My Eyes (Original Mix) (Cut From GO Set)-enTc.mp3\nGui Boratto - Anunciacian (Cut From Valentine Set)-enTc.mp3\nHarel Uzan &amp; Eran Hersh - Feel The Beat (Cut From Pledger Set)-enTc.mp3\nHaris C - Kyveli (Cut From Tasev Set)-enTc.mp3\nHassan JeweL - Pretension (Cut From EDU NRG Set)-enTc.mp3\nHHBanton - How You Gonna Treat Me (ABGT 034 Rip)-enTc.mp3\nID - ID (Allen &amp; Envy Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nIgor Zaharov &amp; Sober System - Copa Del Mundo (Andromedha Late Summer Remix) (Cut From A Rodriguez Set)-enTc.mp3\nIndecent Noise &amp; Lostly - Lost In Noise (Cut From Ind Noise Set)-enTc.mp3\nInsida - Skyscraper (Original Mix) (Cut From Shiver Set)-enTc.mp3\nIversoon &amp; Alex Daf - DeJavu (Damian Wasse Remix) (Cut From Mazza Set)-enTc.mp3\nIversoon &amp; Alex Daf - Sledge Hammer (Mino Safy Remix) (Cut From Anna Lee Set)-enTc.mp3\nJames Holden - Nothing (Local Heroes Remix) (Cut From KvA Set)-enTc.mp3\nJeff Mills - The Bells (Faruk Sabanci's Whose Afraid of Voldemort Rework) (Cut From Faruk Set)-enTc.mp3\nJesper Olesen - Point of No Return (Original Mix) (Cut From Hassen B Set)-enTc.mp3\nJimpster - Porchlight And Rocking Chairs (KiNK Remix) (ABGT 034 Rip)-enTc.mp3\nJohan Ekman - Open Your Eyes (Cut From Ind Noise Set)-enTc.mp3\nJohn Dopping &amp; Ally Brown - For The Art (Cut From Bostock Set)-enTc.mp3\nJulian Rodriguez - Rising Star (Juan Sando Remix) (Cut From A Rodriguez Set)-enTc.mp3\nKaeno - Perspectives (Original Mix) (Cut From Kaeno Set)-enTc.mp3\nKerem Sever - Resistance (Cut From OzzyXPM Set)-enTc.mp3\nKoishii &amp; Hush Featuring Kate Louise Smith - Miles Away (Touchstone Remix) (Cut From Dinaire Set)-enTc.mp3\nKoka - Elliana (Cut From Knowles Set)-enTc.mp3\nKoka - Maintenant (Cut From Knowles Set)-enTc.mp3","torrent":{"xt":"urn:btih:130da81a3136a847909e2d36ad1c28ad48de98b1","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+12th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"130da81a3136a847909e2d36ad1c28ad48de98b1","infoHashBuffer":{"type":"Buffer","data":[19,13,168,26,49,54,168,71,144,158,45,54,173,28,40,173,72,222,152,177]},"announce":[],"urlList":[]}}