{"title":"Gill Scott Heron - Discography","uid":11084809,"size":2911848247,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1310b9b504ca1bff46d54ea4ee8e7bc0c7d9edb6&amp;dn=Gill+Scott+Heron+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zeljadin","files":-1,"time":1411442587,"description":"Gilbert &quot;Gil&quot; Scott-Heron was an American soul and jazz poet, musician, and author, known primarily for his work as a spoken word performer in the 1970s and '80s. His collaborative efforts with musician Brian Jackson featured a musical fusion of jazz, blues, and soul, as well as lyrical content concerning social and political issues of the time, delivered in both rapping and melismatic vocal styles by Scott-Heron. His own term for himself was &quot;bluesologist&quot;, which he defined as &quot;a scientist who is concerned with the origin of the blues.&quot; His music, most notably on Pieces of a Man and Winter in America in the early 1970s, influenced and helped engender later African-American music genres such as hip hop and neo soul.\n\nBesides influencing contemporary musicians, Scott-Heron remained active until his death, and in 2010 released his first new album in 16 years, entitled I'm New Here. A memoir he had been working on for years up to the time of his death, The Last Holiday, was also published, posthumously in January 2012.\n\nHis recording work received much critical acclaim, especially one of his best-known compositions &quot;The Revolution Will Not Be Televised&quot;. His poetic style has influenced every generation of hip hop.","torrent":{"xt":"urn:btih:1310b9b504ca1bff46d54ea4ee8e7bc0c7d9edb6","amp;dn":"Gill+Scott+Heron+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1310b9b504ca1bff46d54ea4ee8e7bc0c7d9edb6","infoHashBuffer":{"type":"Buffer","data":[19,16,185,181,4,202,27,255,70,213,78,164,238,142,123,192,199,217,237,182]},"announce":[],"urlList":[]}}