{"title":"Alan Moore - Conversations","uid":8941324,"size":2916988,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1454041ff11dc08ec52f620ac28de5e6dcce2ef6&amp;dn=Alan+Moore+-+Conversations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"livhre","files":-1,"time":1379665099,"description":"British comics writer Alan Moore (b. 1953) has a reputation for equal parts brilliance and eccentricity. Living hermit-like in the same Midlands town for his entire life, he supposedly refuses contact with the outside world while creating his strange, dense comics, fiction, and performance art. While Moore did declare himself a wizard on his fortieth birthday and claims to have communed with extradimensional beings, reticence and seclusion have never been among his eccentricities. On the contrary, for long stretches of his career Moore seemed to be willing to chat with all comers: fanzines, industry magazines, other artists, newspapers, magazines, and personal websites. Well over one hundred interviews in the past thirty years serve as testimony to Moore's willingness to be engaged in productive conversation.\n\nAlan Moore: Conversations includes ten substantial interviews, beginning with Moore's first published conversation, conducted by V for Vendetta cocreator David Lloyd in 1981. The remainder cover nearly all of his major works, including Watchmen, V for Vendetta, Swamp Thing, Marvelman, The League of Extraordinary Gentlemen, Promethea, From Hell, Lost Girls, and the unfinished Big Numbers.","torrent":{"xt":"urn:btih:1454041ff11dc08ec52f620ac28de5e6dcce2ef6","amp;dn":"Alan+Moore+-+Conversations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1454041ff11dc08ec52f620ac28de5e6dcce2ef6","infoHashBuffer":{"type":"Buffer","data":[20,84,4,31,241,29,192,142,197,47,98,10,194,141,229,230,220,206,46,246]},"announce":[],"urlList":[]}}