{"title":"The Power of SHAZAM! (assorted) (digital) (DreamGirl-Novus) [NVS","uid":8596234,"size":217733002,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:14ab7ed4a2d6586aac61de69fcac7fcbe69c616e&amp;dn=The+Power+of+SHAZAM%21+%28assorted%29+%28digital%29+%28DreamGirl-Novus%29+%5BNVS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"blackcanary","files":-1,"time":1371767380,"description":"English | CBZ | 13 Issues\n\nThe Power of SHAZAM! #10, 14, 17, 20, 22, 32, 35, 39, 41, 44, 45, 46, 1000000\nPublisher:  DC COmics\nPublication Date:  October 18, 1995 - December 2, 1998\n\nWriters:  Jerry Ordway\nPencillers:  Peter Krause, Jerry Ordway, Gil Kane, Curt Swan, \nInkers:  Mike Manley, Jerry Ordway, Kim DeMulder, Dick Giordano\nColorist:  Glenn Whitmore\nLetterer:  John Costanza and Albert De Guzman\nCover:  Jerry Ordway\n\nThe Power of SHAZAM! #10\nThe Seven Deadly Enemies of Man have escaped...and the wizard Shazam is brought to his knees by Blaze, leaving Billy Batson trapped in the form of Captain Marvel to face Black Adam! \n\nThe Power of SHAZAM! #14\nCaptain Marvel Jr. leaves Fawcett City for a solo adventure in New York--and a thunderous encounter with Chain Lightning! Comics legend Gil Kane guest-pencils!\n\nThe Power of SHAZAM! #17\nMr. Mind's invasion of Earth is imminent! Only two people are capable of stopping it, and both are under Mind's control: Captain Marvel and his arch-enemy, Dr. Sivana! Plus: the secret of how Sivana got to Venus is revealed!\n\nThe Power of SHAZAM! #20\nFINAL NIGHT tie-in issue! One city still shines in the darkness: Fawcett City. But only if the light-bringing, life-giving magic spell of the wizard Shazam will hold out! Unfortunately, it's also the painful duty of Captain Marvel and the Man of Steel to keep desperate, panic-stricken mobs from flooding the already overcrowded city!\n\nThe Power of SHAZAM! #22\nBatman guest-stars when he follows a trail of death to Fawcett City--a quest that may be linked to &quot;Muscles&quot; McGinnis's secret files! Meanwhile, Lady M. uses her abilities to sway the monstrous Sin to battle Captain Marvel and Batman!\n\nThe Power of SHAZAM! #32\nWith the Wizard on New Genesis, the Captains Marvel are on their own! And the timing couldn't be worse, as the kids could use some help in solving the mystery of the woman called Windshear. It's a dog-fight over Fawcett City as Mary and Captain Marvel battle to keep their airspace free and clear!\n\nThe Power of SHAZAM! #35\n&quot;Lightning &amp; Stars&quot; part 2, continued from STARMAN #39. Branded a traitor by the media, Bulletman escapes from jail and heads for Opal City--home of the original Starman! Sarge Steel asks Captain Marvel to find Bulletman and bring him back, dead or alive! Continued in STARMAN #40!\n\nThe Power of SHAZAM! #39\nMr. Mind's plan for revenge shifts into high gear, forcing both Billy and Mary to cross legal lines in their desperate pursuit of answers. Torn by grief over the loss of their foster parents, the Captains are hard-pressed to keep their cool while their whole world crashes around them. &quot;The Monster Society of Evil&quot; part 2.\n\nThe Power of SHAZAM! #41\nA Mr. Mind is a terrible thing to waste. Grown to gargantuan size, Mr. Mind terrorizes Washington, D.C. until the two Captains Marvel team up with the two Green Lanterns, Hal Jordan and Kyle Rayner! &quot;The Monster Society of Evil&quot; part 4.\n\nThe Power of SHAZAM! #44\nChain Lightning, who has usurped the Power of Shazam, manifests multiple personalities in an effort to destroy the Captain Marvel dynasty. Also: Dudley and Tawny attempt to draw a Captain Marvel from the future to help save Billy, Mary and Freddy!\n\nThe Power of SHAZAM! #45\nWhile the Justice Leaguers watch over the injured Billy Batson while he recuperates, Black Adam has returned to Fawcett City. Is Adam coming after the wounded Marvel? Or has he become a new man?\n\nThe Power of SHAZAM! #46\nBilly Batson has recovered from his near-fatal accident. Now, having become Captain Marvel once more, his next task is to put an end to Black Adam's reign over Fawcett City. But he'll have to get past Superman to do it!\n\nThe Power of SHAZAM! #1000000\nA DC ONE MILLION tie-in! What is the mysterious old relic found at the Rock of Eternity in the year 85,271? When two kids from the rougher side of Mercury discover a way into to the Rock, they believe they've found the Flash, but instead learn of the Power of Shazam! Continued in THE FLASH #1,000,000.\n\nThanks goes to DreamGirl for this release.","torrent":{"xt":"urn:btih:14ab7ed4a2d6586aac61de69fcac7fcbe69c616e","amp;dn":"The+Power+of+SHAZAM%21+%28assorted%29+%28digital%29+%28DreamGirl-Novus%29+%5BNVS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14ab7ed4a2d6586aac61de69fcac7fcbe69c616e","infoHashBuffer":{"type":"Buffer","data":[20,171,126,212,162,214,88,106,172,97,222,105,252,172,127,203,230,156,97,110]},"announce":[],"urlList":[]}}