{"title":"Sallie Ford &amp; The Sound Outside - Untamed Beast [2013][FLAC]","uid":8162315,"size":243115711,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:14b73473de7f23bc48076b58691e5631ece1ca5a&amp;dn=Sallie+Ford+%26amp%3B+The+Sound+Outside+-+Untamed+Beast+%5B2013%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Unaitxus","files":-1,"time":1361274712,"description":"Sallie Ford and the Sound Outside is an American rock band from Portland, Oregon. The band has been described as &quot;Rockabilly&quot;,[1] or as having a &quot;raw soul&quot;[2] 1950s rock-and-roll energy sound. Sallie Ford describes it as &quot;Rock n Roll&quot; and that people find it &quot;more rockinÎ“Ã‡Ã– than they expected.&quot;[1] The group received positive reviews from USA Today's music critic Whitney Matheson.[3] and from The Oregonian critic Ryan White.[2] In 2011, they signed a record deal with Partisan Records and released their first full-length CD Dirty Radio in May, began a US tour in June,[1] and in August, performed on the Late Show with David Letterman.[4]\nFord is the daughter of puppeteer Hobey Ford, and grew up in Asheville, North Carolina before moving to Oregon.[2] In Portland, she worked as a waitress, and met Alaskan fisherman Tyler Tornfelt and Ford Tennis and Jeff Munger who were &quot;scraping by&quot;.[2] With Ford on vocals and guitar, Tennis on drums, Munger on guitar, and Tornfelt on upright bass, they had a band in 2007. They played local clubs in the Portland area.\nAccording to singer Seth Avett of The Avett Brothers, Ford's songs have that &quot;rare quality of somehow combining fun with emotional and artistic integrity&quot; and she &quot;fills the room with it&quot; and reminds him of the &quot;energy of early rock 'n' roll.&quot;[2] The group opened for The Avett Brothers and recorded a five-song EP entitled Not an Animal.[2] Ford's voice has been compared to Ella Fitzgerald, Tom Waits, Billie Holiday, with possible influences from Bessie Smith and Snoop Dogg,[2] and used the words &quot;two-step big beat gospel&quot; to describe the effect.[2] The group has toured the United States, including cities such as Seattle,[5] and have appeared in Nashville. A reviewer for the Portland Mercury suggested that listeners should dress in 1950s style with a &quot;trilby hat&quot;, and described the group as &quot;energetic.&quot;[6]\n\n\nDiscography:\n\nNot an Animal\nDirty Radio\nUntamed Beast\t","torrent":{"xt":"urn:btih:14b73473de7f23bc48076b58691e5631ece1ca5a","amp;dn":"Sallie+Ford+%26amp%3B+The+Sound+Outside+-+Untamed+Beast+%5B2013%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14b73473de7f23bc48076b58691e5631ece1ca5a","infoHashBuffer":{"type":"Buffer","data":[20,183,52,115,222,127,35,188,72,7,107,88,105,30,86,49,236,225,202,90]},"announce":[],"urlList":[]}}