{"title":"The J. Geils Band - Love Stinks [RockPop, 1980].VOB","uid":10983182,"size":155932672,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1518f2e194815396a1ae47d78f8e880bdfdd148d&amp;dn=The+J.+Geils+Band+-+Love+Stinks+%5BRockPop%2C+1980%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1409885467,"description":"The J. Geils Band - Love Stinks [RockPop, 1980].VOB\n\n\nHQ rare promo performance music video from a promo DVD. &quot;Love Stinks&quot; is a song written by Peter Wolf and Seth Justman that was the title track of J. Geils Band's 1980 album Love Stinks. The song was released as a single and peaked in the US at #38, spending three weeks in the Top 40. Joan Jett covered the song for the soundtrack of the 1996 movie Mr. Wrong. The song was also featured in the film Opie Gets Laid. It was also covered by Adam Sandler in the movie The Wedding Singer and by Himalayaz with Ms. Toi for the movie Love Stinks.\n\nThe lyrics describe a relationship that has gone sour, possibly a reference to J. Geils Band lead singer Peter Wolf's marriage to actress Faye Dunaway. Author Maury Dean describes the opening of the song as &quot;ponderous Power Metal.&quot; Dean describes the bands playing in the refrain as generating &quot;wild waves of flame,&quot; the guitars as &quot;fire-breathing&quot; and Wolf's vocals in the &quot;yeah yeah&quot; portion of the chorus as snarling with &quot;heavy metal glee.&quot; Justman provides extensive keyboards, which Associated Press critic James Simon feels gives the song &quot;a little extra zing.&quot; Viglione describes the riff as &quot;Lou Reed's 'Vicious' as performed by his Rock &amp; Roll Animal band on Lou Reed Live at half-speed,&quot; also noting that it is a hard rock version of the riff from &quot;Louie, Louie.&quot; Rolling Stone critic Rob Sheffield notes that the riff was later used by Nirvana in the song &quot;Smells Like Teen Spirit.&quot;\n\n\nThe J. Geils Band is an American rock band formed in 1967 in Worcester, Massachusetts, under the leadership of guitarist J. Geils.\n\nThe band formed under the name 'Snoopy and the Sopwith Camels', while Geils was attending Worcester Polytechnic Institute for a couple of semesters. In 1967, the band switched focus, starting to play electric guitar and bass and recruiting drummer Stephen Jo Bladd and fast-talking ex-disc jockey singer Peter Wolf, born Peter Blankenfeld, (originally from the Bronx ) and later, both from Boston. They became the J. Geils Blues Band, later dropping the word &quot;Blues&quot; from the band name. The following year, former fan Seth Justman joined as an organist. The group signed to Atlantic Records in 1970.\n\nThe band played R&amp;B-influenced blues-rock in the 1970s before moving towards a more New Wave sound in the 1980s. Since its initial break-up in 1985, the band has reunited several times.\n\nTheir biggest hit was their 1981 single, &quot;Centerfold&quot;, which charted #1 in the United States in early 1982.\n\nIn September 2010 it was announced that The J. Geils Band was a finalist nominee for selection to Rock and Roll Hall of Fame, Class Of 2011, but were not selected for induction that year.\n(video has a semi-transparent white &quot;zdf.kultur&quot; logo at the top left)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Love_Stinks_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Love_Stinks_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/baamNAagD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/baamNAagD&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8516kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:03:27\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.6\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:1518f2e194815396a1ae47d78f8e880bdfdd148d","amp;dn":"The+J.+Geils+Band+-+Love+Stinks+%5BRockPop%2C+1980%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1518f2e194815396a1ae47d78f8e880bdfdd148d","infoHashBuffer":{"type":"Buffer","data":[21,24,242,225,148,129,83,150,161,174,71,215,143,142,136,11,223,221,20,141]},"announce":[],"urlList":[]}}