{"title":"Computational Visualistics","uid":4008461,"size":9947967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:158be287c67847d3a65f3e5252fcf8e16d956932&amp;dn=Computational+Visualistics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brunnen1685","files":1,"time":1201960167,"description":"The book connects media theory, the philosophies of pictures and of language, with computer graphics and other computer-based processing of pictures\n\n&quot;Few years ago, the department of computer science of the University Magdeburg invented a completely new graduate programme called 'computational visualistics', a curriculum dealing with all aspects of computational pictures. Only isolated aspects had been studied so far in computer science, particularly in the independent domains of computer graphics, image processing, information visualization, and computer vision. So is there indeed a coherent domain of research behind such a curriculum? The answer to that question depends crucially on an abstract generic data structure that acts as a mediator between general visualistics (picture theory, visual culture studies, art history, media theory, semiotics, aesthetics) and computer science: the data structure &quot;image&quot;.\n\nThe present text investigates that data structure, its components, and its application conditions, and thus elaborates the very foundations of computational visualistics as a unique and homogeneous field of research. Before concentrating on that data structure, the theory of pictures in general and the definition of pictures as perceptoid signs in particular are closely examined. This includes an act-theoretic consideration about resemblance as the crucial link between image and object, the communicative function of context building as the central concept for comparing pictures and language, and several modes of reflection underlying the relation between image and image user.\n\nWith this background, the data structure &quot;image&quot; is extendedly analyzed under the perspectives of syntax, semantics, and pragmatics. While syntactic aspects mostly concern image processing, semantic questions form the core of computer graphics and computer vision. Pragmatic considerations are particularly involved with interactive pictures but also extend to the field of information visualization and even to computer art. Four case studies provide practical applications of various aspects of the analysis.&quot;\n","torrent":{"xt":"urn:btih:158be287c67847d3a65f3e5252fcf8e16d956932","amp;dn":"Computational+Visualistics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"158be287c67847d3a65f3e5252fcf8e16d956932","infoHashBuffer":{"type":"Buffer","data":[21,139,226,135,198,120,71,211,166,95,62,82,82,252,248,225,109,149,105,50]},"announce":[],"urlList":[]}}