{"title":"After The Flag Has Been Folded by Karen Spears Zacharias (retail","uid":10799883,"size":4167499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:161ebeb09b58a55f13850d843f96ae39b5ab0d08&amp;dn=After+The+Flag+Has+Been+Folded+by+Karen+Spears+Zacharias+%28retail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1408331344,"description":"Karen Spears was nine years old, living with her family in a trailer in rural Tennessee, when her father, David Spears, was killed in the Ia Drang Valley in Vietnam. It was 1966 Â— in a nation being torn apart by a war nobody wanted, in an emotionally charged Southern landscape stained with racism and bigotry Â— and suddenly the care and well-being of three small children were solely in the hands of a frightened young widow with no skills and a ninth-grade education. But thanks to a mother's remarkable courage, strength, and stubborn tenacity, a family in the midst of chaos and in severe crisis miraculously pulled together to achieve its own version of the American Dream.\n\nBeginning on the day Karen learns of her father's death and ending thirty years later with her pilgrimage to the battlefield where he died, half a world away from the family's hometown, After the Flag Has Been Folded is a triumphant tale of reconciliation between a daughter and her father, a daughter and her nation Â— and a poignant remembrance of a mother's love and heroism.","torrent":{"xt":"urn:btih:161ebeb09b58a55f13850d843f96ae39b5ab0d08","amp;dn":"After+The+Flag+Has+Been+Folded+by+Karen+Spears+Zacharias+%28retail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"161ebeb09b58a55f13850d843f96ae39b5ab0d08","infoHashBuffer":{"type":"Buffer","data":[22,30,190,176,155,88,165,95,19,133,13,132,63,150,174,57,181,171,13,8]},"announce":[],"urlList":[]}}