{"title":"B.B. King - Midnight Believer(1978)Mp3[CR-Bt]","uid":4630029,"size":57360092,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:164721c1d4012e46288fa6518c15bd454dc7ccb0&amp;dn=B.B.+King+-+Midnight+Believer%281978%29Mp3%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tathiana","files":7,"time":1231355524,"description":"B.B. King, nome d'arte di Riley B. King, ÃƒÂ¨ uno dei piÃƒÂ¹ grandi chitarristi nella storia della musica.\nBluesman sempre pieno d'inventiva e pronto a sperimentare nuove sonoritÃƒÂ  e stili, ÃƒÂ¨ stato inserito al terzo posto nella lista dei 100 migliori chitarristi della storia dalla rivista Rolling Stone.\nNato il 16 settembre 1925 a Itta Bena, Mississippi, e figlio di una famiglia molto povera di contadini, iniziÃƒÂ² a suonare la chitarra da giovane e nel 1946 si avvicinÃƒÂ² alla chitarra blues grazie a suo cugino, il cantante blues Bukka White, che King andÃƒÂ² a visitare a Memphis.\nProprio a Memphis iniziÃƒÂ² a suonare per varie radio locali, e nel 1947 si guadagnÃƒÂ² un contratto con la RPM Records di Los Angeles grazie al produttore Sam Phillips (che fonderÃƒÂ  poi la Sun Records).\n\nNegli anni '50 King divenne uno dei piÃƒÂ¹ importanti nomi del R&amp;B grazie ad un'impressionante serie di brani, tra cui &quot;You Know I Love You&quot;, &quot;Whole Lotta Love&quot; e &quot;Woke Up This Morning&quot;.\nNel 1962 passÃƒÂ² alla ABC-Paramount Records, e due anni dopÃƒÂ² registro il leggendario album dal vivo &quot;Live at the Regal&quot;.\n\nIl successo internazionale arrivÃƒÂ² nel 1969 grazie alla cover di Roy Hawkins &quot;The Thrill Is Gone&quot;, che non solo divenne il suo cavallo di battaglia, ma gli fece guadagnare successo anche nelle classifiche pop.\nSempre lo stesso anno andÃƒÂ² in tournee in America con i Rolling Stones, per i quali apriva i concerti.\nGli anni '70 lo consacrarono al successo, e videro anche varie sperimentazioni musicali, tra cui un breve passaggi al jazz con i Crusaders (che diventeranno poi i Jazz Crusaders).\n\nDagli anni '80 fino ad oggi B.B. King ha registrato sempre meno album, e ha collaborato con artisti come gli U2 (&quot;When Love Come To Town&quot; da &quot;Rattle and Hum&quot;, 1988) ed Eric Clapton (&quot;Riding With the King&quot;, 2000), intensificando perÃƒÂ² i concerti dal vivo (con una media di 300 concerti all'anno).\nNel 2006, all'etÃƒÂ  di 80 anni, oltre ad aver inciso l'album &quot;80&quot;, decise di intraprendere un &quot;tour di addio&quot;, che l'ha portato in tutto il mondo e ha marcato la fine della sua carriera (anche se lo stesso B.B.King, nel corso di un'intervista, ha dichiarato &quot;mai dire mai&quot;, lasciando una speranza ai fans di tutto il mondo di poterlo rivedere sul palco).\n\nB.B. King sarÃƒÂ  sempre ricordato come un innovatore del blues (suo ÃƒÂ¨ lo stile di suonare le note con un effetto che ricorda quello dello slide) sempre in coppia con la fedele &quot;Lucille&quot;, la sua chitarra diventata un vero e proprio oggetto di culto e riprodotta dalla Gibson in edizione limitata.","torrent":{"xt":"urn:btih:164721c1d4012e46288fa6518c15bd454dc7ccb0","amp;dn":"B.B.+King+-+Midnight+Believer%281978%29Mp3%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"164721c1d4012e46288fa6518c15bd454dc7ccb0","infoHashBuffer":{"type":"Buffer","data":[22,71,33,193,212,1,46,70,40,143,166,81,140,21,189,69,77,199,204,176]},"announce":[],"urlList":[]}}