{"title":"Led Zeppelin-The Song Remains The Same-AVI@192mp3 (read this)","uid":4004873,"size":864738959,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1717845a1954bb3740c607bd42bf84aaf963b357&amp;dn=Led+Zeppelin-The+Song+Remains+The+Same-AVI%40192mp3+%28read+this%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"srw567","files":2,"time":1201771282,"description":"Hi All,\n    \n    I know there are many versions of this on TPB, but this is a good one and I noticed the others aren't seeded. (or seeded well) Anyway, it's from the special edition 2 DVD set. Of course this is the main movie. I intend to put up the 2 DVD set in ISO format later. I kept the file size up for good quality and the sound is at 192 mp3. The 1st disc, uploaded here, will not let you do it with DVD Shrink or DVD Decrypter without removing some of the disc information such as 5.1 sound or extra languages. (You can do 5.1 sound but must remove some of the 2.0 sound. Not good for many) Of course you CAN do it in DVD 9. Once again a problem for some people. So anyway, as far as avi format is concerned, I think this will do the trick. The cover included is from the original release as that was the one with the main movie only. It's a classic. I think I did it justice in this format.\n\n   Note: Large uploads such as the 2 DVD ISO are a pain to do on TPB since you have to upload 200% or more (2.0 ratio or above) of the file before you get seeders. (At least from TPB) It's not the leachers that are the problem. The uploads from TPB are often shared by many sites. So I offer this as a quality alternitive.\n                                                            \n","torrent":{"xt":"urn:btih:1717845a1954bb3740c607bd42bf84aaf963b357","amp;dn":"Led+Zeppelin-The+Song+Remains+The+Same-AVI%40192mp3+%28read+this%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1717845a1954bb3740c607bd42bf84aaf963b357","infoHashBuffer":{"type":"Buffer","data":[23,23,132,90,25,84,187,55,64,198,7,189,66,191,132,170,249,99,179,87]},"announce":[],"urlList":[]}}