{"title":"Death in the Polka Dot Shoes by Marlin Fitzwater","uid":10093577,"size":609996,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1725aa6d4fa24147e7bae03d767d3565dddb5fc3&amp;dn=Death+in+the+Polka+Dot+Shoes+by+Marlin+Fitzwater&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1399246462,"description":"\nIn the small fishing village of Parkers, Maryland, on the Chesapeake Bay, there is no more independent soul than the lone oysterman or crabber who sets out every morning in pre-dawn hours to search for oyster beds or empty his crab pots. It's a harsh life.\n\nWhen Jimmy Shannon, a Chesapeake waterman, dies during a holiday fishing trip for Blue Fin Tuna, it's almost unbelievable. Stranger still, is his last will and testament that requires his brother Ned Shannon to give up his law practice in Washington, D.C. and return to his family's traditional life on the Bay. Neddie accepts the challenge, takes over his brother's crab boat, practices a little law on the side, and encounters the strangest string of characters in the community.\n\nThe cultural changes are dramatic, especially after it's discovered that Jimmy's death was no accident. He was murdered during his encounter with the giant tuna. Neddie is forced to balance the life of a crab fisherman with a small town law practice, while aiding in the investigation of his brother's death.\n\nThe murder goes from sublime to bizarre when Jimmy's body washes ashore on a Cape Hatteras beach. At the same time, Neddie discovers the passions and values his family has known for generations, and the small town relationships that give meaning to the joys of friendship.\nWhen the watermen of the community marshal their workboats to rescue Neddie, the murder mystery unravels and the heartwarming nature of the community is revealed.\n\nGenre: Mystery Thriller","torrent":{"xt":"urn:btih:1725aa6d4fa24147e7bae03d767d3565dddb5fc3","amp;dn":"Death+in+the+Polka+Dot+Shoes+by+Marlin+Fitzwater","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1725aa6d4fa24147e7bae03d767d3565dddb5fc3","infoHashBuffer":{"type":"Buffer","data":[23,37,170,109,79,162,65,71,231,186,224,61,118,125,53,101,221,219,95,195]},"announce":[],"urlList":[]}}