{"title":"Sexually Broken--Deepthroat specialist Gaia restrained to bedfra","uid":9976078,"size":1220157662,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:175550e4bbca2280f411f8035443b1c58d78d419&amp;dn=Sexually+Broken--Deepthroat+specialist+Gaia+restrained+to+bedfra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1397689023,"description":"Deepthroat specialist Gaia restrained to bedframe vibrated while throatblasted on brutal deepthroat! | Gaia | Matt Williams\n\nApril 16, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nGaia really really loves to deep throat. It is what she was put on this planet to do. She worships it as if the cock was the very air she breathes. This compact little Asian simply can't get enough of the dick and here at Sexuallybroken we truly appreciate that level of dedication. And we reward that kind of dedication by stuffing their faceholes full of cock until their eyes glaze over and they start gasping.\n\nRestrained with zipties on an unforgiving metal bed frame with her head hanging over the edge, Gaia's throathole is wide open and exposed. Even the most experienced of cocksluts will get a proper throat reshaping when bound in this position. A vibrator is locked in place to measure her ability to multi-task. How well can this experienced Asian cock addict focus on her task while the vibrator is ripping orgasm after orgasm out of her bound body? A dusting of oil to properly shine up Gaia's booming curves are the final touch.\n\nWe simply walk right up and own Gaia's throat. There is not a thing she can do about it. The rock hard cock pounds her tonsils. To her credit, she takes it balls deep. It is like a magician making a rabbit disappear into a top hat. If the top hat was a throat. While the dick plows her facepussy, the vibrator is ripping orgasm after orgasm out of her restrained pussy. Gaia is so dedicated to her craft she has Porn tattooed right above her cunt. We entertain ourselves by resting our balls on her forehead as she gives us the big eyes.\n\nThe cock starts to break her down. She is dizzy and glassy eyed, her throat reduced to a cock sheath. The multiple orgasms and the strict bondage blast her into subspace. Her face and hair are destroyed, slick with her own throat lube. When we have repounded out the shape of her throat to be custom fitted to the shape of our dick, we walk away, leaving her well-used head dangling off the side of our fuckbed. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_16gaia2/SexuallyBroken-Gaia-Matt-Williams-Deepthroat-specialist-Gaia-restrained-to-bedframe-vibrated-while-throatblasted-on-brutal-deepthroat.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_16gaia2/SexuallyBroken-Gaia-Matt-Williams-Deepthroat-specialist-Gaia-restrained-to-bedframe-vibrated-while-throatblasted-on-brutal-deepthroat.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:175550e4bbca2280f411f8035443b1c58d78d419","amp;dn":"Sexually+Broken--Deepthroat+specialist+Gaia+restrained+to+bedfra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"175550e4bbca2280f411f8035443b1c58d78d419","infoHashBuffer":{"type":"Buffer","data":[23,85,80,228,187,202,34,128,244,17,248,3,84,67,177,197,141,120,212,25]},"announce":[],"urlList":[]}}