{"title":"[BangBus] Kody Kay (The Cock Hungry Waitress)","uid":9035275,"size":708302870,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:178339d7279f56b27b41c75d46d4625b9d2c9bc1&amp;dn=%5BBangBus%5D+Kody+Kay+%28The+Cock+Hungry+Waitress%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1381452093,"description":"[BangBus] Kody Kay (The Cock Hungry Waitress)\n\nIt's another day and we are back on the streets looking for another sexy victim. After driving around, we ended up in downtown and we found this dude that immediately recognized me and happened to be a huge fan. This guy was so loud and crazy we decided to take him for a ride, he said that he goes by the name &quot;Havana Joe&quot; or something like that..I called him &quot;Joe Shmoe&quot; yeah, that sounded more like him. After some more driving around and some crazy shit we get to this bus stop, where this pretty blond girl is just sitting and smoking a cigarette. She told us her name was &quot;Kody&quot; and said she was there waiting for a bus, to go work at her mother's Restaurant. We offered her a ride and Three hundred dollars and this girl did not hesitate. When she got on the bus I couldn't help to notice her pretty face and sexy body, she has a round little ass that looks simply &quot;perfect&quot;. After paying her more money we suggested that she give Joe a hand job, she was willing to do it but this fagot got scared and we had to kick him out. I could not pass on the opportunity and immediately got this girl naked. Kody is up for anything as you're about to see. She switches positions more than a race car driver until she finally gets what she wants. I had a blast fucking her tight hole and when the time came she took a big load in her sweet face. Afterwards we dropped her off at the train station, she was fine with that. What she didn't know was that Spice pulled all the money we gave her out of her bag and now she is going home empty handed. Well, at least she got some dick...\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=pnu3lshupyd1h7zdqbts.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=pnu3lshupyd1h7zdqbts.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=56xi1itp39hi9u65pyve.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=56xi1itp39hi9u65pyve.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:178339d7279f56b27b41c75d46d4625b9d2c9bc1","amp;dn":"%5BBangBus%5D+Kody+Kay+%28The+Cock+Hungry+Waitress%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"178339d7279f56b27b41c75d46d4625b9d2c9bc1","infoHashBuffer":{"type":"Buffer","data":[23,131,57,215,39,159,86,178,123,65,199,93,70,212,98,91,157,44,155,193]},"announce":[],"urlList":[]}}