{"title":"How to Defend the Christian Faith - John W. Loftus","uid":15174157,"size":256471505,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:17eb362a6501477aa71f4b6ace4441f211d62388&amp;dn=How+to+Defend+the+Christian+Faith+-+John+W.+Loftus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twp6045","files":1,"time":1467409124,"description":"The first book on Christian apologetics written by a leading atheist figure that teaches Christians the best and worst arguments for defending their faith against attack \r\n \r\nThe Christian faith has been vigorously defended with a variety of philosophical, historical, and theological arguments, but many of the arguments used in an earlier age no longer resonate in today’s educated West. Where has apologetics gone wrong? What is the best response to the growing challenge presented by scientific discovery and naturalistic thought? Unlike every work on Christian apologetics that has come before, How to Defend the Christian Faith is the first one written by an atheist for Christians. As a former Christian defender who is now a leading atheist thinker, John Loftus answers these questions and more. He tells would-be apologists how to train properly, where to study, what to study, what issues they should concern themselves with, and how poorly the professors who currently train them practice their craft. In the process, he shows readers why Christian apologists have failed to reach the intelligent nonbeliever. For those Christian apologists who think this book will provide a secret formula to convert the nonbelieving masses, be warned: as an exposé of the present state of Christian aplogetics, it can just as easily be used by atheists to refute apologetic arguments. Thus, this book presents both an opportunity and a challenge to Christians: they must either change how apologetics is done, or quit doing apologetics altogether.\r\n\r\nJohn W. Loftus is a leading atheist writer and thinker. A former evangelical minister and Christian apologist, he had ministries in Michigan, Illinois, and Indiana, and taught at several Christian and secular colleges. He is the author of Why I Became an Atheist: A Former Preacher Rejects Christianity and The Outsider Test for Faith: How to Know Which Religion Is True and editor of The Christian Delusion: Why Faith Fails, The End of Christianity, and Christianity Is Not Great: How Faith Fails. His popular blog can be found atHe lives in Fort Wayne, Indiana.\r\n\r\nIncluded here is the drm-free Audible file. Enjoy!","torrent":{"xt":"urn:btih:17eb362a6501477aa71f4b6ace4441f211d62388","amp;dn":"How+to+Defend+the+Christian+Faith+-+John+W.+Loftus","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17eb362a6501477aa71f4b6ace4441f211d62388","infoHashBuffer":{"type":"Buffer","data":[23,235,54,42,101,1,71,122,167,31,75,106,206,68,65,242,17,214,35,136]},"announce":[],"urlList":[]}}