{"title":"Taikun","uid":7773198,"size":369334758,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1a71a98fbdcb7dc0948b47740ea7734238ee6365&amp;dn=Taikun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zaini711","files":-1,"time":1351590539,"description":"Classification: 18\n\nGenre: Action / Comedy\n\nGeneral Release Date: 04 Oct 2012\n\nRunning Time: 1 Hour 25 Minutes\n\nDistributor: Metrowealth\n\nCast: Angah Raja Lawak, Along Raja Lawak, Alex Yanz, Zul Suphian, Adey Syafrien\n\nDirector: Ismail Bob Hasim\n\nHot on the heels of the success his film &quot;Bini-Biniku Gangster&quot; comes another gangster action comedy by director Ismail Bob Hashim, starring Angah and Along Raja Lawak as the leads. &quot;Taikun&quot; tells the story of two men named Tai and Kun, best friends whose only loves in life are fighting and thievery. When their vices lead them to bump into and severely beat up gang members Pink and Purple, Tai and Kun are then recruited by the gang leader, who is in awe of their skills. Will Tai and Kun accept the offer? Is it the life that they really want?\n\nFilem di bawah arahan Bob Hashim ini mengisahkan dua sahabat baik yang dikenali sebagai Tai (Angah Raja Lawak) dan Kun (Along Raja Lawak) yang mempunyai masalah dengan pihak berkuasa. Sifat mereka suka bergaduh dan mencuri menyebabkan mereka bertembung dengan ahli-ahli Geng Ros Hitam dan Tedung. Disebabkan Tai dan Kun membelasah kedua-dua ahli geng dengan teruk, ketua Geng Pink, Manan dan ketua Geng Purple, Sarip merasa tertarik dengan kehebatan mereka berdua dan mengajak Tai dan Kun untuk menyertai geng mereka. Namun, Geng Pink dan Geng Purple mula ditimpa masalah yang mana semua kegiatan mereka sering dihidu polis. Masing-masing mula menunding jari menuduh geng lain. Tapi dalam diam, ada dalang yang membocorkan semuanya dan Tai dan Kun dituduh sebagai dalangnya namun Sarip dan Manan tidak percaya. ","torrent":{"xt":"urn:btih:1a71a98fbdcb7dc0948b47740ea7734238ee6365","amp;dn":"Taikun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a71a98fbdcb7dc0948b47740ea7734238ee6365","infoHashBuffer":{"type":"Buffer","data":[26,113,169,143,189,203,125,192,148,139,71,116,14,167,115,66,56,238,99,101]},"announce":[],"urlList":[]}}