{"title":"Icon For Hire","uid":9740559,"size":232056385,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1b852a82a7688162840710551bb3f6c2ab7fa7e8&amp;dn=Icon+For+Hire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"JohnLDoe","files":-1,"time":1394506702,"description":"A band I recently discovered.\n\n-&gt; Their merch Website: http://www.iconforhire.com/\n\n-&gt; EPs: Icon For Hire (2008), The Grey (2009)\n\n-&gt; Studio albums: Scripted (2011), Icon For Hire (2013)\n\n\nIcon For Hire [EP] cover -&gt; http://bayimg.com/AAlDeaAFg\n\nThe Grey [EP] cover -&gt; http://bayimg.com/AAldIaaFG\n\nScripted album cover -&gt; http://bayimg.com/palCdaAfg\n\nIcon For Hire album cover -&gt; http://bayimg.com/pAlCoAAFg\n\n\n\nPlease note that these songs may be explicit.\n\n\n\n                                   Files\n\nIcon For Hire [EP](2008):\n01 - Call Me Alive    4:43\n02 - Off With Her Head    3:02\n03 - Pernilla (Only A Memory)    3:18\n04 - Pernilla (Only A Memory) (Live Acoustic)    3:46\n\n\nThe Grey [EP](2009):\n01 - Carried Away    3:05\n02 - Fall Apart    3:12\n03 - The Grey    3:09\n\n\nScripted (2011):\nOverture    0:30\nTheater    2:42\nMake A Move    3:03\nGet Well    2:57\nThe Grey    3:27\nOff With Her Head    3:05\nFight    3:00\nUp In Flames    2:48\nIodine    2:32\nOnly A Memory    3:51\nPieces    3:59\nFall Apart    3:15\nCall Me Alive    4:47\n\n\nIcon For Hire (2013):\nCynics &amp; Critics    3:22\nNerves    3:15\nSugar &amp; Spice    4:02\nHope of Morning    3:49\nSorry About Your Parents    3:17\nPop Culture    3:23\nWatch Me    3:34\nSlow Down    3:46\nRock and Roll Thugs    3:36\nThink I'm Sick    2:54\nFix Me    3:47\nCounting on Hearts    3:59\n\n\n\n\n\nThe band was formed in Decatur, Illinois by vocalist Ariel Bloomer and guitarist Shawn Jump. When the two met in 2007, Ariel, upon discovering that Jump played guitar, initiated a musical collaboration between the two of them. When the need for a drummer arose, Jump recruited Adam Kronshagen, an old friend he had held jam sessions with as a member of the local party scene (Jump was six months clean at the time). Bassist Joshua Davis joined and the band was officially formed in November of that year, choosing their name as a satirical comment on the state of the music industry.\n\nThe band played their first show in a local club before an audience of family and friends, who gave them a positive reception even though, by the band's own admission, they gave a terrible performance. Ariel has been quoted as saying of the performance, &quot;Our passion for music was there; whatever we lacked in sound we made up for with enthusiasm.&quot; Over the next two years, the band toured throughout the Midwest and released two EPs, the self-titled Icon for Hire EP in 2008 and The Grey EP in 2009. During that same year, Davis left the band.\n\nIn late 2009, the band was contacted by Tooth &amp; Nail Records through Myspace. The label then sent representatives to one of the band's shows, and eventually signed them in July 2010. &quot;We are thrilled to be joining such an established and well-respected group at Tooth &amp; Nail,&quot; shared the band upon their signing. &quot;It's a label that has a history of consistently putting out good music and really working side by side with their artists. Because we've been doing this thing on our own for over two years, it feels great to partner with Tooth &amp; Nail. We can't wait to record our debut full-length and see where this road takes us.&quot; They spent the last quarter of 2010 in the studio with producers Rob Hawkins and Aaron Sprinkle recording their first full-length album, Scripted, which was released by the label on August 23, 2011. The album made it on the US Billboard charts at No. 7 for Hard Rock Albums, No. 5 for Christian Albums, No. 16 for Alternative Albums, No. 22 for Rock Albums, and No. 95 on the Billboard 200. It also sold more than 4,300 units in the first week of release and broke the record for first week sales on a Tooth &amp; Nail debut album. The band also achieved success with the album's lead single &quot;Make a Move&quot;, which peaked at No. 13 on R&amp;R/Billboard's Christian Rock chart and had an accompanying music video exclusively released online by Guitar World magazine's website. Also in 2011, the band acquired current bassist Josh Kincheloe.\n\nIn December 2011, Ariel stated that, while the band had been focusing on extensive touring rather than writing new music, she had &quot;a feeling that we'll start piecing together some demos shortly.&quot; In a later interview with TVU Music channel, she revealed that the band was in the early stages of writing songs for a second album. In an interview with KHRT-FM, the band expressed their desire for the album to be &quot;heavier....more aggressive&quot;, with more bubblegum pop production and possible hip hop elements. On August 15, 2013, Icon for Hire premiered their new single &quot;Cynics and Critics&quot; via lyric video and announced their second album, the self-titled Icon for Hire. The album was released on October 15, 2013, whereupon it reached number 66 on the Billboard 200 and received largely positive reviews.\n","torrent":{"xt":"urn:btih:1b852a82a7688162840710551bb3f6c2ab7fa7e8","amp;dn":"Icon+For+Hire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b852a82a7688162840710551bb3f6c2ab7fa7e8","infoHashBuffer":{"type":"Buffer","data":[27,133,42,130,167,104,129,98,132,7,16,85,27,179,246,194,171,127,167,232]},"announce":[],"urlList":[]}}