{"title":"Metallica-Kill_Em_All-(Retail)-1983-HHI","uid":6513424,"size":82149052,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1b8763abc71448f869e17ef12ed2410cf7a98d51&amp;dn=Metallica-Kill_Em_All-%28Retail%29-1983-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raidy","files":13,"time":1309725086,"description":"RELEASE INFORMATION \n[HHI] - Happy Hacker Industries - [HHI]\n\n Artist......: Metallica \n Album.......: Kill em all \n Grabber : EAC \n Encoder : LAME v3.90.3 \n Release Date: May 1983 \n Rip Date....: Mar-27-2005 \n Genre.......: Metal \n Quality : VBRkbps / 44.1kHz / Joint-Stereo \n Playtime : 51:18 min \n Ripper : Happy Hacker Industries \n Supplier : HHI \n CD Songs : 10 \n Label.......: Elektra \n Album Info..: \n \n The true birth of thrash. On Kill 'Em All, Metallica fuses the intricate riffing of New Wave of British Heavy Metal bands like Judas Priest, Iron Maiden, and Diamond Head with the velocity of MotÃƒÂ·rhead and hardcore punk. James Hetfield's highly technical rhythm guitar style drives most of the album, setting new standards of power, precision, and stamina. But really, the rest of the band is just as dexterous, playing with tightly controlled fury even at the most ridiculously fast tempos. There are already several extended, multi-sectioned compositions foreshadowing the band's later progressive epics, though these are driven by adrenaline, not texture. A few tributes to heavy metal itself are a bit dated lyrically; like Diamond Head, the band's biggest influence, Kill 'Em All's most effective tone is one of supernatural malevolence -- as pure sound, the record is already straight from the pits of hell. Ex-member Dave Mustaine co-wrote four of the original ten tracks, but the material all sounds of a piece. And actually, anyone who worked backward through the band's \n catalog might not fully appreciate the impact of Kill 'Em All when it first appeared  -- unlike later releases, there simply isn't much musical variation (apart from a  lyrical bass solo from Cliff Burton). The band's musical ambition also grew rapidly, so today, Kill 'Em All sounds more like the foundation for greater things to come. But that doesn't take anything away from how fresh it sounded upon first release, and time hasn't dulled the giddy rush of excitement in these performances. Frightening, awe-inspiring, and absolutely relentless, Kill 'Em All is pure destructive power, executed with jaw-dropping levels of scientific precision. [An Elektra reissue added the cover songs &quot;Blitzkrieg&quot; and &quot;Am I Evil?&quot; from the European Creeping Death EP, which were later deleted and included on Garage, Inc.] \n  \n Track Listing....: \n 01.Hit the lights [04:17] \n 02.The four horsemen [07:13] \n 03.Motorbreath [03:08] \n 04.Jump in the fire [04:42] \n 05.(anesthesia)--pulling teeth [04:15] \n 06.Whiplash [04:10] \n 07.Phantom lord [05:02] \n 08.No remorse [06:26] \n 09.Seek &amp; destroy [06:55] \n 10.Metal militia [05:10] \n ____ \n \n 51:18 min \n 78,3 MB","torrent":{"xt":"urn:btih:1b8763abc71448f869e17ef12ed2410cf7a98d51","amp;dn":"Metallica-Kill_Em_All-%28Retail%29-1983-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b8763abc71448f869e17ef12ed2410cf7a98d51","infoHashBuffer":{"type":"Buffer","data":[27,135,99,171,199,20,72,248,105,225,126,241,46,210,65,12,247,169,141,81]},"announce":[],"urlList":[]}}