{"title":"Teddy Charles - New Directions (1953, Prestige-OJC)","uid":8631561,"size":151701670,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1b93f3269598760fb1df32f9c927fd909b5a68f4&amp;dn=Teddy+Charles+-+New+Directions+%281953%2C+Prestige-OJC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1372638851,"description":"eac secure with cue log and scans\n\nVibraphonist Teddy Charles was turning people's heads when he recorded these tracks in the early 1950s. Originally released on one LP (entitled Teddy Charles &amp; His Trio) and two EPs (both titled New Directions, one credited to the Teddy Charles Quartet and one to Teddy Charles, Hall Overton, and Ed Shaughnessy), these performances find him taking standards like &quot;Ol' Man River&quot; and &quot;Basin Street Blues&quot; down strange paths and creating unusually challenging &quot;modern&quot; music in collaboration with pianist and pedagogue Hall Overton. The trio that performs the first eight tracks consisted of Charles, guitarist Don Roberts, and bassist Kenny O'Brien; without a drummer, their sound is somewhat fragile, which doesn't benefit Charles' boppish arrangement of &quot;Ol' Man River&quot; but nicely serves his almost ethereal conception of &quot;I'll Remember April.&quot; The last four tracks on this collection are the most interesting and challenging: titled &quot;Mobiles,&quot; &quot;Antiphony,&quot; &quot;Metalizing,&quot; and &quot;Decibels,&quot; they are compositions based on organizational concepts rather than melodic ideas and sound something like a cross between John Cage and Charles Mingus. Not everyone will love this stuff, but anyone with an interest in jazz theory and history will want to hear it at least once. ","torrent":{"xt":"urn:btih:1b93f3269598760fb1df32f9c927fd909b5a68f4","amp;dn":"Teddy+Charles+-+New+Directions+%281953%2C+Prestige-OJC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b93f3269598760fb1df32f9c927fd909b5a68f4","infoHashBuffer":{"type":"Buffer","data":[27,147,243,38,149,152,118,15,177,223,50,249,201,39,253,144,155,90,104,244]},"announce":[],"urlList":[]}}