{"title":"Power of Myth (DVDRip)","uid":4257809,"size":2701512702,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1c41152776dff6082432c7331dc8851cbca791b1&amp;dn=Power+of+Myth+%28DVDRip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ivan001","files":7,"time":1214328466,"description":"AUDIO: English (MP3)\nVIDEO: Xvid\nSUBS: Portuguese (on video)\n\n\nAmazon.com\nJoseph Campbell and the Power of Myth is essential viewing for anyone old enough to appreciate its vital teachings. One of the greatest interviews ever recorded, this six-part, six-hour encounter between teacher- mythologist Campbell and student-journalist Bill Moyers (recorded in the two years preceding Campbell&amp;#039;s death in 1988) covers a galaxy of topics related to Campbell&amp;#039;s central themes: Mythology is humanity&amp;#039;s universal method of seeking the transcendental, and &quot;follow your bliss&quot; is the timeless formula for spiritual satisfaction. Campbell himself is the embodiment of these themes, an erudite scholar and quintessential storyteller, recalling a wide spectrum of myths from throughout history (Japanese, Native American, Egyptian, Mayan, and many more) to illustrate humankind&amp;#039;s eternal quest to grasp the mysteries of creation. Historical artifacts and illustrations bring these timeless stories to life.\n\nAn astute interviewer, Moyers is an acolyte in perfect harmony with Campbell-as- mentor, wording questions with penetrating perfection as their intellectual dance reaches exhilarating heights of meaning and fascination. Moyers also finds the perfect hook for a global audience, examining Campbell&amp;#039;s admiration of George Lucas&amp;#039;s Star Wars saga as a popular tapestry of ancient myths, and Lucas himself is interviewed in a DVD bonus segment (&quot;I&amp;#039;m not creating a new myth,&quot; he says, &quot;but telling old myths in a new way&quot;). Campbell&amp;#039;s seemingly endless well of knowledge reaches a simple conclusion: we need myths to survive like we need oxygen to breathe, as a life force with which to understand our existence--past, present, and future. --Jeff Shannon \n\nProduct Description\nAn exhilarating journey into the mind and spirit of a remarkable man, a legendary teacher, and a masterful storyteller, conducted by TV journalist Bill Moyers in the acclaimed PBS series. Includes The Hero&amp;#039;s Adventure, The Message of the Myth, The First Storytellers, Sacrifice and Bliss, Love and the Goddess, Masks of Eternity. 360 minutes.","torrent":{"xt":"urn:btih:1c41152776dff6082432c7331dc8851cbca791b1","amp;dn":"Power+of+Myth+%28DVDRip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c41152776dff6082432c7331dc8851cbca791b1","infoHashBuffer":{"type":"Buffer","data":[28,65,21,39,118,223,246,8,36,50,199,51,29,200,133,28,188,167,145,177]},"announce":[],"urlList":[]}}