{"title":"Man vs Snake: The Long and Twisted Tale of Nibbler (2015)","uid":15086352,"size":5342097451,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1c9e1454d126be256f9f777ad5c88530a903496b&amp;dn=Man+vs+Snake%3A+The+Long+and+Twisted+Tale+of+Nibbler+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SteveLazar","files":1,"time":1466886913,"description":"If you ever played the game &quot;Snake&quot; on your early model Nokia cellphone, then you're familiar with &quot;Nibbler,&quot; the original &quot;snake&quot; game. MAN VS SNAKE tells the story of Tim McVey (the gamer not the bomber) who in 1984, on a single quarter (and over forty-four hours of non-stop play) was the first person in history to score over one billion points on a video game. This historic accomplishment led the City of Ottumwa to declare a civic day in Tim's honor (Tim McVey Day) and present him with the key to the city. Twenty-five-years later, when rumors of a higher score surface online, attributed to Italian kick-boxing champion Enrico Zanetti, it calls into question everything Tim McVey has believed for decades and forces him to make a decision: either set a new world record, or risk losing his legacy forever. Now middle-aged and out of shape, Tim discovers that reclaiming the Nibbler title will not be easy. Packed with unexpected twists and turns, the film documents one of the epic achievements of the classic gaming era and proves a powerful tale of the triumph of the human spirit. \r\n\r\nDirectors: Tim Kinzy,  Andrew Seklir  \r\n\r\nStars: Tim McVey,  Dwayne Richard,  Enrico Zanetti","torrent":{"xt":"urn:btih:1c9e1454d126be256f9f777ad5c88530a903496b","amp;dn":"Man+vs+Snake%3A+The+Long+and+Twisted+Tale+of+Nibbler+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c9e1454d126be256f9f777ad5c88530a903496b","infoHashBuffer":{"type":"Buffer","data":[28,158,20,84,209,38,190,37,111,159,119,122,213,200,133,48,169,3,73,107]},"announce":[],"urlList":[]}}