{"title":"Agatha Christie - Peril at End House (BBC)","uid":6321938,"size":134012760,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1d377be9388edc3d278363e601f7434203d16f96&amp;dn=Agatha+Christie+-+Peril+at+End+House+%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fakeplastictrousers2","files":-1,"time":1302965986,"description":"From BBC Radio 4 Extra. Written by Agatha Christie; Full-cast dramatisation starring John Moffatt as Hercule Poirot, and Simon Williams as Hastings.\n\nHercule Poirot and his good friend Captain Hastings are enjoying a well-deserved break on the Cornish Riviera, in the idyllic village of St Loo. Wandering along the terrace of the Hotel Majestic on the first morning of their stay, Poirot literally falls at the feet of a pretty, dark-haired girl and, much to Hastings delight, insists that she join them for a cocktail. The girl is Nick Buckley, last in a long line of Buckleys to live at End House, an isolated old place perched on the end of a rocky outcrop. As she reassures the two friends that living there is more fun than it might seem, Poirot s ears prick up she is having fun, Nick says, despite the fact that she has had three near-fatal accidents in the past few days. To Poirot, that adds up to more than coincidence. And when Nick jerks away from a bee flying past that turns out to be a bullet, the Belgian knows there is work ahead for the little grey cells. The perpetrator of these accidents may well be endlessly inventive and diabolically clever, but is he a match for the meticulous M. Poirot?","torrent":{"xt":"urn:btih:1d377be9388edc3d278363e601f7434203d16f96","amp;dn":"Agatha+Christie+-+Peril+at+End+House+%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d377be9388edc3d278363e601f7434203d16f96","infoHashBuffer":{"type":"Buffer","data":[29,55,123,233,56,142,220,61,39,131,99,230,1,247,67,66,3,209,111,150]},"announce":[],"urlList":[]}}