{"title":"The Privileged Planet","uid":4853008,"size":284970290,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1e412f60c8a93eee94a755257f5cb6c41f9876e8&amp;dn=The+Privileged+Planet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MrTVGuy","files":1,"time":1239950049,"description":"Today, most scientists and philosophers claim that Earth is an ordinary speck of dust adrift, without purpose or significance, in a vast cosmic sea. This idea (popularized by the late astronomer, Carl Sagan) is an outgrowth of the naturalistic philosophy that has dominated science for the past 150 years. Yet, remarkable evidence--unveiled by contemporary astronomy and physics-may now tell a very different story. Building upon the overwhelming success of Unlocking the Mystery of Life (widely acclaimed as the most effective refutation of Darwinian theory, ever produced), Illustra Media presents The Privileged Planet. This hour-long documentary explores the scientific evidence for intelligent design and purpose in the universe. In the process, Earth is revealed as far more than the product of time, chance, and random natural processes. We now know that a rare and finely tuned array of factors makes Earth suitable for complex life. We depend on our planet's oxygen-rich atmosphere, its large moon, its planetary neighbors, and its precise location within the solar system and Milky Way galaxy. But the story does not end here. For, the same factors that make a planet like Earth hospitable to life also provide the best conditions for scientific discovery. Is this correlation merely a coincidence? Or does it point to a deeper truth about the purpose of the cosmos and the reality of a transcendent designer? The answer could dramatically affect 21st century science. Through stunning computer animation, interviews with leading scientists, and spectacular images of Earth and the cosmos, The Privileged Planet explores a startling connection between our capacity to survive and our ability to observe and understand the universe. A connection that points directly to the work of a creative mind and plan. This extraordinary documentary will be a focal point in the escalating debate between evolution and design.","torrent":{"xt":"urn:btih:1e412f60c8a93eee94a755257f5cb6c41f9876e8","amp;dn":"The+Privileged+Planet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e412f60c8a93eee94a755257f5cb6c41f9876e8","infoHashBuffer":{"type":"Buffer","data":[30,65,47,96,200,169,62,238,148,167,85,37,127,92,182,196,31,152,118,232]},"announce":[],"urlList":[]}}