{"title":"Propinquinty - Propinquity (1973)","uid":6873100,"size":92129069,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1e673fa13f10afad84a2f238587ec2b4b7ac06ab&amp;dn=Propinquinty+-+Propinquity+%281973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"summer1967love","files":21,"time":1323335183,"description":"Original Release / Numero Group / NUM-AST3 / CD\n\n01. People Come.mp3\t7.81 MB\n02. And I A Fairy Tale Lady.mp3\t5.20 MB\n03. Tappan Square.mp3\t4.60 MB\n04. You Don't Have To Hurry.mp3\t6.13 MB\n05. Standing In The Doorway.mp3\t3.73 MB\n06. Dorian 240 Lament.mp3\t4.70 MB\n07. Window.mp3\t5.74 MB\n08. Binghampton.mp3\t5.77 MB\n09. I'll Be Here In The Morning.mp3\t5.39 MB\n10. Ohio.mp3\t5.85 MB\n11. Miles Before Sleeping.mp3\t4.05 MB\n12. Sea Song.mp3\t4.47 MB\n13. Suite For Windy Spring.mp3\t9.04 MB\n14. Child.mp3\t6.09 MB\n15. Where I'm Bound.mp3\t3.21 MB\n16. Chermaine.mp3\t2.20 MB\nPropinquity Propinquity.nfo\t1.81 KB\nback.jpg\t878.04 KB\nf&amp;b delirioraga.jpg\t1.05 MB\nfolder.jpg\t902.36 KB\ninside delirioraga.jpg\t1.11 MB\n\n\n\nPropinquity was a folk-rock group from Boulder, CO, who had a healthy hometown following and recorded an album for a local label, Owl Records, in 1972 before parting ways the following year. Propinquity's story isn't much different from hundreds of similar groups of the era, but a listen to the album they left behind confirms they were significantly more talented and imaginative than the masses of singer/songwriter-influenced acts that made the rounds in the early '70s. Four of Propinquity's five members wrote and sang, and while each had a distinct style, they knew how to blend their voices with enviable skill, and the dour loneliness of Mel Stonebraker's &quot;Dorian 240 Lament,&quot; the gentle introspection of Pat Hubbard's &quot;Tappan Square,&quot; the jazzy insistence of Jason Potter's &quot;Binghamton,&quot; and the ethereal clarity of Carla Sciaky's &quot;And I a Fairy Tale Lady&quot; are even stronger as part of a whole than as individual pieces. (&quot;And I Was a Fairy Tale Lady&quot; was cherry-picked from this album for The Numero Group's splendid compilation Wayfaring Strangers: Ladies from the Canyon, the success of which helped prompt the reissue of Propinquity's album in full.) Hubbard, Potter, Sciaky, and Stonebraker were all accomplished instrumentalists as well as gifted vocalists (as was percussionist Jeff Harper), and the rich but subtle arrangements and clever dynamics make the ensemble sound larger than they were; the depth and maturity of the music is all the more impressive when you discover the oldest member of the group was just 23, while Sciaky was all of 18 years when she recorded this album. It's tempting to link Propinquity's album in with the current freak folk revival, but this music never embraces eccentricity for its own sake; instead, this is timeless and beautifully crafted acoustic music that is a product of its time largely in its cautious optimism and absence of irony, and Propinquity is a lost treasure of the waning days of folk-rock. ~ Mark Deming\n\nPropinquity: Carla Sciaky (guitar, violin, bass guitar); Jason Potter, Pat Hubbard (guitar, piano); Mel Stonbraker (guitar, bass guitar); Jeff Harper (drums, percussion).\n\nAudio Remasterer: Jeff Lipton.","torrent":{"xt":"urn:btih:1e673fa13f10afad84a2f238587ec2b4b7ac06ab","amp;dn":"Propinquinty+-+Propinquity+%281973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e673fa13f10afad84a2f238587ec2b4b7ac06ab","infoHashBuffer":{"type":"Buffer","data":[30,103,63,161,63,16,175,173,132,162,242,56,88,126,194,180,183,172,6,171]},"announce":[],"urlList":[]}}