{"title":"Data Hiding-Syngress","uid":8462606,"size":33485491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1fa50be7981d28419f5f345c65ab5a0a4b99ffd3&amp;dn=Data+Hiding-Syngress&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"d347hBy73","files":-1,"time":1368231786,"description":"Data Hiding: Exposing Concealed Data in Multimedia, Operating Systems, Mobile Devices and Network Protocols\n\nBook Details:\n\nPages: 350 pages\nPublisher: Syngress (November 2012)\nLanguage: English\nISBN-10: 1597497436\nISBN-13: 978-1597497435\nFormat: PDF, EPUB\n\nBook Description:\n\nAs data hiding detection and forensic techniques have matured, people are creating more advanced stealth methods for spying, corporate espionage, terrorism, and cyber warfare all to avoid detection. Data Hiding provides an exploration into the present day and next generation of tools and techniques used in covert communications, advanced malware methods and data concealment tactics. The hiding techniques outlined include the latest technologies including mobile devices, multimedia, virtualization and others. These concepts provide corporate, goverment and military personnel with the knowledge to investigate and defend against insider threats, spy techniques, espionage, advanced malware and secret communications. By understanding the plethora of threats, you will gain an understanding of the methods to defend oneself from these threats through detection, investigation, mitigation and prevention.\n\nReview of the latest data hiding techniques presented at world-renownded conferences\nProvides many real-world examples of data concealment on the latest technologies including iOS, Android, VMware, MacOS X, Linux and Windows 7\nDives deep into the less known approaches to data hiding, covert communications, and advanced malware\nIncludes never before published information about next generation methods of data hiding\nOutlines a well-defined methodology for countering threats\nLooks ahead at future predictions for data hiding\n\nTable of Contents:\nChapter 1. History of Secret Writing\nChapter 2. Four Easy Data Hiding Exercises\nChapter 3. Steganography\nChapter 4. Multimedia Data Hiding\nChapter 5. Data Hiding among Android Mobile Devices\nChapter 6. Apple iOS Data Hiding\nChapter 7. Operating System Data Hiding\nChapter 8. Virtual Data Hiding\nChapter 9. Data Hiding in Network Protocols\nChapter 10. Forensics and Anti-Forensics\nChapter 11. Mitigation Strategies\nChapter 12. Futures\n","torrent":{"xt":"urn:btih:1fa50be7981d28419f5f345c65ab5a0a4b99ffd3","amp;dn":"Data+Hiding-Syngress","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fa50be7981d28419f5f345c65ab5a0a4b99ffd3","infoHashBuffer":{"type":"Buffer","data":[31,165,11,231,152,29,40,65,159,95,52,92,101,171,90,10,75,153,255,211]},"announce":[],"urlList":[]}}