{"title":"CreativeLIVE - Making Money with Music with Randy Chertkow and J","uid":9276177,"size":6633684990,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:20be648a466ad3179324e60e24059f38573340ee&amp;dn=CreativeLIVE+-+Making+Money+with+Music+with+Randy+Chertkow+and+J&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kr33","files":3,"time":1385859688,"description":"Making Money with Music\n\nIn today's tech-driven world, it's easier than ever to record, distribute, and market your own music, but what about actually making money? During this 3-day course, longtime industry professionals -- and best-selling authors -- Randy Chertkow and Jason Feehan will take you step-by-step through their proven techniques for establishing steady revenue streams in the music business.\n\nDrawing on their combined experience of over 32 years in the industry, Jason and Randy will teach you how to rise above the rest, landing your music on all the popular radio stations, selling your albums in stores, making the most of digital distribution, and licensing your music for commercials and movie and TV soundtracks. You will learn how to maximize the money you make from your music and minimize the money you spend promoting it.\n\nJason and Randy will also outline how to set up the right support team through networking, giving back to your fans, and identifying the right collaboration opportunities. After 3 days, you'll have an extensive playbook for making money from your music and scaling your business. ","torrent":{"xt":"urn:btih:20be648a466ad3179324e60e24059f38573340ee","amp;dn":"CreativeLIVE+-+Making+Money+with+Music+with+Randy+Chertkow+and+J","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20be648a466ad3179324e60e24059f38573340ee","infoHashBuffer":{"type":"Buffer","data":[32,190,100,138,70,106,211,23,147,36,230,14,36,5,159,56,87,51,64,238]},"announce":[],"urlList":[]}}