{"title":"Macroplant Phone Disk v1.2.0.3 with Keygen","uid":6864911,"size":3066080,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:210a07e0a57c8d397f7a8def1ee2a1dbde20d69e&amp;dn=Macroplant+Phone+Disk+v1.2.0.3+with+Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Slammer94","files":1,"time":1323057341,"description":"This is a program form Macroplant called Phone Disk. Basically, it lets you &quot;mount&quot; your iPhone or iPod touch ( but not iPad, as far as I know) as a disk in the normal Explorer interface. This just means that you can view the whole file structure like a USB drive. The interface says that it supports any model, but I don't know for sure. Check here for more details about it: http://www.macroplant.com/phonedisk/\n\nI did NOT make this. I was just lucky enough to find it elsewhere on the internet, and knew that a lot of people want this. Personally, I missed the &quot;free serial&quot; giveaway period by 4 days, and decided that was just unfair, and went and found this. So credits go to whoever actually compiled this, it still has the original nfo files that should tell you if you care. \n\nI un-compressed all the relevant files and put them together so you wouldn't have to navigate through 5 folders to get all the stuff, but otherwise this has all the original stuff, just recompiled in a much simpler rar file. \n\nThe first nfo was pretty much useless to me, but maybe it makes sense to someone else, so I left it. The nfo file in the subfolder should be more relevant. \n\n\nBasic Instructions:\n\n1- Run Phone_Disk_Setup.exe and install it. It also installs something along the lines of &quot;DokenLibrary,&quot; I assume this is required is let that install too. \n\n2- Run keygen.exe and generate a serial. Copy the serial.\n\n3- Open Phone Disk (or double-click the tray icon if it's already running) and choose File-&gt; Register (I think) and past the serial in here. Nothing new, same thing we've been doing for years.\n\n\nIf this doesn't work for you, sorry. It worked for me, and I felt like sharing it here where everyone could find it easily. So don't go yelling at me about posting useless stuff. Don't use it if it doesn't work. \n\nVirus-free as far as I can tell, with Malwarebytes and MSE. \n\nEnjoy another random upload from me :)","torrent":{"xt":"urn:btih:210a07e0a57c8d397f7a8def1ee2a1dbde20d69e","amp;dn":"Macroplant+Phone+Disk+v1.2.0.3+with+Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"210a07e0a57c8d397f7a8def1ee2a1dbde20d69e","infoHashBuffer":{"type":"Buffer","data":[33,10,7,224,165,124,141,57,127,122,141,239,30,226,161,219,222,32,214,158]},"announce":[],"urlList":[]}}