{"title":"Charles A. Eastman, Indian Heroes and Great Chieftains ebooks [d","uid":8905738,"size":383368,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2198496a9af97073aa38160b32d5ee656f172e92&amp;dn=Charles+A.+Eastman%2C+Indian+Heroes+and+Great+Chieftains+ebooks+%5Bd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dovah12","files":4,"time":1378857646,"description":"Raised as a young Sioux in the 1860s and 1870s, Eastman knew some of the Indian leaders he portrays here in vivid, biographical sketches. Included are Red Cloud, Rain-in-the-Face, Crazy Horse, Sitting Bull, Little Crow, Chief Joseph and 9 more.\n &lt;a href=&quot;\nhttps://www.goodreads.com/book/show/2043784.Indian_Heroes_and_Great_Chieftains&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.goodreads.com/book/show/2043784.Indian_Heroes_and_Great_Chieftains&lt;/a&gt;\n\n\n\nAbout Charles Alexander Eastman\n\n(1858-1939) Charles Alexander Eastman is unique among Indian writers, whether storytellers or oral historians. He was raised traditionally, as a Woodland Sioux, by his grandmother, from 1858 - 1874, until he was 15. He thus gained a thorough first-hand knowledge of the lifeways, language, culture, and oral history.\n\nHis father (thought to have been hanged at Mankato, Minnesota) reappeared and insisted he receive the white man's education. Educated at Dartmouth and Boston University medical school, Eastman became a highly literate physician, who was the only doctor available to the victims of the Wounded Knee massacre in 1890 -- a major historical event, often described as &quot;ending the Indian wars&quot;.\n\nOther Indian writers of this period were either entirely acculturated -- had never lived the traditional life of their people or been educated out of their native knowledge -- or were not literate, and were able to provide only &quot;as told to&quot; materials, through the filters of interpreters and non-Indian writers. Eastman had the lifeways and historical events experiences, and he did not need the literary filters of translators and white anthropologists or collectors.","torrent":{"xt":"urn:btih:2198496a9af97073aa38160b32d5ee656f172e92","amp;dn":"Charles+A.+Eastman%2C+Indian+Heroes+and+Great+Chieftains+ebooks+%5Bd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2198496a9af97073aa38160b32d5ee656f172e92","infoHashBuffer":{"type":"Buffer","data":[33,152,73,106,154,249,112,115,170,56,22,11,50,213,238,101,111,23,46,146]},"announce":[],"urlList":[]}}