{"title":"The Metal Method","uid":4952842,"size":13736419328,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2220dd4f1307d54e3ce33cc6915b6206fcae8678&amp;dn=The+Metal+Method&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"mistic dragon","files":3,"time":1244976371,"description":"Stage One - From The Complete Basic Course\n\nStage One is not challenging because we don't want this to be challenging. It's fun, simple to follow, and very rewarding. Our goal is to have you performing music that until now you've only dreamed about. You can be good enough to play in a band and perform with your friends. You will accomplish this by the end of this course.\n\nThe Stage One DVD is seventy-minutes in length and divided into four lessons. Each lesson is designed to take about a week to accomplish. There are chapter marks located throughout the program to easily find and review any section using your DVD player's remote. Stage One and Stage Two together are equivalent to Level One of The Complete Basic Course. These two programs are a more thorough and an easier approach to learning to play guitar than Level One.\nWhat's Included?\n\n    * An introduction to the course\n    * Special considerations for students under the age of eleven\n    * How to use an inexpensive device to shorten the neck for young guitarists\n    * Course can be mastered with either an acoustic or electric guitar\n    * Advice for purchasing a guitar\n    * New vs. used instrument\n    * Recommendation for how to choose a used instrument\n    * Parts of the guitar identified\n    * How to tune your guitar to another guitar\n    * How to tune your guitar to itself\n    * Electronic tuners\n    * The correct technique for fretting a note\n    * A technique for comfortably reaching notes instead of difficult stretches\n    * Proper picking technique: up, down, and alternate\n    * Seven finger exercises\n    * How to read guitar tablature\n    * Each of the four lessons have stated goals to accomplish before moving on\n    * Motivation: your goals and what you can expect from this course\n    * Open position chords and barre chords explained\n    * Seven chords that can be played using no more than one finger\n    * How to read chord diagrams\n    * Proper fingering\n    * All exercises feature picture-in-picture to view both the fretting and picking hands in close-up detail\n    * All exercises demonstrated at very slow and normal tempos\n    * All exercises include on-screen animated tab so you can follow along as each note is played.\n    * Bonus materials: Extra files on disk for printing a manual and playing along with animated tab files with free software player\n    * Twenty-four chords diagrams in this lesson\n    * How tablature compares to standard notation\n    * How to allow your subconscious to play chords\n    * The barre chord technique. How to effortlessly barre several strings with your index finger to move chords up and down the neck without changing the fingering.\n    * Learn two barre chords to move up and down the neck to play twenty-four different chords keeping the hand shape the same\n    * Learn half of the note names on the guitar\n    * A chapter guide to easily navigate the DVD\n\n\n   \t\nStage Two - From The Complete Basic Course\n\n \n\nAs you probably have learned by now it's not enough to download tab from the Internet and expect to understand the proper way to play it. Playing guitar is much more than just getting your fingers in the right positions. It's about mastering several techniques to create the right sound.\n\nThis doesn't need to be difficult. Once you understand the secret to proper technique, playing guitar becomes quite simple. Proper technique isn't a series of rules that you must follow.\n\nProper technique isn't about &quot;we'll bang your knuckles with a ruler&quot; if you don't do this. It's also not about endless hours of boring study. Proper technique is the simplest way to play guitar and you're not going to learn this without instruction.\n\nThis course is what you've been missing and it will only cost you $14.95 to find out if this is true. If not, return Stage Two for a full refund. That's why we call this risk-free. We've been doing this for twenty-four years so we have confidence in our money-back guarantee. You won't send this back.\n\nThe Stage Two DVD is seventy-minutes in length and divided into four lessons. Each lesson is designed to take about a week to accomplish. There are chapter marks located throughout the program to easily find and review any section using your DVD player's remote.\nWhat's Included?\n\n    * All exercises feature picture-in-picture to view both the fretting and picking hands in close-up detail\n    * 22 exercises played at both slow and normal speeds\n    * Each exercise includes animated play along tab\n    * Three rhythm tracks featuring bass and drums to give you the sound of a live band performance\n    * Dropped D tuning for heavy sounding chords that can be played with only one finger\n    * Each of the four weekly lessons has a listed series of goals\n    * Power chords explained\n    * Pentatonic lead scale and how to use it\n    * Guitar effect demonstration\n    * A technique that makes playing barre chords easy\n    * Three six string barre chords included\n    * A trick for learning all of the note names on the fretboard \n\n\n\nStage Three - From The Complete Basic Course\n\n\nStage Three is the third guitar lesson in the 2007 revision of The Complete Basic Course.\n\nThis DVD has information that both beginner and intermediate guitarists will find useful. Basic techniques like hammer-on, pull-off, and string bend are explained and demonstrated. The five positions of the pentatonic scale are taught featuring fretboard animations. Just sit back, listen, watch, and learn. You'll quickly absorb this information with very little effort. This teaches you to solo in every position of the fretboard.\n\nThe program is divided into four weekly lessons. Each lesson teaches a fourth of a guitar lead that features the techniques taught in the lesson. When Stage 3 is completed you'll not only have mastered these techniques but you will have learned a challenging solo to perform over the guitar, bass, and drum rhythm track. \n\n\nStage Four - From The Complete Basic Course\n\nStage Four is the fourth guitar lesson in the 2007 revision of The Complete Basic Course.\n\nThis DVD has information for all levels of playing experience. Basic techniques are demonstrated - vibrato, vibrato bend, tapping, harmonics, chime harmonics, and string muting. The five positions of the natural minor scale are taught featuring fretboard animations. Just sit back, listen, watch, and learn.\n\nThe program is divided into four weekly lessons. Each lesson teaches a fourth of an instrumental piece that features the techniques taught in the lesson. When Stage Four is completed you'll not only have mastered these techniques but you will have learned a challenging solo to perform over the guitar, bass, and drum rhythm track.\n\nThis solo is a very important part of Stage Four. At first glance, the techniques taught in these lessons are very basic, but the solo is challenging for even an experienced player. It's completely analyzed according to scale, pattern position, and rhythmic phrasing. This should help you to create your own original lead guitar parts. \n\n\n \t\nStage Five - From The Complete Basic Course\n\nStage Five is the fifth guitar lesson in the 2007 revision of The Complete Basic Course. This program places an emphases on improvisation. The lesson begins with a blues improvisation and explains how to use passing chords and improvised lead licks. A very challenging lead is taught in four sections. Several new techniques are covered along with a seven part section explaining &quot;How I practice.&quot; This section also teaches a challenging lead and explains how to improvise using motifs.\n\nThe program closes with a lesson on harmony lead guitar construction. It includes several exercises include bass and drum rhythm tracks to give you the experience of jamming with a band.\n\nAlthough this program is designed to be accomplished in a month, it will probably take much longer because this one is challenging even for experienced players.\n\n\nStage Six - From The Complete Basic Course\nThis program explains a practical way to apply music theory to rock guitar. Everything that is discussed here is taught in a way that enables even a beginner to fully understand everything.\n\nThere are no complicated playing exercises. This is about concepts, not technique. The animated fretboard diagrams simply explain what you've been missing. Even though this is &quot;Stage Six&quot; its highly recommended for all levels of playing experience. Think of this as the missing link. It will give you the understanding necessary to play by ear and create your own music. Now you'll know what scale to use for lead riffs with any chord progression. When you're copying a song you'll know which seven chords you have to choose from.\n\nThe great thing about this program is, you don't need self-discipline or incredible playing skills to understand everything that is explained here. Just sit back, watch, listen, and learn. The animated diagrams solve the mystery of the fretboard. You don't need to study hard to understand this because it's actually a simple concept that will unlock your creativity.\n\nMany rock guitarists in successful bands don't have a clear understanding of what you're about to learn. That's not necessarily a bad thing. It's possible to be very creative without understanding music theory. On the other hand, many guitarists who are highly technical often have a problem being creative. Of course the best approach is a balance between art and science and that's what you're going to learn.\n\nSo how will this lesson affect your ability to play guitar? You probably know musicians who can hear a song and instantly start to play along without guitar tab. They hear the chords or melody and just start playing. They can also play a lead to just about anything. This appears to be either magic or a special talent. It's neither, it can be learned and that's what you'll experience.\n\nOnce you've mastered &quot;Stage Six&quot; you'll have a whole new understanding of your favorite songs. You'll have a huge library of melodic possibilities without learning any new patterns. You just need to make a slight adjustment to your approach and this will open up a whole new world of musical expression without a great deal of effort on your part. If you're already an experienced player this will put what you already know in perspective. This lesson is not about technique, it's about concepts. It's important information that every guitarist needs to understand to fully realize their potential.\n\nThis program will take only one hour to view from beginning to end. If this one hour experience doesn't make a huge difference in your guitar playing ability, please.... send it back for a refund. You won't because this is what you've been missing.\nStage Six DVD for all levels of playing experience.\n\n\n\nI will in time be uploading this as an AVI format soon\n\nEnjoy \n\nMisticDragon","torrent":{"xt":"urn:btih:2220dd4f1307d54e3ce33cc6915b6206fcae8678","amp;dn":"The+Metal+Method","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2220dd4f1307d54e3ce33cc6915b6206fcae8678","infoHashBuffer":{"type":"Buffer","data":[34,32,221,79,19,7,213,78,60,227,60,198,145,91,98,6,252,174,134,120]},"announce":[],"urlList":[]}}