{"title":"British Butt Search (UK) (1995)","uid":14483727,"size":474670789,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:223eab9d720185e90ea60317ba9ac421eafe1b4d&amp;dn=British+Butt+Search+%28UK%29+%281995%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1462047707,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=7299166359\r\n \nhttp://imagedisco.net/?g=2858792125\r\n\r\n\r\nPlot:\r\n\r\nBen Dover's British Butt Search is a classic early Ben Dover release. As usual, Ben is beating the bushes in Britain, searching for more English muffins to tease and please his worldwide audiences. And once again he comes through with some seriously searing sequences. This one is especially noteworthy due to the fact that it features one of Nici Sterling's very first performances. Calling herself Sophie Clark, Nici steams her way through an awe-inspiring lingerie show before getting down and dirty with off-screen beau Mike (now known to porn audiences as Wilde Oscar). Ben even manages to squeeze into the amorous action later on, making sure that he gets a taste of the lascivious loving that Nici's since become so well-known for. There's plenty more to recommend this bodacious butt search, though, including a jaw-dropping lesbian opener between naturally curvaceous blonde beauty Wendy (Sarah Daniel) and hot-to-trot brunette cutie Gail (Gilly Sampson). Vivacious Marina turns in a pair of hot scenes, first engaging in a little self-help before taking on Mario in a frantic, multi-position workout. Ben has honed his approach a bit since the 1995 debut of Ben Dover's British Butt Search, but for sheer unbridled sexing, he's rarely done any better than this","torrent":{"xt":"urn:btih:223eab9d720185e90ea60317ba9ac421eafe1b4d","amp;dn":"British+Butt+Search+%28UK%29+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"223eab9d720185e90ea60317ba9ac421eafe1b4d","infoHashBuffer":{"type":"Buffer","data":[34,62,171,157,114,1,133,233,14,166,3,23,186,154,196,33,234,254,27,77]},"announce":[],"urlList":[]}}