{"title":"Heat Pipe Design and Technology - A Practical Approach","uid":12615185,"size":12138992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2262e782a6d93d1ac2c5f2c26945cb1da6148818&amp;dn=Heat+Pipe+Design+and+Technology+-+A+Practical+Approach&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1445511202,"description":"Heat Pipe Design and Technology - A Practical Approach - Bahman Zohuri (CRC, 2011).pdf\r\n\r\nISBN 9781439845233\r\n\r\nWith its unique ability to transfer heat over large distances with minimal loss, the heat pipe has emerged as a proven environmentally friendly, energy-saving solution for passive thermal control. However, until recently, the high cost and complex construction use of these marvelous mechanisms has generally limited their use to space technology.\r\n\r\nWritten by a former senior chief scientist at Lockheed who has also worked for Westinghouse and the U.S Air Force, Heat Pipe Design and Technology: A Practical Approach provides a practical study of modern heat pipe engineering in nuclear and solar energy applications, discussing how it can be optimized and made more cost-effective for use on a wider scale. An introduction to operational and design principles, this book explores the use of heat pipes, particularly in high-heat flux applications and in situations in which there is any combination of non-uniform heat loading, limited airflow over the heat generating components, and space or weight constraints. It also discusses design and application of self-controlled, variable-conductance heat pipes for thermal control in spacecraft.\r\n\r\nOffering a review of heat and mass transfer theory relevant to performance, the book covers issues that can affect successful heat pipe operation, including:\r\n\r\nBalancing of heat pipe loads\r\nCompatibility of materials\r\nOperating temperature range\r\nPower limitations\r\nThermal resistance\r\nOperating orientation\r\nWith its presentation of mathematical models to calculate heat transfer limitations and temperature gradient of both high- and low-temperature heat pipes, the book compares calculated results with the available experimental data from various sources to increase confidence in existing models. It also explains where and how readers can access helpful interactive computer codes and a series of computer programs developed by the author to support presented data, aid design, and predict performance","torrent":{"xt":"urn:btih:2262e782a6d93d1ac2c5f2c26945cb1da6148818","amp;dn":"Heat+Pipe+Design+and+Technology+-+A+Practical+Approach","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2262e782a6d93d1ac2c5f2c26945cb1da6148818","infoHashBuffer":{"type":"Buffer","data":[34,98,231,130,166,217,61,26,194,197,242,194,105,69,203,29,166,20,136,24]},"announce":[],"urlList":[]}}