{"title":"The Superspecial Film-Torrent-Container by ryba777","uid":6513673,"size":1358151,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:22a2f36a38d3d8a7d3d52d2fc7890b12395bf864&amp;dn=The+Superspecial+Film-Torrent-Container+by+ryba777&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"naba888","files":58,"time":1309733286,"description":"The Superspecial Film-Torrent-Container by ryba777\n\nI've seen some awe-inspiring films containing highly relevant information I wanted to share with you I've decided to upload a small collection of .torrent-files linking to these films. I have been watching many movies and I certainly won't waste your time by recommending superfluous films to you. I know that many of you are on a high-value-level here being well aware that life is simply too short to be wasted by second class movies. I've spent too much of my precious time with useless cinematic crap and I certainly don't want you to make the same mistake. Every second of your life will exist only once, and once it's gone it will be gone forever. In retrospect I can say with confidence that only perhaps one out of twenty movies has been worth watching. These films mainly relate to conspiracy, altered states of consciousness, spiritual evolution and mind control under a dystopian new world order. Some of these torrents appear several times for the same film since they have different file size, trackers and numbers of seeders. I've only chosen torrents that actually work, and most of them have been tested. Some of these films are rare and with few seeders and it may be difficult leeching them but you can still buy, yes BUY (!) them.\n\nThe french film 'The Pier - La Jetee (1962)' and 'The Sacrifice (1986)' by Tarkovsky are particularly deep and interesting.\n\nFiles: many .torrent files\n","torrent":{"xt":"urn:btih:22a2f36a38d3d8a7d3d52d2fc7890b12395bf864","amp;dn":"The+Superspecial+Film-Torrent-Container+by+ryba777","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22a2f36a38d3d8a7d3d52d2fc7890b12395bf864","infoHashBuffer":{"type":"Buffer","data":[34,162,243,106,56,211,216,167,211,213,45,47,199,137,11,18,57,91,248,100]},"announce":[],"urlList":[]}}