{"title":"The Walking Dead - SE 3","uid":15806217,"size":10705314893,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2356572caab4103ffafcaa5120796783c9c57028&amp;dn=The+Walking+Dead+-+SE+3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":33,"time":1473559211,"description":"Description\r\n\r\n\r\nThe Walking Dead - Season 3\r\n\r\nPlot[edit]\r\nEight months after abandoning the Greene farmstead, Rick leads his near-term wife Lori and the other survivors to a large prison complex. They systematically clear it of walkers, though are forced to amputate Hershel's foot when he is bitten by a walker. They encounter a group of surviving prisoners Rick is highly distrustful of, and kills their leader and abandons another, Andrew, when they try to assassinate him. Andrew, bitter, leads a group of walkers to a breach in the prison's fence, infesting the prison at the same time Lori enters labor while T-Dog sacrifices himself to save Carol just after getting bitten. Maggie is forced to perform a caesarean section to deliver the child which kills Lori; Carl is forced to shoot Lori to prevent her reanimating, and Rick, after killing Andrew and the walkers, is devastated by the loss. Rick starts to have visions of Lori, and the rest of the group question his leadership abilities.\r\n\r\nMeanwhile, Andrea, separated from Rick's group after fleeing the farmstead, has befriended Michonne as they travel. The two are captured by Merle, Daryl's brother who survived being stranded in Atlanta by Rick. Merle takes them to Woodbury, a small fortified community of survivors led by the Governor. Though welcomed by the community, they are appalled at the Governor's ruthlessness, sending his men to kill other survivor camps to gain their supplies, and learn that the Governor is bitter over the loss of his family, keeping the reanimated body of his daughter Penny locked up. Michonne urges Andrea to leave with her, but Andrea is exhausted from the last eight months and stays behind to try to convince the Governor to change his ways while confiding with his assistant Milton on his dangerous personality","torrent":{"xt":"urn:btih:2356572caab4103ffafcaa5120796783c9c57028","amp;dn":"The+Walking+Dead+-+SE+3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2356572caab4103ffafcaa5120796783c9c57028","infoHashBuffer":{"type":"Buffer","data":[35,86,87,44,170,180,16,63,250,252,170,81,32,121,103,131,201,197,112,40]},"announce":[],"urlList":[]}}