{"title":"Information Assurance Architecture {BBS}","uid":7386891,"size":9986987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23dbc32ff62610e0a1e81a23fe8b62fae7508049&amp;dn=Information+Assurance+Architecture+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1340658593,"description":"\n\nNow that information has become the lifeblood of your organization, you must be especially vigilant about assuring it. The hacker, spy, or cyber-thief of today can breach any barrier if it remains unchanged long enough or has even the tiniest leak. In Information Assurance Architecture, Keith D. Willett draws on his over 25 years of technical, security, and business experience to provide a framework for organizations to align information assurance with the enterprise and their overall mission.\n\nThe Tools to Protect Your Secrets from Exposure\n\nThis work provides the security industry with the know-how to create a formal information assurance architecture that complements an enterprise architecture, systems engineering, and the enterprise life cycle management (ELCM). Information Assurance Architecture consists of a framework, a process, and many supporting tools, templates and methodologies. The framework provides a reference model for the consideration of security in many contexts and from various perspectives; the process provides direction on how to apply that framework. Mr. Willett teaches readers how to identify and use the right tools for the right job. Furthermore, he demonstrates a disciplined approach in thinking about, planning, implementing and managing security, emphasizing that solid solutions can be made impenetrable when they are seamlessly integrated with the whole of an enterprise.\n\nUnderstand the Enterprise Context\n\nThis book covers many information assurance subjects, including disaster recovery and firewalls. The objective is to present security services and security mechanisms in the context of information assurance architecture, and in an enterprise context of managing business risk. Anyone who utilizes the concepts taught in these pages will find them to be a valuable weapon in the arsenal of information protection.\n\n\n\nHardcover: 624 pages\nPublisher: Auerbach Publications; 1 edition (June 24, 2008)\nLanguage: English\nISBN-10: 0849380677\nISBN-13: 978-0849380679","torrent":{"xt":"urn:btih:23dbc32ff62610e0a1e81a23fe8b62fae7508049","amp;dn":"Information+Assurance+Architecture+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23dbc32ff62610e0a1e81a23fe8b62fae7508049","infoHashBuffer":{"type":"Buffer","data":[35,219,195,47,246,38,16,224,161,232,26,35,254,139,98,250,231,80,128,73]},"announce":[],"urlList":[]}}