{"title":"What Makes the Great Great","uid":8246026,"size":2154588,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2404c0abcdd58fdbe02a4dcd8df3ac07b7862c04&amp;dn=What+Makes+the+Great+Great&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1363059102,"description":"Dennis Kimbro, &quot;What Makes the Great Great&quot;\nISBN: 038548268X, 0385483961 | 1998 | EPUB\n\nIn What Makes the Great Great, Dennis Kimbro, author of the bestselling Think and Grow Rich: A Black Choice, introduces inspiring people who have achieved greatness in their own unique way, then highlights those qualities each of us must develop before we reach our full potential. Regardless of how you define greatness--whether it's success in business or in pursuing a personal goal--this book provides a proven approach to turning your dreams into reality.\n\nPart pep rally, part how-to book, What Makes the Great Great combines practical advice with pearls of wisdom from some of today's most successful African Americans, including John H. Johnson, publisher of Ebony magazine; Condoleeza Rice, provost of Stanford University; and Ann Fudge, president of Maxwell House Coffee.\n\nThrough dozens of interviews and inspirational stories, Dr. Kimbro outlines the nine strategies that determine success. Greatness is guaranteed when you discover life's true calling, live more courageously, access the knowledge and creativity of your mind, and embrace integrity in everything you do. But Kimbro also underscores the importance of devoting yourself to the work you love, discovering your own inner worth, acquiring habits of persistence, developing deeper spiritual awareness, and finally, leaving a legacy for future generations.","torrent":{"xt":"urn:btih:2404c0abcdd58fdbe02a4dcd8df3ac07b7862c04","amp;dn":"What+Makes+the+Great+Great","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2404c0abcdd58fdbe02a4dcd8df3ac07b7862c04","infoHashBuffer":{"type":"Buffer","data":[36,4,192,171,205,213,143,219,224,42,77,205,141,243,172,7,183,134,44,4]},"announce":[],"urlList":[]}}