{"title":"The Forgotten 1x01 HDTV DVB Spanish","uid":5167115,"size":622009068,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:262548e74ade53430ee8b3b4f8a476155c11a708&amp;dn=The+Forgotten+1x01+HDTV+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":2,"time":1258473217,"description":"Del productor ejecutivo Jerry Bruckheimer (CSI) llega una nueva serie dramÃƒÂ¡tica sobre un grupo de detectives amateurs, miembros de The Forgotten Network, que intentan reconstruir las piezas de aquellos casos que fueron descartados por falta de evidencia.\n\nLuego de que la policÃƒÂ­a se rinde, este grupo, liderado por Alex Donovan (Christian Slater), primero debe resolver el misterio de la identidad de la vÃƒÂ­ctima para poder atrapar al culpable. Estos ciudadanos resuelven crÃƒÂ­menes extraordinarios, y su persistencia y compasiÃƒÂ³n los pone en un viaje emocional para devolver sus nombres a los muertos.\n\nEl nuevo recluta Davies descubrirÃƒÂ¡ que cada uno de los miembros tiene una razÃƒÂ³n para pertenecer al grupo, incluyendo a Donovan, que es un ex-policÃƒÂ­a cuya hija fue secuestrada y nunca encontrada.\n\nLinda Manning, la mujer que maneja el grupo desde su hogar, es una reclusa virtual cuyo esposo es un asesino encarcelado. Walter Bailey se encarga de las investigaciones. Candace Butler odia su trabajo pero tiene un gran talento para tranquilizar a las personas, y Tyler es un talentoso escultor con experiencia forense.\n\nJunto a Slater, The Forgotten cuenta con la participaciÃƒÂ³n de Heather Stephens (Lindsey Drake), Michelle Borth (Candace Butler), Anthony Carrigan (Tyler Davies), Bob Stephenson (Walter Bailey) y Rochelle Aytes (Grace Russell).","torrent":{"xt":"urn:btih:262548e74ade53430ee8b3b4f8a476155c11a708","amp;dn":"The+Forgotten+1x01+HDTV+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"262548e74ade53430ee8b3b4f8a476155c11a708","infoHashBuffer":{"type":"Buffer","data":[38,37,72,231,74,222,83,67,14,232,179,180,248,164,118,21,92,17,167,8]},"announce":[],"urlList":[]}}