{"title":"Il Segreto di Evita (Eva Peron DOC SatRip XviD Ita) TNT Village","uid":13942539,"size":367923200,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:26e624b1b92a59972d80f5ac0a59fdb11f642425&amp;dn=Il+Segreto+di+Evita+%28Eva+Peron+DOC+SatRip+XviD+Ita%29+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":1,"time":1458476708,"description":"Il Segreto di Evita (Eva Peron) [SatRip XviD Ita] TNT Village\r\n\r\n.: Release Originale :.\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=172982\r\n\r\nUn anno dopo, il 9 giugno del ‘47 Evita fa un viaggio in Europa e sbarca a Madrid: tutti vengono colpiti dalla sua bellezza e dalla sua eleganza anche se non sfuggono i difetti come l’essere sempre in ritardo e la sua impreparazione politica nonché le sue gaffe. Evita arriva in un’Europa ancora disastrata dalla guerra, promettendo navi cariche di grano provenienti dall’Argentina affermando che era giusto dividere le loro spighe con i fratelli spagnoli. Dopo la Spagna Evita (vestita per l’occorrenza come la vergine Maria) visita il Papa e De Gasperi a Roma e poi si reca in Francia, Belgio e Svizzera.\r\nTale viaggio, programmato per durare tre settimane, si protrasse in realtà per tre mesi, durante i quali, agli impegni ufficiali si affiancarono anche contatti privati. Gli oppositori di Peron, infatti, insinuarono che Eva avesse incontrato in Svizzera alcuni banchieri per discutere dei propri conti bancari aperti in quel Paese e, in Germania, dei gerarchi nazisti. Non mancarono contestazioni anche dure: l'automobile scoperta sulla quale Eva viaggiava fu bersagliata da un lancio di pomodori. Il viaggio di ritorno in Argentina si svolse in nave, annullando all'ultimo momento il volo aereo per timore di attentati. Al ritorno in patria, nonostante le ombre proiettate sul viaggio in Europa, Eva fu accolta trionfalmente, come la paladina della nuova Argentina nel mondo.\r\nSecondo delle ipotesi Eva Peron, sarebbe stata un'accanita paladina dei criminali di guerra nazisti ricercati dalla giustizia. L'America Latina e' stata per decenni una delle destinazioni principali dei criminali di guerra nazisti fuggiti dall'Europa del dopoguerra, trovavano infatti rifugio in Paesi come Paraguay, Bolivia, Cile e soprattutto Argentina peronista. Si ipotizza che il viaggio di Evita sia servito per organizzare e offrire ospitalità ai nazisti in fuga con i beni accumulati durante la guerra e occultati nelle banche europee, soprattutto svizzere.\r\nSuccessivamente al viaggio in Europa, Eva Peron fece costruire ospedali, scuole, case per i più poveri, etc Dalle sue mani passarono milioni di dollari dell'epoca, questo non fece che rafforzare le accuse che vedevano nel viaggio in Europa di Evita, uno fine occulto nascosto.\r\n\r\n\r\n========================================\r\n\r\n.: Dati tecnici del file :.\r\n\r\nNome..............: Il segreto di Evita.avi\r\nDimensione........: 350 MB (or 359,300 KB or 367,923,200 bytes)\r\nDurata............: 00:51:41 (77,520 fr)\r\nVideo Codec.......: XviD\r\nVideo Bitrate.....: 815 kb/s\r\nRisoluzione.......: 560x320 (1.75:1) [=7:4]\r\nFPS (Frames/sec)..: 25.000\r\nQF (Frame quality): 0.182 bits/pixel\r\nAudio Codec.......: 0x0055(MP3) ID'd as MPEG-1 Layer 3\r\nAudio Bitrate.....: 128 kb/s (64/ch, stereo) CBR\r\nFreq Audio........: 48000 Hz","torrent":{"xt":"urn:btih:26e624b1b92a59972d80f5ac0a59fdb11f642425","amp;dn":"Il+Segreto+di+Evita+%28Eva+Peron+DOC+SatRip+XviD+Ita%29+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26e624b1b92a59972d80f5ac0a59fdb11f642425","infoHashBuffer":{"type":"Buffer","data":[38,230,36,177,185,42,89,151,45,128,245,172,10,89,253,177,31,100,36,37]},"announce":[],"urlList":[]}}