{"title":"Dan Collins - In Foreign Fields (mobi + epub)","uid":7887373,"size":2773895,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27979317b13e7862baeda94b1c785d62049b54fd&amp;dn=Dan+Collins+-+In+Foreign+Fields+%28mobi+%2B+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kevinkray","files":-1,"time":1354647958,"description":"If you only read one book about our troops in Iraq and Afghanistan, read this one.\nA searing, jolting, action-packed series of 25 amazing tales of courage, by medal-winning soldiers, Royal Marines and RAF men in their own words.\nThese are the bravest of the brave, a collection of modest, honest, proud Brits who showed true grit when it mattered most.\n\nSgt Chris Broome CGC saved the life of Pte Johnson Beharry VC and others, and led his bayonet-wielding men in charges on heavily-defended enemy positions.\n\nSgt Terry Bryan CGC and his multiple were ambushed and fought a running battle through the streets of Basra for 45 minutes, pursued by hundreds of insurgents. They kicked their way into a house and held a mob of 200 at bay for three hours... until they were rescued by a QRF including Cpl Terry Thomson CGC. The QRF lost a man of their own and battled their way through to Bryan and his men with amazing bravery.\n\nCSgt Matt Tomlinson CGC RM and Cpl Shaun Jardine CGC ran straight towards men with machine guns, ignoring a hail of fire to kill their attackers.\n\nPte Michelle Norris MC climbed up onto the top of a Warrior armoured vehicle, in the middle of a huge firefight, to save the life of her sergeant. Around 60 rounds were fired at her, some clipping her webbing or hitting the vehicle two inches from her body. (She remains the only woman to win the Military Cross.)","torrent":{"xt":"urn:btih:27979317b13e7862baeda94b1c785d62049b54fd","amp;dn":"Dan+Collins+-+In+Foreign+Fields+%28mobi+%2B+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27979317b13e7862baeda94b1c785d62049b54fd","infoHashBuffer":{"type":"Buffer","data":[39,151,147,23,177,62,120,98,186,237,169,75,28,120,93,98,4,155,84,253]},"announce":[],"urlList":[]}}