{"title":"No Doubt - Don't Speak","uid":4672779,"size":175253508,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:28911aab90d0461d0d97217a2a5ff107588f8626&amp;dn=No+Doubt+-+Don%5C%27t+Speak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1232796423,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Don't Speak&quot; is the third single from Tragic Kingdom, the third album by Californian rock band No Doubt, released in 1996.\n\nDespite the song's popularity, &quot;Don't Speak&quot; did not chart on the Billboard Hot 100 (as rules of the times required commercial singles for charting and one was not issued for the song), but it did reach number one on the Billboard Hot 100 Airplay and stayed for sixteen weeks. The song also reached number one in the UK, New Zealand, Netherlands, and Australia. The single is No Doubt's most successful international single, propelling them to superstardom. &quot;Don't Speak&quot; is arguably No Doubt's biggest hit and was nominated for the Song of the Year and Best Pop Performance By A Duo Or Group With Vocal at the Grammy Awards of 1998.\n\nThe song was ranked at number 495 in Blender magazine's &quot;The 500 Greatest Songs Since You Were Born&quot;.\n\nBefore the music starts, at the beginning of the video, there is a scene of Tony Kanal picking a rotten orange from a Christmas tree (these scenes are usually cut out when VH1 airs this video).\n\nThe majority of the music video for &quot;Don't Speak&quot; takes place in a garage as the band plays. (The dress that Gwen wore was used vintage dark blue with white polkadots which she claimed she bought for less than 10 dollars in a second-hand store. In many of the shots, the dress looked black. In the live scenes she wore the tight tank top w/ the black pants and clogs along with a mix of Indian jewlery and other retro bangles.)\n\nOther scenes tell the story of how the media mainly focused on Gwen while the band was always in the background. The second half of the video features snippets of live footage filmed during the band's performance with Dog Eat Dog and Goldfinger at Roseland Ballroom in New York City on August 21, 1996.\n\nThe video ends with Kanal replacing the orange in the tree, which is actually footage of Tony in reverse pulling the orange off.\n\nThe music video won the award for Best Group Video and was nominated for the Video of the Year award at the 1997 MTV Video Music Awards.\n\nThe video features Pat Smear playing guitar with Tom Dumont during the black and white scene (right before the guitar solo).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:28911aab90d0461d0d97217a2a5ff107588f8626","amp;dn":"No+Doubt+-+Don%5C%27t+Speak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28911aab90d0461d0d97217a2a5ff107588f8626","infoHashBuffer":{"type":"Buffer","data":[40,145,26,171,144,208,70,29,13,151,33,122,42,95,241,7,88,143,134,38]},"announce":[],"urlList":[]}}