{"title":"CLASSIC Ghost.Monster.Mystery.AVI.movies.Halloween","uid":3543054,"size":2821462912,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:289464559d4627aed74d5eeb74ea5ad83be78b54&amp;dn=CLASSIC+Ghost.Monster.Mystery.AVI.movies.Halloween&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dahulk12","files":4,"time":1161384385,"description":"Four CLASSIC Ghost/Monster/Mystery movies:\n\n1. ABBOTT AND COSTELLO MEET FRANKENSTEIN\n2. THE GHOST BREAKERS -BOB HOPE\n3. THE GHOST AND MR. CHICKEN -DON KNOTTS\n4. THE PRIVATE EYES -TIM CONWAY AND DON KNOTTS\n\n1.ABBOTT AND COSTELLO MEET FRANKENSTEIN ((1948) http://www.imdb.com/title/tt0040068/\n\nTwo hapless frieght handlers find themselves encountering Dracula, the Frankenstein Monster and the Wolf Man.\n\nAVI = 1 hour 22 minutes, BLACK AND WHITE, 697 MB, MP3 audio, DivX 6 PRO encode\n\n2. THE GHOST BREAKERS -BOB HOPE (1940) http://www.imdb.com/title/tt0032520/\n\nMary Carter inherits her family\\&amp;#039;s ancestral home, located on a small island off Cuba, and, despite warnings and death threats, decides to take possesion of the reputedly haunted castle. She is joined by radio broadcaster Larry Lawrence who, believing he has killed a mob gunsel, flees New York with his butler, Alex. Once on the island the threesome enter the eerie castle and after viewing the ghost of one of Mary\\&amp;#039;s ancestors and fighting off a menacing zombie, they find the key to the castle\\&amp;#039;s treasure but are interrupted by an all-too-human foe.\n\nAVI = 1 hour 24 minutes, BLACK AND WHITE, 697 MB, MP3 audio, DivX 6 PRO encode\n\n3.THE GHOST AND MR. CHICKEN (1966) http://www.imdb.com/title/tt0059221/\n\nLuther Heggs is a jerky, quirky typesetter for the town paper who aspires to move up from his basement office to be a full-fledged reporter. He also pines for town babe Alma, who\\&amp;#039;s already seeing the newspaper\\&amp;#039;s main writer, Ollie. The film is centered around the Old Simmons House, which is known as a \\&quot;murder house\\&quot; around town due to the murder/suicide of Mr. and Mrs. Simmons 20 years earlier. Rumor has it that you can hear the ghost of Mr. Simmons playing the organ at midnight. To boost newspaper sales, Luther is assigned to spend the night in the house on the night of the 20th anniversary of the murders. All is well until midnight, when Luther sees the old organ begin to play by itself (the film\\&amp;#039;s title tune is used in this and other scenes). His story makes him the town hero until Nicholas Simmons, nephew of the deceased couple, sues Luther for libel. In the courtroom, Luther is made to look the fool, but the judge orders the courtroom to the Simmons House at midnight to allow Luther to prove his story. Nothing happens, of course, but after everyone except Luther leaves, the old organ begins to play and he finds...\n\nAVI = 1 hour 29 minutes widescreen, COLOR, 700 MB, MP3 audio, DivX 6 PRO encode\n\n4. THE PRIVATE EYES -TIM CONWAY AND DON KNOTTS (1981) http://www.imdb.com/title/tt0081376/\n\nThis spoof of the Sherlock Holmes stories finds Inspector Winship and Dr. Tart investigating a strange death in a possibly haunted mansion, while dealing with the beautiful heiress and the crazed staff which live therein.\n\nAVI = 1 hour 30 minutes, COLOR, 594 MB, MP3 audio, DivX 6 encode\n\n\n   These movies are humorous American CLASSICS and the DVDs are getting harder to find, so...ENJOY!\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:289464559d4627aed74d5eeb74ea5ad83be78b54","amp;dn":"CLASSIC+Ghost.Monster.Mystery.AVI.movies.Halloween","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"289464559d4627aed74d5eeb74ea5ad83be78b54","infoHashBuffer":{"type":"Buffer","data":[40,148,100,85,157,70,39,174,215,77,94,235,116,234,90,216,59,231,139,84]},"announce":[],"urlList":[]}}