{"title":"Dearly Devoted Dexter - Jeff Lindsay-viny","uid":6408207,"size":719218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2957d5a4149023f312b3b2a4bbc8ed40957dd5de&amp;dn=Dearly+Devoted+Dexter+-+Jeff+Lindsay-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1305885278,"description":"Dearly Devoted Dexter - Jeff Lindsay-viny\n\n&quot;Dexter Morgan has been under considerable pressure. It's just not easy being an ethical serial killer - especially while trying to avoid the unshakable suspicions of the dangerous Sergeant Doakes (who believes Dexter is a homicidal maniac ... which, of course, he is). In an attempt to throw Doakes off his trail, Dexter has had to slip deep into his foolproof disguise. While not working as a blood-spatter analyst for the Miami Police Department, he now spends nearly all his time with his cheerful girlfriend, Rita, and her two children, sipping light beer and slowly becoming the world's first serial couch potato. But how long can Dexter play Kick the Can instead of Slice the Slasher? How long before his Dark Passenger forces him to drop the charade and let his inner monster run free?&quot; In trying times, opportunity knocks. A particularly nasty psychopath is cutting a trail through Miami - a man whose twisted technique leaves even Dexter speechless. As Dexter's dark appetite is revived, his sister, Deborah (a newly minted, tough-as-nails Miami detective), is drawn headlong into the case. It quickly becomes clear that it will take a monster to catch a monster - but it isn't until his archnemesis is abducted that Dex can finally throw himself into the search for a new plaything. Unless, of course, his plaything finds him first.","torrent":{"xt":"urn:btih:2957d5a4149023f312b3b2a4bbc8ed40957dd5de","amp;dn":"Dearly+Devoted+Dexter+-+Jeff+Lindsay-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2957d5a4149023f312b3b2a4bbc8ed40957dd5de","infoHashBuffer":{"type":"Buffer","data":[41,87,213,164,20,144,35,243,18,179,178,164,187,200,237,64,149,125,213,222]},"announce":[],"urlList":[]}}