{"title":"Lifetime Nutritional Influences on Cognition, Behaviour and Psyc","uid":15320080,"size":4238133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2966b1ea0687854f7558bbbea8101a69b8154744&amp;dn=Lifetime+Nutritional+Influences+on+Cognition%2C+Behaviour+and+Psyc&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468633132,"description":"Lifetime Nutritional Influences on Cognition, Behaviour and Psychiatric Illness - David Benton (WP, 2011).pdf\r\n\r\nISBN 978-1-84569-752-5\r\n\r\nThe influence of nutrition on cognition and behaviour is a topic of increasing interest. Emerging evidence indicates that nutrition in early life can influence later mental performance and that diet in later life can reduce cognitive decline. Lifetime nutritional influences on cognition, behaviour and psychiatric illness reviews the latest research into the effects of nutrition on cognition and behaviour across the lifespan and on psychiatric illness.\r\n\r\nPart one investigates nutritional influences on brain development and cognition including the effects of early diet and the impact of key dietary consistuents including long-chain polyunsaturated fatty acids and iron. Part two explores the link between diet, mood and cognition discussing carbohydrate consumption, mood and anti-social behaviour, hydration and mental performance and the neurocognitive effects of herbal extracts, among other topics. Part three examines nutritional influences on behavioural problems, psychiatric illness and cognitive decline, including the role of nutrition in attention deficit hyperactivity disorder, vitamin status and psychiatric disorders, antioxidants and dementia, and depression, suicide and fatty acids.\r\n\r\nWith its distinguished editor and international team of expert contributors, Lifetime nutritional influences on cognition, behaviour and psychiatric illness is a valuable reference tool for researchers working on the effects of diet on the brain in both academia and industry and may also appeal to dieticians and nutritionists.\r\n\r\nReviews the latest research into the effects of nutrition on cognition and behaviour across the lifespan and on psychiatric illness\r\nExplores the link between diet, mood and cognition discussing carbohydrate consumption, mood and anti-social behaviour\r\nExamines nutritional influences on behavioural problems, psychiatric illness and cognitive decline","torrent":{"xt":"urn:btih:2966b1ea0687854f7558bbbea8101a69b8154744","amp;dn":"Lifetime+Nutritional+Influences+on+Cognition%2C+Behaviour+and+Psyc","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2966b1ea0687854f7558bbbea8101a69b8154744","infoHashBuffer":{"type":"Buffer","data":[41,102,177,234,6,135,133,79,117,88,187,190,168,16,26,105,184,21,71,68]},"announce":[],"urlList":[]}}