{"title":"2005 - Choice Picks (Lossless)","uid":7036937,"size":391642554,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:29715e7171e206f96c30ac228799ba22a978556b&amp;dn=2005+-+Choice+Picks+%28Lossless%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tohaxxx22","files":-1,"time":1329416892,"description":"By 2004, The Rembrandts had produced four albums and a handful of Top 40 hits, including the two smashes Just The Way It Is, Baby &amp; I\\\\\\'ll Be There For You. Although the duo was spending more time on solo projects, they continued to tour and record music. The next logical step was trying to release a collection of their best work. For a couple years, Phil &amp; Danny tried to work with their former label to release such a collection, but with no success. With the major labels being consolidated and\nreshuffled, The Rembrandts faced quite a bit of red tape if they were ever to see a best of album. So rather than wait around, Phil &amp; Danny went back into the studio to re-record a full length \\\\\\'best of album\\\\\\' called Choice Picks. Of course, the re-recordings presented a few problems from the get go. In many cases, the songs that had been played live thousands of times had taken on a new sound over the years---but The Rembrandts wanted to get the songs as close to the original records as possible. In most cases on Choice Picks, it works. The hits , in particular, are right on. \\\\\\'Baby\\\\\\' and \\\\\\'I\\\\\\'ll Be There For You\\\\\\' hit the mark, while Someone and Rollin\\\\\\' Down The Hill have a renewed freshness. Johnny Have You Seen Her manages to stay true to the original, while capturing some of the energy from the live performances. A couple of the slower numbers don\\\\\\'t quite match up to the orginals, and it might have been more interesting to hear acoustic versions of Chase The Clouds Away and Drowning In Your Tears. Still there\\\\\\'s enough on Choice Picks that does work that makes it a great starting place for new fans and an interesting listen for longtime fans. Just getting the new track Don\\\\\\'t Give Me Up is nearly worth the price of admission alone. Of course, the following year, Rhino finally released The Rembrandts Greatest Hits.\n\nThe Rembrandts - Choice Picks 2005\n(Fuel Records)\n\n[04:09] 01. The Rembrandts - Just The Way It Is, Baby\n[03:45] 02. The Rembrandts - Someone\n[03:10] 03. The Rembrandts - Show Me Your Love\n[03:29] 04. The Rembrandts - Burning Timber\n[04:17] 05. The Rembrandts - Johnny Have You Seen Her\n[04:31] 06. The Rembrandts - Maybe Tomorrow\n[04:10] 07. The Rembrandts - Chase The Clouds Away\n[04:21] 08. The Rembrandts - Rollin\\\\\\' Down The Hill\n[03:09] 09. The Rembrandts - I\\\\\\'ll Be There For You\n[04:20] 10. The Rembrandts - Don\\\\\\'t Hide Your Love\n[04:44] 11. The Rembrandts - Drowning In Your Tears\n[03:20] 12. The Rembrandts - This House Is Not A Home\n[03:13] 13. The Rembrandts - Lost Together\n[03:05] 14. The Rembrandts - Don\\\\\\'t Give Me Up","torrent":{"xt":"urn:btih:29715e7171e206f96c30ac228799ba22a978556b","amp;dn":"2005+-+Choice+Picks+%28Lossless%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29715e7171e206f96c30ac228799ba22a978556b","infoHashBuffer":{"type":"Buffer","data":[41,113,94,113,113,226,6,249,108,48,172,34,135,153,186,34,169,120,85,107]},"announce":[],"urlList":[]}}