{"title":"Vangers_Buka(Rus)","uid":4225291,"size":764180198,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2a93ad623413d6fe04cb337bb36f0c93c584138a&amp;dn=Vangers_Buka%28Rus%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Allmass","files":2,"time":1212788869,"description":"Russian only, BUKA.\nCan't really remember the version, 1.01 or so.\n\nVangers is adventure. It's wild races, weird rituals, fights, puzzles and a bit of RPG. But the biggest part of Vangers is something that can't be ranged in a particular genre-exploring the world. Vangers gives the player a unique chance to see a world where legends and tales are all that's left of the human race. Not only see it, but also be a part of it. The Vanger's home is a mechos, and the main goal is survival. Vangers means freedom. Freedom of choice, freedom of intentions, freedom of morals and conscience. From the outset, this weird world will encourage you to do some little things, then something bigger and odder. Every character in the game has their own goals and ways. Every world of the Lost Chain hides surprises. These are parts of some supernatural mystery, or maybe joke of some higher powers. The Vanger will be involved in hold-ups, encounter hired guns, stumble over annoying raffas that always get on the way, and watch discreet couriers passing by. Live rocks will cross the road, and mushrooms and stinkers will try to get their bit off your life. And whatever happens, beebs will crackle under your wheels, adding to your cash.\n\nThe game has a totally different philosophy and values. It oddly attracts with its humor and hostility and disdain towards the player. It starts you thinking and converts you into a Vanger. Vangers teaches you a new language and conditions you to driving mechos, your loyal friend.\n\nAll the worlds in Vangers were created with Surmap A.R.T., K-D Lab's proprietary terrain editor, and the accompanying voxel-polygonal technology. It is features of Surmap that allowed us to create our organic worlds. They look nothing like manually painted models, yet every detail was carefully planned and designed by an artist; there's no randomly generated stuff. All characters are also artist's creations, with the help of Surmap.\n\nThe game offers 10 different worlds for player's quests - 4 basic worlds, inhabited with creatures and having their own laws and 6 secret, small but very odd, places. Every world is unique. Roads and nice views, rivers and lakes, stations and hideouts.\n\nMost of time the player drives their mechos, an agile, speedy - and armed - universal vehicle. The interaction of mechos with the road is recognized, rightfully, as unique by many reviewers. The car bumps and jumps on every bulge and hole, so the driving takes some skills and constant attention. All mechos in Vangers can jump using kinetic impulse and float underwater. With additional devices they can fly, dig into the ground and float on the surface of water.\n\nBesides following the main storyline, the player can opt to do mini-missions - tabutasks. The game has more than 100 such missions. Tabutasks are a means for the Vanger to learn nitty-gritty of the Lost Chain of Worlds and to earn some beebs (money) and Luck, which is kind of important.\n\nThe player will meet some bizarre characters. There are 9 of them in the game, they all have different personalities, and they don't particularly like each other. Every creature has its own attitude. They can answer most of the questions the player may ask and they give some good advice. If you earn their trust, the critters readily tell you where dangers are awaiting.\n\nThe game has 24 different models of mechos, which you can buy, assemble, destroy, smash and scatter over the worlds of Lost Chain. 14 of them are standard models that you can find in stores. They come in all sizes and have a wide range of speeds and payloads. Every model is best suited for some specific purpose. Apart from these, there are 5 unique mechos. Each of them offers some unique feature and gives the Vanger some specific advantage. There are 5 raffas. Those are small and not very prestigious crates, but no Vanger can avoid being put, at least once, into such a midget. They don't drown, by the way.\n\nThe game features lots of miscellaneous gadgetry. There are 13 devices for destroying or disabling the enemy, 4 devices for flying, digging and tracking the target, 10 kinds of goods (3 of which are live creatures), 7 unique artifacts.\n\nFor those who want to condition themselves to be a better Vanger and those who has irrevocably converted into a Vanger, the game offers more joy and fun: multiplayer. Vangers supports multiplayer game over Internet or local network with up to 32 players. There are three modes of multiplayer: Van War (deathmatch), Mechosoma (trade + race) and Passemblos (race through checkpoints on different worlds).\n\nVangers was called one of the most extraordinary and interesting games on the market in 1998 and received the highest appraisal for the quality and concept. In Russia Vangers got the biggest publicity compared to other released titles and gathered a remarkable collection of various awards, including several nominations at the Anigraph'98 International Festival as well as high review ratings. The leading Russian game magazine Game.EXE granted Vangers with titles Action'98 and Twist'98.","torrent":{"xt":"urn:btih:2a93ad623413d6fe04cb337bb36f0c93c584138a","amp;dn":"Vangers_Buka%28Rus%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a93ad623413d6fe04cb337bb36f0c93c584138a","infoHashBuffer":{"type":"Buffer","data":[42,147,173,98,52,19,214,254,4,203,51,123,179,111,12,147,197,132,19,138]},"announce":[],"urlList":[]}}