{"title":"Osho_Bodhidharma The Greatest Zen Master-08.avi","uid":15225102,"size":219838616,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2a9f1f15acd5b806f73b73a486c7bdf81792c02d&amp;dn=Osho_Bodhidharma+The+Greatest+Zen+Master-08.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1467760017,"description":"Bodhidharma: The Greatest Zen Master\r\nChapter #8\r\nChapter title: Everybody has the right to be wrong\r\n8 July 1987 pm in Gautam the Buddha Auditorium\r\nLength: \t115 mins\r\n\r\nBELOVED Bhagwan,\r\n\r\nAMONG SHAKYAMUNI'S TEN GREATEST DISCIPLES, ANANDA WAS FOREMOST IN LEARNING. BUT HE DIDN'T KNOW THE BUDDHA. ALL HE DID WAS STUDY AND MEMORIZE. ARHATS DON'T KNOW THE BUDDHA. ALL THEY KNOW ARE SO MANY PRACTICES FOR REALIZATION, AND THEY BECOME TRAPPED BY CAUSE AND EFFECT. SUCH IS A MORTAL'S KARMA: NO ESCAPE FROM BIRTH AND DEATH. BY DOING THE OPPOSITE OF WHAT HE INTENDED, SUCH PEOPLE BLASPHEME THE BUDDHA. KILLING THEM WOULD NOT BE WRONG. THE SUTRAS SAY, &quot;SINCE ICCHANTIKAS ARE INCAPABLE OF BELIEF, KILLING THEM WOULD BE BLAMELESS, WHILE PEOPLE WHO BELIEVE REACH THE STATE OF BUDDHAHOOD.&quot;      ...PEOPLE WHO SEE THAT THEIR MINDS ARE THE BUDDHA DON'T NEED TO SHAVE THEIR HEADS. LAYMEN ARE BUDDHAS TOO. UNLESS THEY SEE THEIR NATURE, PEOPLE WHO SHAVE THEIR HEADS ARE SIMPLY FANATICS.\r\nBUT SINCE MARRIED LAYMEN DON'T GIVE UP SEX, HOW CAN THEY BECOME BUDDHAS?\r\nI ONLY TALK ABOUT SEEING YOUR NATURE. I DON'T TALK ABOUT SEX SIMPLY BECAUSE YOU DON'T SEE YOUR NATURE. ONCE YOU SEE YOUR NATURE, SEX IS BASICALLY IMMATERIAL. IT ENDS ALONG WITH YOUR DELIGHT IN IT. EVEN IF SOME HABITS REMAIN, THEY CAN'T HARM YOU. BECAUSE YOUR NATURE IS ESSENTIALLY PURE. DESPITE DWELLING IN A MATERIAL BODY OF FIVE AGGREGATES, YOUR NATURE IS BASICALLY PURE. IT CAN'T BE CORRUPTED.      ...ONCE YOU STOP CLINGING AND LET THINGS BE, YOU'LL BE FREE, EVEN OF BIRTH AND DEATH. YOU'LL TRANSFORM EVERYTHING. YOU'LL POSSESS SPIRITUAL POWERS THAT CAN'T BE OBSTRUCTED. AND YOU'LL BE AT PEACE WHEREVER YOU ARE. IF YOU DOUBT THIS, YOU'LL NEVER SEE THROUGH ANYTHING. YOU'RE BETTER OFF DOING NOTHING. ONCE YOU ACT, YOU CAN'T AVOID THE CYCLE OF BIRTH AND DEATH. BUT ONCE YOU SEE YOUR NATURE, YOU'RE A BUDDHA, EVEN IF YOU WORK AS A BUTCHER.\r\nBUT BUTCHERS CREATE KARMA BY SLAUGHTERING ANIMALS. HOW CAN THEY BE BUDDHAS?\r\nI ONLY TALK ABOUT SEEING YOUR NATURE. I DON'T TALK ABOUT CREATING KARMA. REGARDLESS OF WHAT WE DO, OUR KARMA HAS NO HOLD ON US.      ...IN INDIA, THE TWENTY-SEVEN PATRIARCHS ONLY TRANSMITTED THE IMPRINT OF THE MIND. AND THE ONLY REASON I'VE COME TO CHINA IS TO TRANSMIT THE INSTANTANEOUS TEACHING OF THE MAHAYANA: THIS MIND IS THE BUDDHA. I DON'T TALK ABOUT PRECEPTS, DEVOTIONS OR ASCETIC PRACTICES ....\r\nLANGUAGE AND BEHAVIOR, PERCEPTION AND CONCEPTION ARE ALL FUNCTIONS OF THE MOVING MIND. ALL MOTION IS THE MIND'S MOTION .... THE MIND NEITHER MOVES NOR FUNCTIONS. BECAUSE THE ESSENCE OF ITS FUNCTIONS IS EMPTINESS. AND EMPTINESS IS ESSENTIALLY MOTIONLESS.\r\nHENCE, THE SUTRAS TELL US TO MOVE WITHOUT MOVING, TO TRAVEL WITHOUT TRAVELING, TO SEE WITHOUT SEEING, TO LAUGH WITHOUT LAUGHING, TO HEAR WITHOUT HEARING, TO KNOW WITHOUT KNOWING, TO BE HAPPY WITHOUT BEING HAPPY, TO WALK WITHOUT WALKING, TO STAND WITHOUT STANDING. AND THE SUTRAS SAY, &quot;GO BEYOND LANGUAGE. GO BEYOND THOUGHT.&quot;      ...I COULD GO ON, BUT THIS BRIEF SERMON WILL HAVE TO DO.\r\n\r\nBodhidharma's teachings in these sutras are profoundly interesting and of great importance for all pilgrims of truth. But there are a few false statements. And for the first time, perhaps these false statements are not due to the misunderstanding of the disciples; these false statements have been made by Bodhidharma himself.\r\nHence, before I go into the sutras, I would like to make clear a few things.\r\nFirst, the teachings of Gautam Buddha have created two kinds of seekers: one is called ARHATA and the other is called BODHISATTVA","torrent":{"xt":"urn:btih:2a9f1f15acd5b806f73b73a486c7bdf81792c02d","amp;dn":"Osho_Bodhidharma+The+Greatest+Zen+Master-08.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a9f1f15acd5b806f73b73a486c7bdf81792c02d","infoHashBuffer":{"type":"Buffer","data":[42,159,31,21,172,213,184,6,247,59,115,164,134,199,189,248,23,146,192,45]},"announce":[],"urlList":[]}}