{"title":"Dylan - A Tree With Roots (The Genuine Basement Tape Remasters)+","uid":4137230,"size":727363218,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2aa284bc0fbb75f108c1e110663f1ec7d78d9f25&amp;dn=Dylan+-+A+Tree+With+Roots+%28The+Genuine+Basement+Tape+Remasters%29%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tamroi","files":129,"time":1208314175,"description":"This download just fits a 700mb CD.\nThe bitrate is 256kps.\nThe tracks of 'A tree With Roots' are arranged alphabetically.\nThe official Columbia version is also included in a separate folder.\nThere are no pictures.\n\nI JUST NOTICED AND DOWNLOADED ANOTHER VERSION of 'Tree with Roots'\nwhich is in 4 separate uploads currently called 'Three With Roots', cd1-cd4.\nIt uses bitrate 192kps mp3. You should get at least cd1 for the pictures, and you might prefer its track arrangement.\n\nConsidering the twists and turns that have marked Dylan's career, it's only fitting that the man himself can be credited with sparking the subindustry that so irritates and benefits him. It all started when word got out that Dylan was refusing to release a batch of songs recorded in 1967 with the musicians who would become the Band. And so, in the summer of 1969, some enterprising souls issued a vinyl album of several Basement recordings, mingled with Dylan performances from the early folkie period, under the title &quot;Great White Wonder.&quot;\n\nIn 1975 Columbia stepped in with the much-doctored and woefully incomplete 1975 release of &quot;The Basement Tapes.&quot; (When the album became a hit, Dylan is supposed to have said, &quot;I don't believe it! I thought everybody had 'em already.&quot;) Fresh batches of Basement recordings -- mostly covers of folk and traditional songs -- leaked out in 1986 and 1990, begetting the five-CD &quot;Genuine Basement Tapes&quot; set, which in 2001 begat a four-CD upgrade called &quot;A Tree With Roots.&quot;\n","torrent":{"xt":"urn:btih:2aa284bc0fbb75f108c1e110663f1ec7d78d9f25","amp;dn":"Dylan+-+A+Tree+With+Roots+%28The+Genuine+Basement+Tape+Remasters%29%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aa284bc0fbb75f108c1e110663f1ec7d78d9f25","infoHashBuffer":{"type":"Buffer","data":[42,162,132,188,15,187,117,241,8,193,225,16,102,63,30,199,215,141,159,37]},"announce":[],"urlList":[]}}