{"title":"Stardust - May 2016 (gnv64)","uid":14548495,"size":47569134,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b7fc91cbfafce4c0190aa1ede9d61ee88f18d89&amp;dn=Stardust+-+May+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":4,"time":1462616386,"description":"Stardust - May 2016\r\nEnglish | 168 pages | True PDF | 45.3 mb\r\n\r\nRuling the roost for over 40 years, Stardust is India’s numero uno Bollywood magazine! Stardust gets you all the latest filmy gossip, masala, break-ups and make-ups, previews and reviews, posters and more!\r\n\r\n- Though she appears calm and poised, she impresses with her work on screen and how! A wolf under the sheep’s skin (not in a bad way) is RADHIKA APTE, a woman full of surprises, who will just leave you spell-bound\r\n\r\n- As we sit at the trailer launch of her upcoming movie, a stark contrast presents itself in front of our eyes – AISHWARYA RAI BACHCHAN as Dalbir Kaur on the movie poster and the real Aishwarya Rai Bachchan standing there, soaking up the lights. The disparity was too glaring to be ignored...\r\n\r\n- He surprises with his absolute candidness and politically incorrect stance. He doesn’t speak to please. He states what he feels. In a day and age, when actors are dictated by their PR machinery and prefer to play it safe, it’s refreshing to chat with the searingly honest SUNNY DEOL. The actor, now busy mentoring his son Karan Deol for a splashing, much-awaited launch into the movies, is also planning to helm a couple of other films.\r\n\r\n- The last year closed with SANJAY LEELA BHANSALI’s mammoth project Bajirao Mastani, which earned acclaim in India, and wherever else the film was seen. But apparently, before the makers decided to release the film in China, there’s a story behind its release in the Chinese market.\r\n\r\n- Some would have called his first success a fluke, others perhaps, would have credited his unique sense of art and business. But OMUNG KUMAR doesn’t really delve in the past. As sorted as mavericks can be, Omung has a definite method to his madness, and that has resulted in the much awaited biopic, Sarbjit.\r\n\r\n- Although his recent spate of releases didn’t fare too well at the ticket counters, and his choices, unfortunately, were not proved right, the actor is earnestly making efforts. The actor is now busy with narrations and reading scripts. But, without a doubt, IMRAN KHAN is someone who will focus and think only of positives and possibilities. Certainly, one of the few humble personalities in the fraternity, unlike the often self-centered and self-absorbed breed of actors, Imran’s quite unique.\r\n\r\n- From the current generation of actors, Kangana Ranaut reinvented the notion of woman-centric films. Possibly being the only one to bring numbers and acclaim in equal measure. With her ability to carry a\r\nfilm on her own, single-handedly as its face, time and again she has enticed filmmakers to rope her into their dream projects. KANGANA RANAUT of late, has started insisting on a new clause in her professional contracts before she signs any film.\r\n \nhttps://s32.postimg.org/ia2p2vv9h/Stardust_May_2016.jpg","torrent":{"xt":"urn:btih:2b7fc91cbfafce4c0190aa1ede9d61ee88f18d89","amp;dn":"Stardust+-+May+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b7fc91cbfafce4c0190aa1ede9d61ee88f18d89","infoHashBuffer":{"type":"Buffer","data":[43,127,201,28,191,175,206,76,1,144,170,30,222,157,97,238,136,241,141,137]},"announce":[],"urlList":[]}}