{"title":"Covert Affairs 2x01x02 DVB Spanish by tony","uid":6959888,"size":1151326408,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2db2bb1b390b2c86c1d10a96f37d51d42040a0c6&amp;dn=Covert+Affairs+2x01x02+DVB+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"carambolas","files":4,"time":1326725446,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n      &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\nUna cadete de la CIA se ve obligada a convertirse de forma inesperada en una agente de campo a cargo de una importante misiÃƒÂ³n. Ese es el punto de partida de Covert Affairs, la nueva serie que ha encargado la cadena USA Network, y con la que intentarÃƒÂ¡ seguir manteniendo su ÃƒÂ©xito entre las series originales de la televisiÃƒÂ³n por cable, ya que no ha fracasado con ninguna de las series lanzadas en los ÃƒÂºltimos aÃƒÂ±os.\nEn Covert Affairs, conoceremos a Annie Walker (Piper Perabo), una joven cadete de la CIA que es arrastrada a las interioridades de la agencia cuando es inesperadamente ascendida a agente de campo. Aunque parece que ha sido elegida por sus excepcionales conocimientos lingÃƒÂ¼ÃƒÂ­sticos, en realidad hay alguien o algo de su pasado que sus nuevos jefes quieren conseguir.\nEn el reparto de la serie tambiÃƒÂ©n se encuentra Christopher Gorham (Harper's Island) que interpreta a Auggie Anderson, un agente de la CIA que serÃƒÂ¡ el guÃƒÂ­a de Annie en el emocionante mundo al que estÃƒÂ¡ a punto de acceder; Peter Gallagher (O.C.) que darÃƒÂ¡ vida a Arthur, el director de los servicios clandestinos de la CIA; Anne Dudek (Mad Men), la preocupada hermana mayor de Annie; o Kari Matchett (InvasiÃƒÂ³n), la mÃƒÂ¡xima responsable de la divisiÃƒÂ³n de seguridad nacional de la CIA, una mujer que estÃƒÂ¡ casada con Arthur.","torrent":{"xt":"urn:btih:2db2bb1b390b2c86c1d10a96f37d51d42040a0c6","amp;dn":"Covert+Affairs+2x01x02+DVB+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2db2bb1b390b2c86c1d10a96f37d51d42040a0c6","infoHashBuffer":{"type":"Buffer","data":[45,178,187,27,57,11,44,134,193,209,10,150,243,125,81,212,32,64,160,198]},"announce":[],"urlList":[]}}