{"title":"Luther Dickinson - Hambone's Meditations [320k MP3]","uid":11227916,"size":100288774,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2dbdd662f2e7a38e4e0ed88129e078ba707712fb&amp;dn=Luther+Dickinson+-+Hambone%27s+Meditations+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"smbdownload","files":-1,"time":1413478027,"description":"While Luther Dickinson claims the life-long influence of John Fahey and his Takoma Records catalog as the inspirational source for Hambone's Meditations, it is Jack Rose who is, in essence, the album's guiding muse. According to Dickinson, it was Rose who made him &quot;realize that the medium of instrumental guitar was there for me to utilize. It had never occurred to me to try it myself.&quot; Dickinson wrote the album in 2009, shortly after the birth of his daughter, while still processing the passing of his father, Jim Dickinson. There is little of the hard-driving American primitive of Fahey here; it's one of the album's strengths. What is on offer is Dickinson's consideration of the guitar as a compositional method for instrumental music of harmonic and lyric earthiness, eeriness, and a simplicity that is quite deceptive. Opener &quot;Death Comes On Wings of Crepe&quot; (written with Jimbo Mathus) includes overdubs of mandolin and National Steel guitar atop his fingerpicked f-hole acoustic. The lyric line evokes the Civil War era as well as the French waltzes that have made their way, via the Mississippi River, into the Deep South over the last two centuries. While &quot;Blind Lemon and the Hookman&quot; suggests Fahey with its inventive turnarounds and drones; it also touches on various other Delta and Piedmont styles. &quot;Arkabutla&quot; recalls Rose's way of combining various rags, blues, and folk archetypes in a stretched repetition that falls away -- with little notice -- revealing dramatic interludes. The melody line, with its intricate bass picking and high-string warble, is gorgeous. The heart of the 39-minute set is in its last two selections: &quot;Old Gospel Medley I&quot; and &quot;II.&quot; While many of these traditional tunes are easily recognizable, Dickinson's manner of shaping somber hymns and lighter fare into something wholly other, without losing either one's sources, opens up the notion of time. Inside these various and sometime obscure melodies, gentleness and tension come together, reflecting the worlds of flesh and spirit in what shouldn't be harmonious reconciliation, but somehow is. When Hambone's Meditations concludes, it is as if one has been lost inside its musical and historical reveries. Dickinson isn't showboating his considerable guitar skills here, but instead is offering a portrait of his heritage -- and his compositional and arranging chops -- inside a music that is every bit as haunted and mysterious as the north Mississippi hill country he calls home.\n\n\nTrack Listing [320k MP3]\n\t\nDeath Comes On Wings of Crepe\nBlind Lemon and the Hook Man\nBreckenridge Blues\nArkabutla\nTallahatchee (Birds of the Moon)\nOld Gospel Medley I\nOld Gospel Medley II","torrent":{"xt":"urn:btih:2dbdd662f2e7a38e4e0ed88129e078ba707712fb","amp;dn":"Luther+Dickinson+-+Hambone%27s+Meditations+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dbdd662f2e7a38e4e0ed88129e078ba707712fb","infoHashBuffer":{"type":"Buffer","data":[45,189,214,98,242,231,163,142,78,14,216,129,41,224,120,186,112,119,18,251]},"announce":[],"urlList":[]}}