{"title":"Transformers.Scramble.City.1986.DVD","uid":4740625,"size":3101837652,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2de67a240e9151ffd6fc35e8c2d23b20a7bbfe27&amp;dn=Transformers.Scramble.City.1986.DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"zzzzzinn","files":-1,"time":1235532988,"description":"Transformers: Scramble City\n\nReleased By......: zzzzzinn\nRelease Date.....: 02/24/2009\nOriginal Release.: April, 1986\nSource...........: See Release Notes  \nVideo Codec......: MPEG-2\nVideo Bitrate....: 8000 kbps\nAudio Codec......: AC3 Stereo\nAudio Bitrate....: 192 kbps / 48 Hz\nResolution.......: 720x480\nAspect Ratio.....: 4:3\nFrame Rate.......: 29.970 fps\nRuntime..........: 48:20 min\nSize.............: 2.82 GB\nLanguage.........: Japanese\nSubtitles........: English (DVD and permanent)\nGenre............: Anime\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0147625/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0147625/&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Transformers:_Scramble_City&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Transformers:_Scramble_City&lt;/a&gt;\n\n\nRelease Notes:\nThis release has two versions of Scramble City and six Japanese toy commercials.\n\nThe first version has DVD selectable on/off subs.  The video was sourced from\nTransformers: The Move - 20th Anniversary Special Edition DVD.  The video is the\nuntouched original from the DVD, and was not down-sampled or color adjusted.\nThe audio was sourced and synced from the existing fan subbed copy of Scramble City\navailable on the Internet.  The subs were also sourced from the existing copy.  The\nsubs were typed up, timed, and converted to DVD subs.\n\nThe second version has permanent hard-coded subs set into the video.  This is a DVD\nquality version of my previous XViD release, and is NOT simply an XViD to DVD encode.  The subs were set into the video by converting the TF:TM 20th DVD to uncompressed video (30GB!), and then re-converting to DVD format.  This was done to keep the maximum amount of quality during the hard-subbing, rather than down-sample to a lossy format (XViD), and then up-sample to DVD.\n\nThe toy commercials were sourced from TF:TM 20th DVD, and are untouched.\n\nThe Scramble City title card with logo was recreated from scratch, to serve as the\nbackground for the DVD menu.  PNGs in 1024x768 and 800x600 of the SC logo are\nincluded in the release.\n\n\nBackground:\nScramble City is the name of a Transformers OVA (Original Video Animation) created\nand released in Japan in April 1986. It was created as a promotional video for the\nnew line of 'Scramble City' toys released only in Japan. Despite strong belief (such as that voiced on the 20th Anniversary DVD bonus commentary for the episode), it was not meant to introduce Japanese audiences to the new characters from Transformers: The Movie (considering Ultra Magnus is the only one from the film that appears in it.) or to fill in the 20 years between seasons two and three of the show. It actually takes place years before TF: TM during the early stages of construction on Autobot City.\n\n\nPlot:\nBeginning with a recap of the coming of the Transformers to Earth and the story of\nDevastator, the OVA then gets its original story underway, as the Autobots are shown to be in the midst of constructing the powerful &quot;Scramble City,&quot; overseen by their newest arrival, Ultra Magnus. When the Decepticons learn of this, their combiner robots are deployed to attack, and a battle between them and their Autobot\ncounterparts ensues, focusing on their &quot;Scramble Power&quot; - the interchangeability of\nthe individual limbs - to the extent that at one point, Breakdown of the Stunticons\nconnects to Superion to damage him. At the OVA's conclusion, Scramble City is\nactivated and assumes its robot mode of Metroplex to rout the Decepticons. However,\nfrom the ocean depths, the Decepticons' own city, Trypticon, rises.\n","torrent":{"xt":"urn:btih:2de67a240e9151ffd6fc35e8c2d23b20a7bbfe27","amp;dn":"Transformers.Scramble.City.1986.DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2de67a240e9151ffd6fc35e8c2d23b20a7bbfe27","infoHashBuffer":{"type":"Buffer","data":[45,230,122,36,14,145,81,255,214,252,53,232,194,210,59,32,167,187,254,39]},"announce":[],"urlList":[]}}