{"title":"TTC - Freedom - The Philosophy of Liberation","uid":3715081,"size":91716675,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2e79d59959dc68ff8e52025df4b078fb9c22b022&amp;dn=TTC+-+Freedom+-+The+Philosophy+of+Liberation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"BhangWalla","files":9,"time":1181946062,"description":"TTC - The Teaching Company\n\nFreedom: The Philosophy of Liberation\n(8 lectures, 45 minutes/lecture)\nCourse No. 449\n\nTaught by Dennis Dalton\nBarnard College/Columbia University\nPh.D., University of London \n\nProfessor Dennis Dalton explores the meaning of freedom, perhaps the \nmost powerful of the ideas that have inspired mankind throughout the \nages.\n\nDrawing on his work as a scholar of Gandhi and of Indian political \nthought, he examines the progress of both personal and political freedom.\n\nAnd though the idea of freedom is, for many people, embodied by the \nUnited States, the concept is far older than this country. It is by no \nmeans an exclusively American product.\n\nIndeed, the concept of liberation has long been the subject of learned \nthought, stretching as far back as the time of Plato and as far away as \nancient India.\n\nProfessor Dalton&amp;#039;s lectures are a guided tour along the byways of the \nphilosophy of liberation, beginning with its ancient roots and ending \nin 20th-century America.\n\nTruths Linked By the Same Path\n\nThroughout these lectures, Professor Dalton recounts the progress toward \npersonal liberation and spiritual freedom found in the lives of those who \nwere often consumed by fierce and difficult struggles for political freedom.\n\nHe argues that the results achieved along the way are not separate mysteries \nbut truths linked by the same path.\n\nLecture 1 is devoted to the idea of freedom in the ancient world.\n\nProfessor Dalton points out that freedom is an idea cherished and defended \nby Americans as integral to our culture and as a principle of immense value \nto our national identity.\n\nBut you also learn that the philosophy of freedom was never intrinsically \nAmerican and has its roots in diverse ancient cultures.\n\nThis lecture explores and compares three of those roots:\n\n   * the ancient Hindu philosophy of dual freedom as described in the Bhagavad Gita\n   * the Greek philosopher Plato&amp;#039;s study of freedom in the republic of Athens\n   * the major contributions Christian philosophy has made to the ideal of freedom.\n\nLecture 2&amp;#039;s discussion of freedom&amp;#039;s advent in the modern world begins with \nthe foundations established by John Locke in 17th-century England and by \nJean-Jacques Rousseau in 18th-century France.\n\nYou learn that though each created an intricate system of thought, neither was \nremoved from the political turmoil and radical change that swirled around them.\n\nProfessor Dalton compares Locke&amp;#039;s and Rousseau&amp;#039;s philosophies of freedom and \nrelates both to the chain of thought already established.\n\nBy lecture&amp;#039;s end, you see how the reality of American government today has been \ndeeply influenced by the ideas each put forward:\n\n   * Locke&amp;#039;s idea of the government&amp;#039;s legitimacy through social contract\n   * Rousseau&amp;#039;s blending of liberty and equality.\n\nA Revolution in Thoughts About Freedom\n\nLecture 3 explores the work of G.W.F. Hegel, whose ideas came at a time when \npolitical thought in 19th-century Europe was sharply divided.\n\nYou learn how Hegel developed a philosophy that revolutionized thinking about \nman&amp;#039;s freedom.\n\nHegel was the first philosopher to surmise that the will of God alone was \ndetermining the course of history, and that aiding a state&amp;#039;s quest for power \nand greatness was the only way for an individual to achieve a higher freedom.\n\nThis philosophy had an enormous influence on nationalism, especially German \nnationalism, at a crucial period in that nation&amp;#039;s history.\n\nLecture 4 turns to the work of John Stuart Mill, the 19th-century English \nphilosopher who defined the meaning of freedom with extraordinary clarity and \nprecision.\n\nMill&amp;#039;s text On Liberty, published in 1806, may be one of the most influential \ntexts in defining freedom as understood by most Americans.\n\nMill was a pioneer in the struggle to defend the rights of the individual and \nof women.\n\nHis sweeping defense of free expression and his distrust of the &quot;tyranny of \nthe majority&quot; have helped to define our own political culture. They are reflected \nin numerous Supreme Court decisions.\n\nAn Articulation of Anarchy\n\nLecture 5 is devoted to the work and thoughts of Emma Goldman, the most articulate \nanarchist of the 20th century.\n\nProfessor Dalton introduces you to this extraordinary theorist who refined the \nprinciples of anarchism and used them to address the issue of liberation of women \nas well as men.\n\nYou learn how her brutal childhood instilled in her not only a hatred of authority \nand love of equality but the utmost belief in the power of early upbringing to \nbring out the best in human nature.\n\nAlthough not regarded today as an American hero in most circles, Goldman was a \npassionate advocate for the freedom of humanity from oppressive authority and a \nprophet of the downfall of Soviet communism.\n\nLecture 6 gives Professor Dalton an opportunity to discuss the subject of one of his \nown books in the person of Mahatma Gandhi, the original thinker, activist, and \npolitical leader who led the Indian subcontinent out of British domination.\n\nGandhi&amp;#039;s methods of nonviolent resistance combined with a philosophy of fearlessness \nhave made him one of the most revered men of our century.\n\nA Commitment to Ending the Cycle of Violence\n\nYou learn how Gandhi&amp;#039;s philosophy emerged out of the violence of Indian uprising and \neffected a miraculous transformation of that nation into one of strength and resolve.\n\nGandhi taught that the world has become addicted to violence as a way of solving \nproblems and that it is time to break the cycle.\n\nProfessor Dalton argues that Gandhi, perhaps more than any other leader of our time, \nshowed the possibilities of peace as an effective force.\n\nLecture 7 offers an examination of the life of Malcolm X, one of the most influential \nfighters in the struggle for civil rights in America.\n\nThough he is often associated with the violent separatist doctrines he preached as a \nyoung minister of the Nation of Islam, Malcolm underwent a conversion to inclusivism \nonly a year before his assassination.\n\nDalton traces Malcolm X&amp;#039;s life journey, finding many comparisons to that of Gandhi \ndespite their very different circumstances.\n\nSpiritual Freedom as a Step Towards Political Freedom\n\nHe concludes that they were both leaders who pursued freedom in more than just \npolitical terms. For Malcolm X, freedom was a quest to liberate oneself spiritually \nas a step to achieving that same freedom politically.\n\nIn Lecture 8, Professor Dalton completes the course with a look at the work of Martin \nLuther King, Jr.\n\nYou learn how King, in his struggle for civil rights in the United States, \nsynthesized the teachings of Christ and Mahatma Gandhi to create a method of \nnonviolent resistance.\n\nIt was a synthesis that carried Americans toward justice during the turbulent years \nof the 1950s and 1960s, and Professor Dalton uses King&amp;#039;s life and legacy to review \nhow far the philosophy of freedom has come.\n\nOnce the province only of academics, he concludes, it now inspires activists and \npolitical leaders in nonviolent struggle.\n\n01 - Freedom in the Ancient World.mp3\t                        10.97 MB\n02 - The Advent of Freedom in the Modern World.mp3\t        10.97 MB\n03 - Hegel&amp;#039;s Philosophy of Freedom, God and the State.mp3\t10.80 MB\n04 - John Stuart Mill&amp;#039;s Philosophy of Freedom.mp3\t        10.80 MB\n05 - Emma Goldman and the Anarchist Idea of Freedom.mp3\t        11.01 MB\n06 - Mahatma Gandhi - Personal and Political Freedom.mp3\t11.01 MB\n07 - Malcolm X&amp;#039;s Quest for Liberation.mp3\t                10.95 MB\n08 - Martin Luther King, Jr - Stride Toward Freedom.mp3\t        10.95 MB\n\n\nMore related material: &lt;a href=&quot;\nhttp://thepiratebay.se/user/BhangWalla&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/BhangWalla&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2e79d59959dc68ff8e52025df4b078fb9c22b022","amp;dn":"TTC+-+Freedom+-+The+Philosophy+of+Liberation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e79d59959dc68ff8e52025df4b078fb9c22b022","infoHashBuffer":{"type":"Buffer","data":[46,121,213,153,89,220,104,255,142,82,2,93,244,176,120,251,156,34,176,34]},"announce":[],"urlList":[]}}