{"title":"Kris Delmhorst...Cars(2011)[FLAC]","uid":6842634,"size":289935684,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2f2a35f42727c619d8cf39bbe6ee4f1e5db13fb6&amp;dn=Kris+Delmhorst...Cars%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"dickspic","files":15,"time":1322219885,"description":" &lt;a href=&quot;http://s.s-bol.com/imgbase0/imagebase/regular/FC/2/5/5/7/1000004011617552.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://s.s-bol.com/imgbase0/imagebase/regular/FC/2/5/5/7/1000004011617552.jpg&lt;/a&gt;\n\nCars [2011] Signature / SIG204\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1. You Might Think\n2. Why Can't I Have You\n3. Hello Again\n4. Shake It Up\n5. Magic\n6. Tonight She Comes\n7. Drive\n8. Just What I Needed\n9. Getting Through\n10. You Wear Those Eyes\n11. My Best Friend's Girl\n\nThere is a line in Ric Ocasek's song Drive that says &quot;who's gonna pay attention to your dreams?&quot; and it has clearly been a dream for celebrated singer-songwriter Delmhorst to honour and reinterpret the music of Ocasek - songs she first loved as a teenager. The result is something very different from the folk-country world - a cover album of The Cars hits.\nDelmhorst described it as &quot;an outlandish project&quot; but she pulls off the tricky test of taking some of the most catchy radio pop songs of the 1980s and giving them an acoustic Americana makeover.\nThe album was recorded as if live over only two days and brought together a talented group of musicians. Delmhorst herself is a multi-instrumentalist (singing and playing cello and Wurlitzer organ on Cars) but the heavy synth of the Cars is replaced by fiddle, accordion, upright bass, harmonica, mandolins and even some snazzy glockenspiel work from Laura Cortese and Rose Polenzanic. Delmhorst also has longtime musical collaborator Mark Ereli on Cars.\nDelmhorst also plays sometimes with the accomplished band Redbird, which also features her husband Jeffrey Foucault. He was presumably on child-care duties when this album was made.\nComparing Delmhorst's versions to the Cars originals is not really the point. She has utilised elaborately well-crafted songs by Ocasek and taken them apart. Sometimes the result is playful, fun and bouncy (as with Hello Again, My Best Friend's Girlfriend, You Might Think and Tonight She Comes) and sometimes - as with an absolutely gorgeous version of Magic - she and her fellow harmonists delivers a top-class acoustic reinterpretation.\nDelmhorst says that she can still remember the thrill of listening to Heartbeat City when she bought it on cassette as a teenager. She's now a married mother and there is something of a feel of someone happily celebrating their youth in the whole sound of the album. But the musicians here, whom she describes as &quot;a beautiful dream team of a band&quot; and which also includes Dinty Child and Billy Beard, seem to have been inspired by the concept such is the mood.\nCars keyboard player Greg Hawkes brings the whole thing nicely full circle as he pitches in on ukulele.\nAnd Drive - one if the seminal 'pop' songs of the 1980s? Well Delmhorst absolutely nails it with a superb version.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/03/29/kris-delmhorst/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/03/29/kris-delmhorst/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2f2a35f42727c619d8cf39bbe6ee4f1e5db13fb6","amp;dn":"Kris+Delmhorst...Cars%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f2a35f42727c619d8cf39bbe6ee4f1e5db13fb6","infoHashBuffer":{"type":"Buffer","data":[47,42,53,244,39,39,198,25,216,207,57,187,230,238,79,30,93,177,63,182]},"announce":[],"urlList":[]}}