{"title":"The Battle of Midway by Craig L. Symonds {dwg}","uid":11390988,"size":11452351,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:302287d82816c70a54d829a973836c04185c6e36&amp;dn=The+Battle+of+Midway+by+Craig+L.+Symonds+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"gratefuldawg77","files":6,"time":1415327369,"description":"There are few moments in American history in which the course of events tipped so suddenly and so dramatically as at the Battle of Midway. At dawn of June 4, 1942, a rampaging Japanese navy ruled the Pacific. By sunset, their vaunted carrier force (the Kido Butai) had been sunk and their grip on the Pacific had been loosened forever.\nIn this absolutely riveting account of a key moment in the history of World War II, one of America's leading naval historians, Craig L. Symonds paints an unforgettable portrait of ingenuity, courage, and sacrifice. Symonds begins with the arrival of Admiral Chester A. Nimitz at Pearl Harbor after the devastating Japanese attack, and describes the key events leading to the climactic battle, including both Coral Sea--the first battle in history against opposing carrier forces--and Jimmy Doolittle's daring raid of Tokyo. He focuses throughout on the people involved, offering telling portraits of Admirals Nimitz, Halsey, Spruance and numerous other Americans, as well as the leading Japanese figures, including the poker-loving Admiral Yamamoto. Indeed, Symonds sheds much light on the aspects of Japanese culture--such as their single-minded devotion to combat, which led to poorly armored planes and inadequate fire-safety measures on their ships--that contributed to their defeat. The author's account of the battle itself is masterful, weaving together the many disparate threads of attack--attacks which failed in the early going--that ultimately created a five-minute window in which three of the four Japanese carriers were mortally wounded, changing the course of the Pacific war in an eye-blink.\nSymonds is the first historian to argue that the victory at Midway was not simply a matter of luck, pointing out that Nimitz had equal forces, superior intelligence, and the element of surprise. Nimitz had a strong hand, Symonds concludes, and he rightly expected to win","torrent":{"xt":"urn:btih:302287d82816c70a54d829a973836c04185c6e36","amp;dn":"The+Battle+of+Midway+by+Craig+L.+Symonds+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"302287d82816c70a54d829a973836c04185c6e36","infoHashBuffer":{"type":"Buffer","data":[48,34,135,216,40,22,199,10,84,216,41,169,115,131,108,4,24,92,110,54]},"announce":[],"urlList":[]}}