{"title":"Terminator - The Sarah Connor Chronicles S01E08 - Vick's Chip.a","uid":4199182,"size":367702006,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3030855dcaf23d8268bd8271db804b3fe421128c&amp;dn=Terminator+-+The+Sarah+Connor+Chronicles+S01E08+-+Vick%5C%27s+Chip.a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Chimera2005","files":1,"time":1211403368,"description":"The episode begins with Derek confronting Cameron about the T-888 chip he found in her room, which she was supposed to have destroyed in &quot;Dungeons &amp; Dragons&quot;. Cameron defends herself, saying the chip may have valuable data they can use. Despite the breach of trust, they agree not to destroy the chip and for John to hack into it, to learn about the T-888&amp;#039;s mission. John asks Cameron whether she can lie, to which she replies that she can, if it&amp;#039;s helpful to the mission, and if she lies about important things to John, to which she replies that she has, several times. The T-888 chip is difficult to hack into and extract information from, not only because of the way in which the T-888 organizes its memories, but also because they want to access the memory banks without fully activating the Terminator brain, which requires careful control over the power supply voltage. John manages to recover enough information to learn that the T-888 - known as &quot;Vick&quot; - was a deep infiltration unit, and had a wife, Barbara Chamberlain, the project manager for a new traffic control system for the city, which may become a part of SkyNet&amp;#039;s future infrastructure. Vick&amp;#039;s mission was to ensure that the traffic control system was completed, eliminating any threat to Barbara or her project. Sarah and Derek break into the traffic control system&amp;#039;s control center to upload a virus John created, hoping to make the system look erratic or buggy, but their efforts fail. Sarah has to restrain Derek from killing an incapacitated human guard. During further hacking of the T-888 chip, John accidentally applies too much voltage and the T-888 brain starts up, takes over the computer it&amp;#039;s attached to, then connects to John&amp;#039;s phone (via bluetooth) to reach the internet. John and Cameron realize what is happening and yank the batteries and cables, eventually unplugging the chip itself. It is not clear if the T-888 brain had a chance to make contact with anything, but Cameron asserts that they unplugged it in time. John realizes that Cameron&amp;#039;s brain has the same ability to explore and hack the traffic control network and decides to insert Cameron&amp;#039;s AI chip into the traffic control system so she can shut it down. After successfully compromising the system, Derek takes Cameron&amp;#039;s chip and warns John that one of the terminators he trusts will end up killing him. John gets the chip and says &quot;not this one.&quot; He then re-activates Cameron, while gently stroking her hair, indicating some level of emotional attachment and appreciation towards her. When Cameron reboots, she states, &quot;I saw everything.&quot;\n\nIn another subplot, part of Derek&amp;#039;s distrust of Cameron is because he does not know how his safe house was discovered and all of his fellow soldiers killed. While examining the T-888&amp;#039;s visual records, we find out that Sayles, one of the freedom fighters in Derek&amp;#039;s group, was following Barbara and was tracked back to the safehouse by Vick, thereby exonerating Cameron.\n\nMeanwhile, Cromartie has been doing a school-to-school search for John. A student brings Cameron a note, summoning John to the principal&amp;#039;s office, where Cromartie is waiting. Cameron identifies Cromartie and sends one of John&amp;#039;s friends, Morris, in his place, causing Cromartie to continue the search at other schools. John eventually learns what Cameron did and swears her to not tell Sarah because she will force them all to move.\n\nSarah eventually realizes that Derek is Andrew Goode&amp;#039;s true killer. While Derek is showering, Sarah makes a threat that if he ever lies to her again, she would kill him. Derek is speechless after listening to her threat as Sarah storms away from the bath room.\n\nIn the house, Sarah watches the final footage of Barbara Chamberlain from Vick&amp;#039;s CPU with John&amp;#039;s laptop, and sees the cyborg strangle Barbara in the shower, after the traffic control system project has completed.","torrent":{"xt":"urn:btih:3030855dcaf23d8268bd8271db804b3fe421128c","amp;dn":"Terminator+-+The+Sarah+Connor+Chronicles+S01E08+-+Vick%5C%27s+Chip.a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3030855dcaf23d8268bd8271db804b3fe421128c","infoHashBuffer":{"type":"Buffer","data":[48,48,133,93,202,242,61,130,104,189,130,113,219,128,75,63,228,33,18,140]},"announce":[],"urlList":[]}}