{"title":"Earth from Above - A Terra Vista do Ceu","uid":4286480,"size":734568216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:30db3d9556ab2b71438d5173aac5705b229a2820&amp;dn=Earth+from+Above+-+A+Terra+Vista+do+Ceu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xara_maior","files":1,"time":1215731733,"description":"Audio: Just soundtrack\nLegendas/Subtitles: sem dialogos/no dialogues\nDuracao: 65 min\nBitrate: 1300 kbps\nCodecs: DivX6/mp3\nResolucao: 720 x 400 (9:5)\n\n++++++++++++++++++++++++++++\n\nElle est bleue, elle est belle, surtout ele est petite.\nEt nous ne la quitterons pas.\nAlbert Jacquard\n\nEarth From Above\naka La Terre vue du ciel\nBy\nFrench photographer Yann Arthus-Bertrand.\n\n\nEarth From Above is a stunning portrait of our planet.\nFrench photographer Yann Arthus-Bertrand has managed to capture the awe, natural wonder and raw spectacle of the world that we inhabit. Since his photographic exhibition first opened in Paris, 2000, Earth From Above has toured more then thirty countries and been seen by over fifty million people.\n\nNow the experience has come to DVD.\n\nWith digital clarity, the DVD of Earth From Above enables the viewer to immerse themselves in the beauty and wonder of our world at the touch of a button.\n\nAn ode to the vital reconciliation between Man and Nature, this film invites the viewer to reflect on the changes taking place on our planet, and the repercussions of these changes on future inhabitants. One by one, the stunning images reveal not only the beauty of the Earth, but also the impact we ourselves have made on our fragile planet.\n\n\nFind the places via Google Earth: http://earth.google.com/intl/pt-BR/earthfromabove/\n\n+++++++++++++++++++++++++++\n\nElle est bleue, elle est belle, surtout ele est petite.\nEt nous ne la quitterons pas.\nAlbert Jacquard\n\nEla eh azul, ela eh bela, sobretudo ela eh pequena.\nE nos nao a abandonaremos.\nAlbert Jacquard\n\n\nA Terra Vista do Ceu eh um impressionante retrato do nosso planeta.\nO fotografo frances Yann Arthus-Bertrand conseguiu capturar o espetaculo bruto, natural e intimidante do mundo em que vivemos. Desde que suas fotografias foram exibidas pela primeira vez em Paris, em 2000, A Terra Vista do Ceu viajou por mais de 30 paises e foi vista por mais de 50 milhoes de pessoas.\nCom limpidez digital, o DVD A Terra Vista do Ceu faz o observador submergir na beleza e nas maravilhas do nosso planeta.\nUma obra de reconciliacao entre o Homem e a Natureza, este filme nos convida a refletir sobre as mudancas que acontecem no planeta e nas repercussoes destas mudancas para os futuros habitantes.\nUma a uma, as imagens estonteantes revelam nao apenas a beleza da Terra mas tambem o nosso impacto sobre este fragil planeta.\n\nEncontre os locais via satelite pelo Google Earth:\nFind the places via Google Earth: http://earth.google.com/intl/pt-BR/earthfromabove/","torrent":{"xt":"urn:btih:30db3d9556ab2b71438d5173aac5705b229a2820","amp;dn":"Earth+from+Above+-+A+Terra+Vista+do+Ceu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30db3d9556ab2b71438d5173aac5705b229a2820","infoHashBuffer":{"type":"Buffer","data":[48,219,61,149,86,171,43,113,67,141,81,115,170,197,112,91,34,154,40,32]},"announce":[],"urlList":[]}}