{"title":"Ben Bova, Moonwar mobi [dovah]","uid":8902928,"size":701371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:313aebc69abb7a1bb158afe7ffab6a71e8270a3a&amp;dn=Ben+Bova%2C+Moonwar+mobi+%5Bdovah%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dovah12","files":4,"time":1378846070,"description":"\n    Book: Moonwar\n    Author: Ben Bova\n\n    Moonbase rose up like the Phoenix out of the lunar dust-- a new society thriving on an inhospitable world battling the bitter enmity of powerful Earthside foes for the right to exist.Now it's total war.MOONWARThis is our future. Ben Bova sees it as dearly as if it were outside his window. A Hugo Award-winning extrapolator--the best-selling explorer of Mars--Bova thrills us with the astounding possibilities of science and technology. But it's his humanism that sets Ben Bova's SF uniquely apart. His characters live and breathe, captivating us with their dreams, their foibles and their distinctly human crises. Armed with these potent weapons, he leads us into MOONWAR--the second book in his monumental Moonbase Saga for a life-or-death confrontation in the magnificent desolation of a harsh and airless world. Seven years after the remarkable Stavenger family made Moonbase a reality, a substantial community lives, labors and flourishes under the leadership of Doug Stavenger, thanks to the wonders of nanotechnology--virus-size machines that can build, refine, cure, create. . .and destroy. But the science that sustains and supports the young off Earth colony has been declared illegal and immoral by the home planet's rulers. And one man with the power to dictate policy is launching war's madness across the heavens--determined to lay claim to Stavenger's peaceful city or obliterate it if necessary--forcing an isolated society with no arms or military to defend itself with nothing but ingenuity and the tools that built and maintain the settlement.\n   \n ISBN13: 9780380973033\n    ISBN10: 0380973030\n","torrent":{"xt":"urn:btih:313aebc69abb7a1bb158afe7ffab6a71e8270a3a","amp;dn":"Ben+Bova%2C+Moonwar+mobi+%5Bdovah%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"313aebc69abb7a1bb158afe7ffab6a71e8270a3a","infoHashBuffer":{"type":"Buffer","data":[49,58,235,198,154,187,122,27,177,88,175,231,255,171,106,113,232,39,10,58]},"announce":[],"urlList":[]}}