{"title":"The Girl Who Would Be King LittleFairyRG","uid":9371151,"size":4006092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:334796e4ead6d7a5893dfab497bb2aff02b0a0f1&amp;dn=The+Girl+Who+Would+Be+King+LittleFairyRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SirHates","files":4,"time":1387530061,"description":"[img]http://d202m5krfqbpi5.cloudfront.net/books/1348778051l/16050500.jpg[/img]\nA novel about two teenage girls with superpowers and radically different agendas, destined for a collision that will rock the world.\n\nSeparated by thousands of miles, two young women are about to realize their extraordinary powers which will bind their lives together in ways they can't begin to understand.\n\nProtecting others. Maintaining order. Being good. These are all important things for Bonnie Braverman, even if she doesn't understand why. Confined to a group home since she survived the car accident that killed both her parents, Bonnie has lived her life until now in self-imposed isolation and silence; but when an opportunity presents itself to help another girl in need, Bonnie has to decide whether to actually use the power she has long suspected she has. Power that frightens her.\n\nAcross the country, Lola LeFever is inheriting her own power by sending her mother over a cliff...literally. For Lola the only thing that matters is power; getting it, taking it, and eliminating anyone who would get in the way of her pursuit of it. With her mother dead and nothing to hold her back from the world any longer, Lola sets off to test her own powers on anyone unfortunate enough to cross her. And Lola's not afraid of anything.\n\nOne girl driven to rescue, save, and heal; the other driven to punish, destroy, and kill.\n\nAnd now they're about to meet","torrent":{"xt":"urn:btih:334796e4ead6d7a5893dfab497bb2aff02b0a0f1","amp;dn":"The+Girl+Who+Would+Be+King+LittleFairyRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"334796e4ead6d7a5893dfab497bb2aff02b0a0f1","infoHashBuffer":{"type":"Buffer","data":[51,71,150,228,234,214,215,165,137,61,250,180,151,187,42,255,2,176,160,241]},"announce":[],"urlList":[]}}