{"title":"DINO CRISIS - [[PLAYSTATION ONE]] - {PAL} - (DRAGON)","uid":4119817,"size":232620158,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:338bdae8d71a9799cf80fd5c1e376f9bab28f410&amp;dn=DINO+CRISIS+-+%5B%5BPLAYSTATION+ONE%5D%5D+-+%7BPAL%7D+-+%28DRAGON%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dragon_Fire","files":17,"time":1207495225,"description":"DINO CRISIS - PLAYSTATION ONE - PAL\n\nTake Resident Evil, remove the zombies and replace with dinosaurs. Thatis the simple recipe behind Dino Crisis. A remote island full of dinosaurs is eerily similar to the zombie-populated Racoon County, with puzzles to solve items to collect and plenty of canon fodder to deal with. But Dino Crisis has a few more tricks up its sleeve.\nJust like Jurassic Park, the action of Dino Crisis takes place on a remote island, where a mysterious scientist has been performing experiments. Communication with the island has been lost, so a crack team have been assembled and dispatched to get to the root of the problem. You play Regina, the female member of the team. If you can survive the terror that lies ahead youire braver than we are!\n\nDinosaurs are intelligent, zombies arenit. They can open doors, chase you through rooms and run faster than you. Velociraptors are about the same size as Regina, but a lot tougher. They need more shots than a zombie to kill, as for the big ones n forget it. The best youill manage is to run past them. The T-Rex can kill you with a single bite, while a Pterodactyl can scoop you into its beak and fly away never to be seen again. This remote island is a dangerous place.\n\nEquipment is in short supply, ammo is scarce and heavy-duty weapons scarcer. To survive Regina will have to make best use of the items available to her and in classic Blue Peter fashion, see what she can rustle-up with whatis lying around. One way of doing this is by mixing objects, good for tranquillisers and health packs, but donit mix the two up!\n\nUnlike Resident Evil, Dino Crisis doesnit rely on pre-rendered backgrounds that take ages to load and restrict the gameplay. Every object is now made of polygons, allowing for Regina to interact with the background, crawling into air vents, or clinging to a wall to escape the T-Rex jaws. The camera isnit restricted to a fixed position either, allowing for some dramatic and creepy moments.\n\n\nTHE PACK INCLUDES:\n                  \n                 1. ORIGINAL PAL COVERS\n                 2. DINO CRISIS GAME IN CLONECD IMAGE\n                 3. A PSX EMULATOR\n                 4. A PSX TO PSP CONVERTER (EBOOT)\n\nHAVE FUN AND KEEP THE PSX ALIVE\n\nDRAGON X","torrent":{"xt":"urn:btih:338bdae8d71a9799cf80fd5c1e376f9bab28f410","amp;dn":"DINO+CRISIS+-+%5B%5BPLAYSTATION+ONE%5D%5D+-+%7BPAL%7D+-+%28DRAGON%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"338bdae8d71a9799cf80fd5c1e376f9bab28f410","infoHashBuffer":{"type":"Buffer","data":[51,139,218,232,215,26,151,153,207,128,253,92,30,55,111,155,171,40,244,16]},"announce":[],"urlList":[]}}