{"title":"The Traveling Wilburys - The Traveling Wilburys, Vol. 3 (2005) [","uid":8644619,"size":565298051,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:33bfe26497690a93c0b0ddf448158206255ac5aa&amp;dn=The+Traveling+Wilburys+-+The+Traveling+Wilburys%2C+Vol.+3+%282005%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":31,"time":1372957635,"description":"This is the same torrent that was uploaded to Demonoid in September 2011.\n\n\nThe Traveling Wilburys - The Traveling Wilburys, Vol. 3 (2005) [Expanded, From Set]\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by William Ruhlmann):\n\nReversing the usual process by which groups break up and give way to solo careers, the Traveling Wilburys are a group made up of solo stars. The group was organized by former Beatle George Harrison, former Electric Light Orchestra leader Jeff Lynne, Bob Dylan, Tom Petty, and Roy Orbison, thus representing three generations of rock stars. In 1988, the five (who had known each other for years) came together to record a Harrison B-side single and ended up writing and recording an album on which they shared lead vocals. It turned out to be a way to transcend the high expectations made of any of them as individuals, and a delighted public sent the album to number three, with two singles, &quot;Handle With Care&quot; and &quot;End of the Line&quot; hitting the charts. Unfortunately, Orbison died of a heart attack only a few weeks after the album's release.\n\nRead all of the bio at: &lt;a href=&quot;\nhttp://www.allmusic.com/artist/the-traveling-wilburys-p5687/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/artist/the-traveling-wilburys-p5687/biography&lt;/a&gt;\n\nAll Music Album Review (by Stephen Thomas Erlewine):\n\nThe Traveling Wilburys built upon George Harrison's comeback with Cloud Nine and helped revitalize the other supergroup members' careers, setting the stage for Bob Dylan's 1989 comeback with Oh Mercy, Tom Petty's first solo album, Full Moon Fever, produced by Jeff Lynne (sounding and feeling strikingly similar to this lark), and Roy Orbison's Mystery Girl, which was released posthumously. Given the success of this record and how it boosted the creativity of the rest of the five, it's somewhat a shock that the second effort falls a little flat. In retrospect, Vol. 3 plays a little bit better than it did at the time -- it's the kind of thing to appreciate more in retrospect, since you'll never get another album like it -- but it still labors mightily to recapture what came so effortlessly the first time around, a problem that can't merely be chalked up to the absence of Orbison (who after all, didn't write much on the first and only took lead on one song). Where the humor flowed naturally and absurdly throughout the debut, it feels strained on Vol. 3 -- nowhere more so than on &quot;Wilbury Twist,&quot; where Petty implores you to put your underwear on your head and get up and dance, the epitome of forced hilarity -- and the production is too polished and punchy to give it a joie de vivre similar to the debut. That polish is an indication that Lynne and Petty dominate this record, which only makes sense because they made it between Full Moon Fever and Into the Great Wide Open, but it's striking that this sounds like more like their work, even when Dylan takes the lead on &quot;Inside Out&quot; or the doo wop-styled &quot;7 Deadly Sins.&quot; Both of these are quite good songs and they have a few other companions here, like the quite wonderful country stomp &quot;Poor House,&quot; but they're songs more notable for their craft than their impact -- nothing is as memorable as the throwaways on the debut -- and when combined with the precise production, it takes a bit for them to sink in. But give the record some time, and these subtle pleasures are discernible, even if they surely pale compared to the open-hearted fun of the debut. But when paired with the debut on this set, it's a worthy companion and helps support the notion that the Traveling Wilburys were a band that possesses a unique, almost innocent, charm that isn't diminished after all this time.\n\nTaken from: &lt;a href=&quot;\nhttp://www.allmusic.com/album/the-traveling-wilburys-vol-3-r78573/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/the-traveling-wilburys-vol-3-r78573/review&lt;/a&gt;\n\nCatalog number: MMC Records PLMMC 9010 WX 224\nI was unable to find this album on the web. This was ripped from a CDR. I do not know what the album art looks like. Maybe someone from Hungary can help us out.\n\nTrack List:\n\n01. She's My Baby\n02. Inside Out\n03. If You Belonged To Me\n04. The Devil's Been Busy\n05. Seven Deadly Sins\n06. Poor House\n07. Where Were You Last Night?\n08. Cool Dry Place\n09. New Blue Moon\n10. You Took My Breath Away\n11. Wilbury Twist\n12. Nobody's Child\n13. Dave Stewart &quot;Lumiere&quot; (Instrumental)\n14. Ringo Starr &quot;With A Little Help From My Friends&quot; (Live At The Greek)\n15. Duane Eddy &quot;The Trembler&quot; (Instrumental)\n16. New Blue Moon (Instrumental)\n17. Runaway\n18. Maxine (Outtake)\n19. You Took My Breath Away (Alternate Mix)\n20. She's My Baby (Alternate Take)\n21. The Devil's Been Busy (Alternate Take)\n22. Wilbury Twist (Early Mix Missing Many Overdubs)\n23. New Blue Moon (Rough Mix)\n24. Runaway (Rough Mix)\n","torrent":{"xt":"urn:btih:33bfe26497690a93c0b0ddf448158206255ac5aa","amp;dn":"The+Traveling+Wilburys+-+The+Traveling+Wilburys%2C+Vol.+3+%282005%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33bfe26497690a93c0b0ddf448158206255ac5aa","infoHashBuffer":{"type":"Buffer","data":[51,191,226,100,151,105,10,147,192,176,221,244,72,21,130,6,37,90,197,170]},"announce":[],"urlList":[]}}