{"title":"Herman Philipse - God in the Age of Science (epub/mobi/pdf)","uid":14428171,"size":5273150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34e147d06b9687e3b715c18158fe2a6c1d377270&amp;dn=Herman+Philipse+-+God+in+the+Age+of+Science+%28epub%2Fmobi%2Fpdf%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pahly","files":3,"time":1461589179,"description":"God in the Age of Science? is a critical examination of strategies for the philosophical defence of religious belief. The main options may be presented as the end nodes of a decision tree for religious believers. The faithful can interpret a creedal statement (e.g. &quot;God exists&quot;) either as a truth claim, or otherwise. If it is a truth claim, they can either be warranted to endorse it without evidence, or not. Finally, if evidence is needed, should its evidential support be assessed by the same logical criteria that we use in evaluating evidence in science, or not? Each of these options has been defended by prominent analytic philosophers of religion.\r\n\r\nIn part I Herman Philipse assesses these options and argues that the most promising for believers who want to be justified in accepting their creed in our scientific age is the Bayesian cumulative case strategy developed by Richard Swinburne. Parts II and III are devoted to an in-depth analysis of this case for theism. Using a &quot;strategy of subsidiary arguments,&quot; Philipse concludes (1) that theism cannot be stated meaningfully; (2) that if theism were meaningful, it would have no predictive power concerning existing evidence, so that Bayesian arguments cannot get started; and (3) that if the Bayesian cumulative case strategy did work, one should conclude that atheism is more probable than theism. Philipse provides a careful, rigorous, and original critique of atheism in the world today","torrent":{"xt":"urn:btih:34e147d06b9687e3b715c18158fe2a6c1d377270","amp;dn":"Herman+Philipse+-+God+in+the+Age+of+Science+%28epub%2Fmobi%2Fpdf%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34e147d06b9687e3b715c18158fe2a6c1d377270","infoHashBuffer":{"type":"Buffer","data":[52,225,71,208,107,150,135,227,183,21,193,129,88,254,42,108,29,55,114,112]},"announce":[],"urlList":[]}}