{"title":"Heaven Knows, Mr. Allison 1957 BrRip Mp4 lee1001","uid":10797837,"size":1060790419,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:362148abd5e1bb04e2a9801bd0c25569b9b1e0fe&amp;dn=Heaven+Knows%2C+Mr.+Allison+1957+BrRip+Mp4+lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"xultfoad","files":2,"time":1408310510,"description":"Heaven Knows, Mr. Allison 1957 BrRip Mp4 lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0050490/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0050490/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Heaven_Knows,_Mr._Allison&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Heaven_Knows,_Mr._Allison&lt;/a&gt;\nOn the one hand, Huston's typically wry contribution to Hollywood's long-established, censor-baiting fascination with nuns. On the other, a quirky and superior reworking of his own The African Queen. Deborah Kerr, back in the habit ten years after Black Narcissus, is stranded on a Jap-held Pacific island with Marine corporal Mitchum, whose wonderfully low-key portrait of melting machismo is everything Bogart's respectably Oscar-chasing irascibility wasn't. The favourite film of its veteran screenwriter, John Lee Mahin.\n\nHeaven Knows, Mr. Allison is an object lesson in good taste that doesn't compromise (or insult) adult values. The producers knew they were walking a thin line with the censors. Sister Angela has yet to take her final vows, which in a modern production would instantly mandate wild sex for the two. Instead, her commitment to the church is interestingly compared with Mr. Allison's own pledge to the Marines.\n\nWith actors Robert Mitchum and Deborah Kerr handling what is essentially a two-actor drama, this one is firmly on the side of quality.\n\nTHAT frequent and often popular story of a pious woman and an impious man cast together in circumstances that test the righteousness and fiber of each is tackled again by John Huston (he tackled it last in &quot;The African Queen&quot;) in Twentieth Century-Fox' &quot;Heaven Knows, Mr. Allison.&quot; And once more, as with that previous picture, Mr. Huston comes up with a film that is stirring and entertaining. It opened at the Roxy last night.\n\nThis time the people of the story are a Roman Catholic nun and a marine corporal isolated on an island in the South Pacific during World War II. It seems that the war has by-passed them, until contingents of Japanese come and set up small bases on the island, forcing the nun and the marine to hide in the hills. Under these circumstances, the two are thrown into close proximity, and their resourcefulness and resolutions are put to the acid test.\n\nVIDEO\nSize.... 0.98gb\nDuration.... 01:46:09\nCodec....... AVC1\nFrame Width.... 720\nFrame Height.... 304\nData Rate.... 1163kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 163kbps\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:362148abd5e1bb04e2a9801bd0c25569b9b1e0fe","amp;dn":"Heaven+Knows%2C+Mr.+Allison+1957+BrRip+Mp4+lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"362148abd5e1bb04e2a9801bd0c25569b9b1e0fe","infoHashBuffer":{"type":"Buffer","data":[54,33,72,171,213,225,187,4,226,169,128,27,208,194,85,105,185,177,224,254]},"announce":[],"urlList":[]}}