{"title":"Gina Sicilia - Can't Contrself 2011","uid":7186443,"size":237969860,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:363a5df4827c4941cc5a675d658f736f1803a0b4&amp;dn=Gina+Sicilia+-+Can%27t+Contrself+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1334444528,"description":"Pigeon holes are for pigeons, not this Philadelphia songstress who hits me as the best American female blues singer since Susan Tedeschi, and has the soulful chops of a young Bonnie Raitt. She's got a voice that is old and bleeds blues beyond her 25 years, she's got an earthy quality that belies a Temple University Journalism degree. She's got a `tease' in that voice that speaks of years on the bawdy roadhouse circuit, except she hasn't been there. She also writes songs that run the gambit from 2 beat country to jazz and all the time reflecting on and paying tribute to song writers that aren't immediately apparent as influence in her performance or her own songs. Stevie Wonder's 'A Place In The Sun' sung as a straight ahead, Americana ballad, Willie Dixons 'Crazy Bout You', delivered as a mid-tempo blues rocker.\n\nThe instrumentation aids in blurring the lines - Hammond B3 organ and accordion, Wurlitzer pianos with baritone and tenor sax, lap steel with toy pianos. As crazy as it sounds, it works and hooks the listeners from the start. It's easy to see why she was nominated for a 2008 Blues Music Award in the category of 'Best New Artist Debut'.\n\nSicilia recorded her first album, Allow Me to Confess in 2007 and she was hailed by none other than JazzReview as 'the best blues singer on the music scene today'. This led to a second album, Hey Sugar and extensive touring which culminated with an invite to the Legendary Rhythm and Blues Cruise in 2011.\n\nOn Can't Control Myself she seems to explore a more roots sound, while still keeping that link to the blues. Anything you want to call it, she has star quality with a powerful voice that seems to be right at home in a large number of genres. She's also more than capable as a song writer. 'Addicted' is simply, well, addicting, and 'Before The Night Is Through' sounds like something that the Great Sam Cooke could have written and it's `almost reggae' feeling would hit on many radio formats.\n\nAnd if the abundant musical talent isn't enough, she's also got stage presences usually found in seasoned performers and is more than easy on the eye.\n(The Dirty Lowdown, amazon.com)\n\n- - -\n\nGina Sicilia - Can't Control Myself 2011\n(Swingnation Records)\n\n 1. Addicted   \n 2. Crazy 'Bout You Baby   \n 3. Members Only   \n 4. Before the Night Is Through    \n 5. Place In the Sun \n 6. Can't Control Myself    \n 7. As Long As You're Here    \n 8. Wish the Clock Would Stop    \n 9. Gimme a Simple Song  \n10. Once In a While  \n","torrent":{"xt":"urn:btih:363a5df4827c4941cc5a675d658f736f1803a0b4","amp;dn":"Gina+Sicilia+-+Can%27t+Contrself+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"363a5df4827c4941cc5a675d658f736f1803a0b4","infoHashBuffer":{"type":"Buffer","data":[54,58,93,244,130,124,73,65,204,90,103,93,101,143,115,111,24,3,160,180]},"announce":[],"urlList":[]}}