{"title":"Meaning in Life (2013) pdf","uid":10212369,"size":1302752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3883eef6eaf4b056b88ce2b6df766c7640e5489f&amp;dn=Meaning+in+Life+%282013%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1400932779,"description":"What makes a person's life meaningful? Thaddeus Metz offers a new answer to an ancient question which has recently returned to the philosophical agenda. He proceeds by examining what, if anything, all the conditions that make a life meaningful have in common. The outcome of this process is a philosophical theory of meaning in life. He starts by evaluating existing theories in terms of the classic triad of the good, the true, and the beautiful. He considers whether meaning in life might be about such principles as fulfilling God's purpose, obtaining reward in an afterlife for having been virtuous, being attracted to what merits attraction, leaving the world a better place, connecting to organic unity, or transcending oneself by connecting to what is extensive. He argues that no extant principle satisfactorily accounts for the three-fold significance of morality, enquiry, and creativity, and that the most promising theory is a fresh one according to which meaning in life is a matter of intelligence contoured toward fundamental conditions of human existence. ","torrent":{"xt":"urn:btih:3883eef6eaf4b056b88ce2b6df766c7640e5489f","amp;dn":"Meaning+in+Life+%282013%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3883eef6eaf4b056b88ce2b6df766c7640e5489f","infoHashBuffer":{"type":"Buffer","data":[56,131,238,246,234,244,176,86,184,140,226,182,223,118,108,118,64,229,72,159]},"announce":[],"urlList":[]}}