{"title":"Giles Foden - 4 Novels","uid":9917454,"size":1322261,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38b73398059d8d39060d6e3d755e2c0021250a01&amp;dn=Giles+Foden+-+4+Novels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nepalifiction","files":-1,"time":1396918013,"description":"Giles Foden was born in Warwickshire in 1967. His family moved to Malawi in 1971, where he was raised. He was educated at Yarlet Hall and Malvern College boarding schools, then at Fitzwilliam College, Cambridge, where he read English, and at St John's College, Cambridge. He worked as a journalist for Media Week magazine, then became an assistant editor on the Times Literary Supplement. He was deputy literary editor of The Guardian between 1995 and 2006 and is currently Fellow in Creative and Performing Arts at Royal Holloway, University of London. He is a Professor of Creative Writing at the University of East Anglia, and still contributes regularly to The Guardian and other journals.\n\nHis first novel The Last King of Scotland (1998), is set during Idi Amin's rule of Uganda in the 1970s. It won the Whitbread First Novel Award, a Somerset Maugham Award, a Betty Trask Award and the Winifred Holtby Memorial Prize. The 2006 feature film, The Last King of Scotland starring Forest Whitaker, is based on Foden's novel with considerable differences, and Foden himself makes a brief cameo as a journalist at one of Amin's press conferences. His second novel, Ladysmith (1999), is set during the Anglo-Boer War in 1899 and tells the story of a young woman, Bella Kiernan, who becomes caught up in the Siege of Ladysmith. The book was inspired by letters written by Foden's great-grandfather, Arthur Foden, a British soldier in the Imperial Yeomanry in South Africa during the conflict.\n\nGiles Foden edited The Guardian Century (1999), a collection of the best reportage and feature-writing published in the newspaper during the twentieth century, and he contributed a short story to The Weekenders: Travels in the Heart of Africa, a collection of short fiction set in Africa by various contemporary writers. Zanzibar (2002), is set in east Africa and explores the events surrounding the bombings of American embassies in 1998. Mimi and Toutou Go Forth: The Bizarre Battle for Lake Tanganyika, was published in 2004.\n\nIn 2009, he donated the short story (One Last) Throw of the Dice to Oxfam's 'Ox-Tales' project, four collections of UK stories written by 38 authors. Foden's story was published in the 'Water' collection. His latest book Turbulence is a novel on military interest in meteorology in the Second World War.\n\n\nThe torrent contains all the following books in ePUB format:\n\n* 1998: The Last King of Scotland\n\n* 1999: Ladysmith\n\n* 2002: Zanzibar\n\n* 2004: Mimi and Toutou Go Forth: The Bizarre Battle for Lake Tanganyika\n\n* 2009: Turbulence\n\n\nRead the following articles,interview, and SEED the torrent, and don't forget to give FEEDBACK!!!\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Giles_Foden&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Giles_Foden&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.randomhouse.com/boldtype/1298/foden/interview.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.randomhouse.com/boldtype/1298/foden/interview.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.ft.com/intl/cms/s/0/3a13846c-61df-11de-9e03-00144feabdc0.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ft.com/intl/cms/s/0/3a13846c-61df-11de-9e03-00144feabdc0.html&lt;/a&gt;\n \n","torrent":{"xt":"urn:btih:38b73398059d8d39060d6e3d755e2c0021250a01","amp;dn":"Giles+Foden+-+4+Novels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38b73398059d8d39060d6e3d755e2c0021250a01","infoHashBuffer":{"type":"Buffer","data":[56,183,51,152,5,157,141,57,6,13,110,61,117,94,44,0,33,37,10,1]},"announce":[],"urlList":[]}}