{"title":"Embrace - The Good Will Out [1998]","uid":9396494,"size":435759150,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:38f28f731987df4a4ec53469fdcea04a1b460887&amp;dn=Embrace+-+The+Good+Will+Out+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387992597,"description":"Debut albums rarely arrive with as much expectation as Embrace's The Good Will Out -- in Britain, at least. Arriving after the massive success of Oasis and the Verve, The Good Will Out was perceived as the heir apparent to the lad-rock throne. One listen to The Good Will Out illustrates why -- the group ingeniously combines the anthemic hooks and monolithic roar of Oasis with the sweeping aural majesty of the Verve. That alone makes the album a bracing listen, but The Good Will Out doesn't quite have enough substance to compete in the big leagues. Danny McNamara simply doesn't have the charisma of Liam Gallagher or Richard Ashcroft, and his songs aren't as immediate or memorable as Noel Gallagher's or Ashcroft's. That's not to say they're bad songs -- on the contrary, they're quite good, and they're performed passionately. It's just that in comparison to their peers -- who really are their influences, as well -- they lack that certain magic. Nevertheless, The Good Will Out illustrates enough promise and panache to make it a first-rate debut. (4/5)","torrent":{"xt":"urn:btih:38f28f731987df4a4ec53469fdcea04a1b460887","amp;dn":"Embrace+-+The+Good+Will+Out+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38f28f731987df4a4ec53469fdcea04a1b460887","infoHashBuffer":{"type":"Buffer","data":[56,242,143,115,25,135,223,74,78,197,52,105,253,206,160,74,27,70,8,135]},"announce":[],"urlList":[]}}