{"title":"Hidden Secrets - Part 110 - N E P H I L I M - Sons of The Fallen","uid":13695500,"size":7156131444,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3943bc04722a4d8c00127496d9faf18a28a5e6b9&amp;dn=Hidden+Secrets+-+Part+110+-+N+E+P+H+I+L+I+M+-+Sons+of+The+Fallen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":35,"time":1456687469,"description":"INTRODUCTION\r\n\r\nThe Nephilim (plural) are the offspring of the &quot;sons of God&quot; and the &quot;daughters of men&quot; in Genesis 6:4, or giants who inhabit Canaan in Numbers 13:33. A similar word with different vowel-sounds is used in Ezekiel 32:27 to refer to dead Philistine warriors.\r\n\r\nIn the Hebrew Bible and several non-canonical Jewish and early Christian writings, nephilim means the fallen ones are a people created by the cross-breeding of the &quot;sons of God&quot; and the &quot;daughters of men&quot;. The word nephilim is loosely translated as giants or titans in some Bibles, and is left untranslated in others.\r\n\r\nThe phrase &quot;sons of God&quot; is sometimes translated into English as &quot;sons of gods&quot;. The Hebrew word, &quot;Elohim&quot;, is a plural form, but is often used with single verbs and adjectives (as in this case) when the single meaning is traditionally understood.\r\n\r\nThe traditional Jewish view, deriving from the Book of Enoch, is that the fathers of the nephilim, the &quot;sons of God&quot;, were the Grigori (a class of fallen angels also called the Watchers); however, there is some controversy on this point.\r\n\r\nSome commentators suggest the nephilim were believed to have been fathered by members of a proto-Hebrew pantheon, and are a brief glimpse of early Hebrew religion, most of the details of which was later edited out from the Torah. Others, especially some Christians, suggest the &quot;sons of God&quot; were fully human. It is sometimes suggested that ridding the Earth of these nephilim was one of God's purposes for flooding the Earth in Noah's time.\r\n\r\nDespite the literal text of the Bible and its traditional interpretation, the idea that heavenly beings mated with humans is controversial, particularly among Christians, who cite the teaching of Jesus in the Book of Matthew that angels do not marry (they may take the verse in question out of context because Jesus said that the resurrected don't marry in heaven but are as the angels).\r\n\r\nOthers who find the idea of angels mating with humans as distasteful have suggested more figurative interpretations of the nephilim, such as the idea that they were the offspring of men possessed by demons.Still others, including the Ethiopian Orthodox Church, take the traditional view of Genesis 6:1 that the allusion refers to some men, from the godly lineage of Seth, called sons of God (an expression denoting those in covenant relationship with YHWH, cf. Deuteronomy 14:1; 32:5), began to pursue fleshly interests, and so took wives of the daughters of men, i.e., those who were unbelievers descended of Cain. This is also the view presented in a few extra-biblical, yet ancient works, particularly the Second Book of Adam and Eve","torrent":{"xt":"urn:btih:3943bc04722a4d8c00127496d9faf18a28a5e6b9","amp;dn":"Hidden+Secrets+-+Part+110+-+N+E+P+H+I+L+I+M+-+Sons+of+The+Fallen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3943bc04722a4d8c00127496d9faf18a28a5e6b9","infoHashBuffer":{"type":"Buffer","data":[57,67,188,4,114,42,77,140,0,18,116,150,217,250,241,138,40,165,230,185]},"announce":[],"urlList":[]}}