{"title":"Deafheaven-Sunbather-2013-pLAN9","uid":9342223,"size":121135928,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:39ba025eb399225d2a7a1c62dd579849173b4931&amp;dn=Deafheaven-Sunbather-2013-pLAN9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-wxm-","files":-1,"time":1386957095,"description":"Deafheaven - Sunbather [2013] [Album]\nDeathwish Inc / DW146 / CD\nFLAC Lossless / OUTERSPACE\nMP3 V0 (VBR) / pLAN9\n\n&quot;Sunbather&quot; is the highly anticipated new album from Deafheaven.\n\nRecorded and engineered by Jack Shirley (Funeral Diner, Comadre) and designed by Nick Steinhardt (Touche Amore) &quot;Sunbather&quot; deals with the profound sadness found in the quest for one's personal perfection. Serving as an artistic lucid dream of warmth despite the stinging pain of life's cruel idealism.\n\nWith opener &quot;Dream House&quot; George Clarke's tortured vocals familiarly intertwine with Kerry McCoy's hypnotic guitar work before crashing into a wash of post-everything melody. This leads to the moving instrumental &quot;Irresistible&quot; a track that carries a twisted indie-like sensibility buried beneath glittery layers of guitar and piano. However it is in the title track and beyond where the maturation and growth of Deafheaven brightly shines. In &quot;Sunbather&quot; they explore sonic peaks and valleys created by superb percussionist Daniel Tracy (new to the band for this recording). His inclusion brings new dynamics to light as an urgent pulse to the swirling musical chaos. Pushing bleak epic &quot;Vertigo&quot; and the dark emotional closer &quot;The Pecan Tree&quot; to new, awe-inducing heights.\n\nWithout question &quot;Sunbather&quot; is Deafheaven at the peak of their creative strength and vision of their young existence. A masterfully crafted work of art that will be renowned for years to come.\n\nDream House\nIrresistible\nSunbather\nPlease Remember\nVertigo\nWindows\nThe Pecan Tree","torrent":{"xt":"urn:btih:39ba025eb399225d2a7a1c62dd579849173b4931","amp;dn":"Deafheaven-Sunbather-2013-pLAN9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39ba025eb399225d2a7a1c62dd579849173b4931","infoHashBuffer":{"type":"Buffer","data":[57,186,2,94,179,153,34,93,42,122,28,98,221,87,152,73,23,59,73,49]},"announce":[],"urlList":[]}}