{"title":"Warlords_Battlecry_III-Razor1911","uid":6842382,"size":775819770,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3a6ec116b5d37c86564a238492e1d5713b83e2c3&amp;dn=Warlords_Battlecry_III-Razor1911&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Totenkruez","files":-1,"time":1322215689,"description":"  Join with the many races of Etheria as you fight your way through the ruins, \n  jungles and deserts of the southern continent of Keshan, searching for new \n  lands to conquer, and the treasure with which you might build an Empire. Or \n  take the role of the Ssrathi the snakemen of Keshan as they repel the \n  invaders and then unleash the full might of their empire upon the northern \n  realms!\n\n  * Persistent Heroes: Sixteen different races, twenty-eight different \n    classes.\n\n  * Retinues: To accompany your HERO in to battle.\n\n  * Full map editor: Random Maps, skirmish Mode.\n\n  * New Spells and Magic Items: More than one hundred and thirty spells over \n    thirteen different spheres of magic. New Magic Items many of them special \n    &amp; rare, some even able to cast spells.\n\n  * Five New Races: Plaguelords, Saurians, Swarm. The old Human side will be \n    split into Knights &amp; Empire. This will include new units and new \n    buildings.\n\n  * New Hero Development System: All of your old favorites plus eight new \n    classes combine together in a new hero system that is easier to learn but \n    harder to master than before. Take heroes beyond level 50. Gain levels \n    while actually playing the game.\n\n  * New Terrain: Rock &amp; Lava terrain, along with Jungle, Ruins and \n    subterranean caverns.\n\n  * New Soundtrack: High quality soundtrack featuring thematic music, all at \n    CD-Audio quality.\n\n  * Lots of New Dragons: Players will be able to produce six different \n    coloured dragons all with unique abilities and breath weapons.\n\n  * New Buildings: Many different shops will allow players to purchase items \n    &amp; troops to aid them in battle. The variety of different Lairs will \n    produce neutral units that will roam the map seeking out trouble.\n\n","torrent":{"xt":"urn:btih:3a6ec116b5d37c86564a238492e1d5713b83e2c3","amp;dn":"Warlords_Battlecry_III-Razor1911","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a6ec116b5d37c86564a238492e1d5713b83e2c3","infoHashBuffer":{"type":"Buffer","data":[58,110,193,22,181,211,124,134,86,74,35,132,146,225,213,113,59,131,226,195]},"announce":[],"urlList":[]}}