{"title":"Coollector Movie Database version 3.24.3 pre[K]racked","uid":8203019,"size":88552265,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3ae2811104beaff0c2fa7a96588ea9b919db540a&amp;dn=Coollector+Movie+Database+version+3.24.3+pre%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1362062775,"description":"Â \nOfficial Web Site: &lt;a href=&quot; http://www.coollector.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.coollector.com/&lt;/a&gt;\nTunes Web Site:  &lt;a href=&quot; https://itunes.apple.com/us/app/coollector-movie-database/id467592179?mt=12&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://itunes.apple.com/us/app/coollector-movie-database/id467592179?mt=12&lt;/a&gt;\n\nCoollector Movie Database is the only program to combine a personalized movie database with a video collection manager. The closest programs are just video collection managers.\n\nTo begin with, the program includes a huge encyclopedia of more than 100,000 movies and series. Because it's installed on your computer, you can use it even when you're offline. The interface is very easy to use. You can customize the layout to your liking, and make almost any search you can think of.\n\nThen, you'll start personalizing the database. You can rate all the movies that you've seen, to remember whether they were good or bad. You can maintain a wishlist with all the movies that you'd like to watch. You can organize your video collection, remembering what you own, where it's stored, and what you've loaned to whom. You'll soon appreciate that the movie database is personalized. Indeed, your owned movies are now highlighted, and colored icons will instantly remind you of how much you like a movie or a person.\n\nAs a movie lover, this will greatly help you when you have to pick up a movie, when watching TV, or going to the theaters. Does the movie have actors whom you like? Have you seen other movies from this director? At first glance you'll have the answer! And to help you even further in your choice, the program displays the IMDb rating and popularity of each movie, and provides a link to the trailers on Youtube.\n\nIf you're also a video collector, you'll easily list all the movies that you own. You can even scan the video files on your hard disk. They'll be added automatically, and you'll be able to play them from the program. Finally, if you want to grow your collection at the best price without missing a bargain, a database of existing videos is also included, with prices updated daily.\n\n\nWhat's New:\n\n* Added 400 movies and series.\n\n* Improved the character picture search.\n\n* Fixed a bug that prevented the program from working correctly on some unicode\n   systems (ex: chinese O.S.).\n\n\nSysten Requirements:\n\nIntel Mac, OS X.6.6 or later\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:3ae2811104beaff0c2fa7a96588ea9b919db540a","amp;dn":"Coollector+Movie+Database+version+3.24.3+pre%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ae2811104beaff0c2fa7a96588ea9b919db540a","infoHashBuffer":{"type":"Buffer","data":[58,226,129,17,4,190,175,240,194,250,122,150,88,142,169,185,25,219,84,10]},"announce":[],"urlList":[]}}