{"title":"[Clips4Sale] BareBackStudios - Dillion Carter (My Mesmerized Dau","uid":14703625,"size":511520330,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3b98788098c058cfbef2bd793ef185a9bd7bc289&amp;dn=%5BClips4Sale%5D+BareBackStudios+-+Dillion+Carter+%28My+Mesmerized+Dau&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"ImgSnaps","files":2,"time":1464337963,"description":"[Clips4Sale] BareBackStudios - Dillion Carter (My Mesmerized Daughter Part 1 &amp; 2) 720p\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/img2-5747e9e9a085d.html\r\n \nhttp://imgsnaps.com/img2-5747e9e9ad774.html\r\n\r\nMy wife Cory and my daughter Dillion went out to a local show where they did . Now that we are back home all they can talk about is how they were picked to go on stage. They remember everything how they were made to act like bank robbers, and animals. They laugh as Cory goes upstairs to change. I tell my daughter that itâ™s amazing that all he said was sleep and you went under. The moment I say sleep my daughter gives me a blank stare. Are you still I ask. She responds with a normal yes just like nothing was the matter. A shiver of excitement goes down my spine as I think of the possibilities. I bring her to the couch and make her open up her shirt. Yes daddy? she responds pulling out her large breasts for me. I make her play with them as I say now youâ™re a cow she moos with delight at feeling her utters and I get turned on by my control. Turning her back to my daughter I make her take off her panties and masturbate for me. My wife comes down stairs to see her daughter exposed for me and is livid. Youâ™re disgusting she yells before I say sleep?. I make Cory my daughter too and have her sit on the couch next to her sister. Yes daddy? they both say as I make Cory strip and masturbate too. Taking out my cock I make the girls crawl to me and suck me together. Four hands and two lips hungry pleasure my cock until I cum in my daughters mouth. I tell them itâ™s the most delicious thing in the world. It dribbles out of her mouth as Dillion and Cory kiss and lick every last drop. I wake them up, naked with a strange taste in their mouths and leave as they yell in surprise.\r\n\r\n\r\n\r\nThey next morning I quickly put my wife and daughter under to dress them in something a little less comfortable. Yes daddy they respond, putting on lingerie for me. I make Cory put on a strap on cock and watch Dillion suck her mom. I have to get in on this. Suck both of us? I tell her and her head bobs from one cock to the other jerking and sucking. Cory moans like her cock were real as Dillion works both like a pro. I bring them to the Couch and have them both strip naked. I fuck Dillion while she sucks of Mom. Her body getting rammed from both ends. I love your cock daddy. Dillion cries as she gets fucked. I fuck Dillion relentlessly until I cum inside her. I wake them both up. They canâ™t believe what they were just doing and yell in anger before I leave the room","torrent":{"xt":"urn:btih:3b98788098c058cfbef2bd793ef185a9bd7bc289","amp;dn":"%5BClips4Sale%5D+BareBackStudios+-+Dillion+Carter+%28My+Mesmerized+Dau","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b98788098c058cfbef2bd793ef185a9bd7bc289","infoHashBuffer":{"type":"Buffer","data":[59,152,120,128,152,192,88,207,190,242,189,121,62,241,133,169,189,123,194,137]},"announce":[],"urlList":[]}}