{"title":"Weeds Season 4 (2008)","uid":4425484,"size":4680843264,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3c9b192a75f0716ad8e0ce5a526dcf48b163a6a8&amp;dn=Weeds+Season+4+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JoeFish2001","files":11,"time":1223004534,"description":"Weeds Season 4 All 13 Episodes Menus &amp; Episode Selection\n\nSeason 4: 2008\nTitle \tWriter(s) \tDirector \tOriginal air date \tEpisode\n&quot;Mother Thinks the Birds Are After Her&quot; \tJenji Kohan \tCraig Zisk \tJune 16, 2008 \t1 \t38\nWith the embers of Majestic and Agrestic smoldering in their rearview mirror, Nancy and family flee southbound to the border town of Ren Mar, California. Meanwhile, the DEA interrogates Doug, Dean and Sanjay, who all pin the entire grow operation on Celia. Back in Ren Mar, Andy confronts his father and new landlord Lenny.\n&quot;Lady&amp;#039;s a Charm&quot; \tVictoria Morrow \tCraig Zisk \tJune 23, 2008 \t2 \t39\nAfter settling her family in Ren Mar, Nancy turns her attention back to business. Later, Guillermo gives her a much-needed crash course in &quot;running&quot; across the border. Meanwhile, Celia gets further acquainted with life in prison. Lenny leaves Silas and Shane to care for Bubbie while he goes to the track. When Lenny returns, Andy confronts him about some family history.\n&quot;The Whole Blah Damn Thing&quot; \tRon Fitzgerald \tDavid Steinberg \tJune 30, 2008 \t3 \t40\nNancy makes her first successful smuggling run across the border with both drugs and human cargo. Meanwhile, Captain Till strikes a deal with Celia to get her out of jail. In return, she must gather evidence to incriminate Nancy and Guillermo. Back in Ren Mar, Andy tries to convince the family, including his father, to put Bubbie out of her misery.\n&quot;The Three Coolers&quot; \tRoberto Benabib \tParis Barclay \tJuly 7, 2008 \t4 \t41\nAfter Bubbie&amp;#039;s death, the entire Botwin family sits shiva (the Jewish period of mourning) for seven days. After shiva, Nancy is sent on a mission and takes Andy along with her. Now that shiva is over and Bubbie is gone, Lenny decides to sell the house. Meanwhile, Celia continues her flirtation with Captain Till, and Doug finds refuge with the Botwins.\n&quot;No Man Is Pudding&quot; \tRolin Jones \tCraig Zisk \tJuly 14, 2008 \t5 \t42\nGuillermo gives Nancy a new job and she soon finds working retail isn&amp;#039;t as mundane as it appears on the surface. Celia&amp;#039;s deal with Captain Till brings her dangerously close to the action. Meanwhile, having been left in the desert by Nancy, Andy finds himself with a pack of immigrants and a very unfriendly Coyote. Back at home, the boys battle an infestation of bees.\n&quot;Excellent Treasures&quot; \tJenji Kohan \tJulie Anne Robinson \tJuly 21, 2008 \t6 \t43\nNancy follows the tunnel in the back of the maternity shop and sees something she shouldn&amp;#039;t at the other end. Dean takes a new job, leaving Isabelle to live with Celia. Meanwhile, Silas flirts with Lisa, and Doug falls in love with a vision of beauty who washes up on the beach.\n&quot;Yes I Can&quot; \tMatthew Salsberg \tScott Ellis \tJuly 28, 2008 \t7 \t44\nWhen Nancy is denied a share of the incoming pot by Guillermo, she decides to go over his head to Esteban. Celia discovers the cheap medication at Mexican pharmacies. Silas and Lisa (Julie Bowen) get intimate, while Shane discovers some shocking photos. Andy and Doug begin interviewing for their human smuggling operation.\n&quot;I Am the Table&quot; \tDavid Holstein &amp; Brendan Kelly \tAdam Bernstein \tAugust 4, 2008 \t8 \t45\nEsteban and Nancy&amp;#039;s spontaneous date ends in near violence. Andy and Doug successfully smuggle their first customer across the border. Silas reveals to Lisa that he grows pot, and she offers to let him do business in the back of her store. Celia develops an addiction, while Shane makes a strong first impression during his first day at a new school. Esteban and Nancy finally let their passion take control.\n&quot;Little Boats&quot; \tRon Fitzgerald \tCraig Zisk \tAugust 11, 2008 \t9 \t46\nNancy and Esteban struggle to fit each other into their busy schedules. Having discovered Shane&amp;#039;s new fantasies and Silas&amp;#039;s new girlfriend, Nancy is forced to have a talk with both of her sons. Meanwhile, Celia grows more desperate to feed her binge. And Silas continues his relationship with Lisa as they begin to expand the offerings at her cheese shop. Andy and Doug search for Doug&amp;#039;s new love in Mexico where they are confronted by El Coyote. Meanwhile, Shane attracts the opposite sex at school.\n&quot;The Love Circle Overlap&quot; \tVictoria Morrow \tJulie Anne Robinson \tAugust 18, 2008 \t10 \t47\nNancy discovers the tunnel is being used for more than drugs. Esteban allays her fears and her nagging headache with a powerful remedy. Celia&amp;#039;s family stages an intervention, forcing her into rehab. Andy locates Maria and brings her across the border to an awaiting Doug. At home, Silas babysits, while Shane explores virgin territory with his two new girlfriends.\n&quot;Head Cheese&quot; \tRoberto Benabib, Rolin Jones &amp; Matthew Salsberg \tCraig Zisk \tAugust 25, 2008 \t11 \t48\nNancy must deal with the aftermath of Shane&amp;#039;s exploits, her Ayahuasca trip, and more confrontation with Guillermo. Celia is forced to find a new, cheap, rehab facility. Doug and Maria struggle with their relationship and they both turn to Andy for help. Meanwhile, Silas&amp;#039;s &quot;sandwich&quot; business has grown too big, forcing him to turn to Nancy for help.\n&quot;&amp;#039;Till We Meet Again&quot; \tRoberto Benabib, Rolin Jones &amp; Matthew Salsberg \tMichael Trim \tSeptember 8, 2008 \t12 \t49\nA fed up Nancy squeals to the DEA to bust the tunnel while she plays it cool with Esteban. Embracing rehab, Celia sets out to make amends with her family. Andy succumbs to Maria&amp;#039;s advances, and later comes clean to Doug. Shane impresses his girlfriends with his drug scoring abilities.\n&quot;If You Work For a Living, Then Why Do You Kill Yourself Working?&quot; \tJenji Kohan \tCraig Zisk \tSeptember 15, 2008 \t13 \t50\nIn this season&amp;#039;s finale, the DEA brings Nancy in for questioning. Then she must explain things to Esteban. Andy has a personal epiphany. Celia travels deep into Mexico to make amends with estranged daughter Quinn. Meanwhile, Silas meets Lisa&amp;#039;s ex-husband; Shane starts dealing weed at his school and Doug finds a reason to live. Nancy reveals to Esteban that she is pregnant with his child.","torrent":{"xt":"urn:btih:3c9b192a75f0716ad8e0ce5a526dcf48b163a6a8","amp;dn":"Weeds+Season+4+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c9b192a75f0716ad8e0ce5a526dcf48b163a6a8","infoHashBuffer":{"type":"Buffer","data":[60,155,25,42,117,240,113,106,216,224,206,90,82,109,207,72,177,99,166,168]},"announce":[],"urlList":[]}}