{"title":"Nietzsches Thus Spoke Zarathustra","uid":5806602,"size":1378684,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cb592e61d95eddc614d65d2d38ca58fc7980955&amp;dn=Nietzsches+Thus+Spoke+Zarathustra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1283465111,"description":"Nietzsches Thus Spoke Zarathustra (Edinburgh Philosophical Guides)\n\n\nPublisher: Edinburgh University Press \nNumber Of Pages: 240 \nPublication Date: (16 Jun 2010) \n\nBurnham and Jesinghausen have provided an intelligent commentary, interspersed with brief amplifying excursions, that will help new and returning readers to disclose many meanings in the text, along its literary as well as philosophical dimensions. --Graham Parkes, translator of Thus Spoke Zarathustra\nProduct Description\n\nA step-by-step guide to Nietzsche's Thus Spoke Zarathustra. Thus Spoke Zarathustra is one of Nietzsche's greatest books, a cross-over text that combines philosophical innovation with literary experimentation. With Zarathustra Nietzsche has attempted a redefinition of the form-content correlation in philosophical writing and as such the text is considered an experiment in philosophical style. It therefore represents a large hurdle for undergraduate students. This projected commentary works on the assumption that access to the philosophical core of the text can only be gained through taking its literary ambitions seriously and that, moreover, these literary ambitions can only be understood as an attempt to realise philosophical ideas. This is a book that is designed to be read alongside Nietzsche and will therefore make the reading and appreciation of the primary material achievable. This approach will be welcomed by students and lecturers alike.      ","torrent":{"xt":"urn:btih:3cb592e61d95eddc614d65d2d38ca58fc7980955","amp;dn":"Nietzsches+Thus+Spoke+Zarathustra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cb592e61d95eddc614d65d2d38ca58fc7980955","infoHashBuffer":{"type":"Buffer","data":[60,181,146,230,29,149,237,220,97,77,101,210,211,140,165,143,199,152,9,85]},"announce":[],"urlList":[]}}