{"title":"Serj_Tankian--Orca-WEB-2013-WUS","uid":7842057,"size":41300080,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3e71a74531809728ff2a07c93cd778a68dbd8e51&amp;dn=Serj_Tankian--Orca-WEB-2013-WUS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"teiubesc37","files":8,"time":1353364170,"description":" am very excited to share my most personal, compelling musical project\nto date:  my first-ever full symphony called ORCA.  I have an incredible\nopportunity to record and perform ORCA live with the world renowned Das\nKarussell Orchestra (featuring members of the Bruckner Orchester) at\nBrucknerhaus in Linz, Austria on October 28th, 2012 and with your\ninvolvement and support, we can make it happen!\n\nMany of you know my work in rock music, between System of a Down and my\nsolo album releases.  While I have rearranged some of my past rock\ncompositions to be performed as orchestral pieces, such as the Elect The\nDead Symphony in 2010, ORCA is the first 4 act symphony that I have\ncomposed, a mix of early 20th century compositional styles combined with\nthe powerful range of film scoring. I decided to name my symphony ORCA\nbecause orcas &quot;appear to have no parallel outside humans&quot; in terms of\ntheir cultural faculties.  An orca is really a dolphin with much darker\ntendencies.  I see this dichotomy as a great metaphor for humanity.\n\nLast year, I wrote and recorded a professionally sampled studio version\nwith the goal of being able to record it properly with a full\norchestraÂ….this was not something I could capture in a small home\nstudio.  I was able to play with The Das Karussell Orchestra at\nBrucknerhaus during the Elect The Dead Symphony world tour, which was an\namazing experience.  I shared my sampled recording of ORCA with them,\nand together we made plans for the live performance and recording to\nfully bring the work to life and share and distribute it to as many\npeople as possible.\n\nWe have put together many different ways for fans to get involved and be\na part of ORCA from the ground up, all of which are outlined in this\nKickstarter campaign. We tried to think of ways to give you every bit of\nmusic possible, and interactive, personalized experiences for those who\ncan attend the show on October 28th, and for those who can't.  Our goal\nis $25,000.00, which is the minimal cost for the recording.  Any\nadditional funds will be used to cover the expenses of mixing, mastering\nand promotion.  We will keep you updated with news and progress so you\nare able to see what we do as this project grows.","torrent":{"xt":"urn:btih:3e71a74531809728ff2a07c93cd778a68dbd8e51","amp;dn":"Serj_Tankian--Orca-WEB-2013-WUS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e71a74531809728ff2a07c93cd778a68dbd8e51","infoHashBuffer":{"type":"Buffer","data":[62,113,167,69,49,128,151,40,255,42,7,201,60,215,120,166,141,189,142,81]},"announce":[],"urlList":[]}}