{"title":"David Elkind - Ties That Stress. The New Family Imbalance [1995]","uid":10115083,"size":1176526,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3eb83e3002d34b00526ed81f0a6b9a0090eca7c4&amp;dn=David+Elkind+-+Ties+That+Stress.+The+New+Family+Imbalance+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1399581021,"description":"Description\nProduct Details\nBook Title: Ties That Stress: The New Family Imbalance\nBook Author: David Elkind\nSeries: New Family Imbalance\nPaperback: 272 pages\nPublisher: Harvard University Press; New edition edition (August 20, 1998)\nLanguage: English\nISBN-10: 0674891503\nISBN-13: 978-0674891500\n\n===================================================================================\nBook Description\nRelease date: August 20, 1998 | ISBN-10: 0674891503 | ISBN-13: 978-0674891500 | Edition: New edition\nWhat has happened to the American family in the last few decades? And what are these changes doing to our children? David Elkind, renowned child psychologist and author of The Hurried Child, has devoted his career to these urgent questions. This eloquent book puts together all the puzzling facts and conflicting accounts to show us as never before what the American family has become.\n\n===================================================================================\nEditorial Reviews\nFrom Library Journal\nWell known for The Hurried Child (Addison-Wesley, 1988), Elkind focuses on the family unit in his latest publication. Supporting his arguments with a well-documented study of the family, Elkind (child study, Tufts Univ.) is critical of both the modern nuclear family for its imbalance toward the child and the postmodern permeable family for its imbalance toward the parents. The &quot;nuclear family&quot; is defined as the family of the 1950s, characterized by romantic love, unilateral authority, and domesticity. The &quot;permeable family&quot; is the current paradigm, characterized by consensual love, shared parenting, mutual authority, and autonomy. Though his critique is not unique, Elkind concludes that hope can be found for the development of the &quot;vital family&quot; to replace both earlier models. The vital family-characterized as one that &quot;energizes and nurtures the abilities and talents of both children and their parents&quot;-would combine the best of both models and would accommodate the changes in society that have been occuring at an increasingly rapid rate. An essential purchase for academic, including community college libraries, this important work also belongs in larger public libraries.\nKay Brodie, Chesapeake Coll., Wye Mills, Md.\nCopyright 1994 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\n===================================================================================\nReviews\nIn style and content...this book is addressed to the general reader...[It] seeks to answer the question: What should we do as traditional family structures seem to be crumbling?...[Elkind] thinks the solution lies with a change in parental behavior. He sees contemporary families 'stumbling' toward a new balance between the needs of the children and the needs of the parents, one that integrates the mutual responsibility of the traditional family with the freedoms of the contemporary family...Let's hope that Elkind is right. (Douglas J. Besharov Washington Post Book World)\n\nElkind...is as much a child advocate as an intellectual guru, and his dissection of what's gone wrong for children in America today is written with passion and clarity. (Washington Times)\n\nA thoughtful effort, one of the most thoughtful I have come across, to...make sense of the overpowering changes that have taken place within a generation...A powerful new analysis of how family life in general has changed over the law thirty years, altering not just the experience of childhood but that of adulthood as well...Building on a complete substructure of work in social history, psychology, and social research, Elkind develops a systematic argument for how we got from then to now, from the nuclear family of the modern period to the fragmented family of the postmodern. (Edward Shorter, Ph.D. Readings: A Journal of Reviews and Commentary in Mental Health)\n\nThis book has many strengths, the first being that it is a well-documented study of family life. The author consistently builds on his past work and cites outstanding scholars as he traces the history of family life...This book is a valuable contribution to the vast body of literature that focuses on families. It provides a clear picture of why family life has changed...[and] aids in clarifying the strengths and weaknesses of idealized family life. (Sharon J. Price Phi Kappa Phi Journal)\n\nElkind's new book sums up the changes we are all witnessing and their cost to children. A very good, worthwhile book written by someone from the `inside.' (T. Berry Brazelton, M.D., author of Touchpoints)\n\nElkind's book should be read for its contribution to understanding recent changes in the American family, and for its important, yet debatable, application of the concept of postmodernism to the family. (James T. Mathieu New Oxford Review)\n\n===================================================================================\nAbout the Author\nDavid Elkind, Professor of Child Study at Tufts University, is the author of many books, including The Hurried Child: Growing Up Too Fast Too Soon.\n===================================================================================","torrent":{"xt":"urn:btih:3eb83e3002d34b00526ed81f0a6b9a0090eca7c4","amp;dn":"David+Elkind+-+Ties+That+Stress.+The+New+Family+Imbalance+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eb83e3002d34b00526ed81f0a6b9a0090eca7c4","infoHashBuffer":{"type":"Buffer","data":[62,184,62,48,2,211,75,0,82,110,216,31,10,107,154,0,144,236,167,196]},"announce":[],"urlList":[]}}