{"title":"Dennis Hopper - The Last Movie (1971) DVDrip","uid":6651409,"size":1457580032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3ec0cd5688f36216a382057b41c4cc194b1fea62&amp;dn=Dennis+Hopper+-+The+Last+Movie+%281971%29+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1315162439,"description":"A film shoot in Peru goes badly wrong when an actor is killed in a stunt, and the unit wrangler, Kansas, decides to give up film-making and stay on in the village, shacking up with local prostitute Maria. But his dreams of an unspoiled existence are interrupted when the local priest asks him to help stop the villagers killing each other by re-enacting scenes from the film for real because they don't understand movie fakery... (IMDB.com)\n\n\nMovie-made violence, its limits and implications, is the explicit subject of Dennis Hopper's Easy Rider follow-up The Last Movie (1971), which chronicles the departure of a movie company from a small Peruvian town, leaving behind a stuntman, Kansas (Hopper), and the fascinated locals, who fashion their own cameras, lights and booms out of bamboo and start making their own &quot;film&quot;, but with real blood and real violence in place of movie fakery, and a sacrificial victim in the hapless Kansas. As a moderately clever reality-and-fiction puzzle with a sheen of anti-imperialism, the scenario has a certain pulp Pirandellan charge, but Hopper refuses to let his fictional mechanism play itself out. Rupturing the frame with time-shifts, mad montages and Brechtian distancing devices (&quot;Scene Missing&quot; cards occasionally obtrude into the action), Hopper coughed out one of the most notorious wild turkeys of auteur cinema, a critical and financial disaster that effectively ended his directing career for a decade (reverseshot.com)\n\n\nDVDrip\nEnglish hardsubs on spanish spoken parts.\n\n\nSCREENS+FILE SPECS:\n &lt;a href=&quot;\nhttp://bayimg.com/EAJHhaAdo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/EAJHhaAdo&lt;/a&gt;","torrent":{"xt":"urn:btih:3ec0cd5688f36216a382057b41c4cc194b1fea62","amp;dn":"Dennis+Hopper+-+The+Last+Movie+%281971%29+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ec0cd5688f36216a382057b41c4cc194b1fea62","infoHashBuffer":{"type":"Buffer","data":[62,192,205,86,136,243,98,22,163,130,5,123,65,196,204,25,75,31,234,98]},"announce":[],"urlList":[]}}