{"title":"[Snowboard 2009] MDP.Down.With.People.xVid.DVDrip","uid":4426253,"size":733474816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f226126fe975ccbd16638bac4e4017b423f8f5a&amp;dn=%5BSnowboard+2009%5D+MDP.Down.With.People.xVid.DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shft_play","files":1,"time":1223048837,"description":"Down With People Teaser  \tAdded on 05/29/08 by\n\nMack Dawg Productions People Crew is back at it again with our new 2008 release, Down With People. Last years movie We&amp;#039;re People Too had major successes, including Austin Smith winning TransWorld SNOWboarding Magazine&amp;#039;s &quot;Rookie of the Year&quot; and &quot;Video Part of the Year&quot; from his standout debut.\n\nExpect the same quality in Down With People with some major new additions to the crew, including Simon Chamberlain, Louie Fountain, TransWorld SNOWboarding&amp;#039;s Reader&amp;#039;s Choice nominee Joe Sexton, and rookie grunt Curtis Ciszek.\n\nMDP People&amp;#039;s focus has always been to showcase the most progressive snowboarding from individuals with heart and personality. These PEOPLE are: Austin Smith, Bryan Fox, Curtis Ciszek, Fillipo Kratter, Joe Sexton, Jon Kooley, Jordan Mendenhall, Josh Mills, Louie Fountain, Nima Jalali, Pat McCarthy, Ryan Thompson, Simon Chamberlain, Shaun McKay, Stephen Duke, and Zac Marben.\n\nDown With People locations include Lake Tahoe, Whistler, Interior British Columbia, Quebec City, Toronto, Ontario, Austria, Alaska, Sweden, Mt. Baker, Northstar at Tahoe, Sierra at Tahoe, Minneapolis, Aspen/Snowmass, Winter Park, Snoqualmie, Park City, Mt. Bachelor, and Salt Lake City.\n\nDown With People is sponsored by: TransWorld SNOWboarding, Volcom, Salomon, Quiksilver, Nomis, Etnies, Thirty Two, K2 Snowboarding, 686, Nitro, L1, and Snowstyle. ","torrent":{"xt":"urn:btih:3f226126fe975ccbd16638bac4e4017b423f8f5a","amp;dn":"%5BSnowboard+2009%5D+MDP.Down.With.People.xVid.DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f226126fe975ccbd16638bac4e4017b423f8f5a","infoHashBuffer":{"type":"Buffer","data":[63,34,97,38,254,151,92,203,209,102,56,186,196,228,1,123,66,63,143,90]},"announce":[],"urlList":[]}}