{"title":"Stephen Kinzer - Overthrow","uid":6615825,"size":218147656,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3fb2791f1be408b026838f82dd0a362d5c76b44d&amp;dn=Stephen+Kinzer+-+Overthrow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"programa","files":15,"time":1313775542,"description":"Overthrow - America's Century of Regime Change from Hawaii to Iraq\nBy Stephen Kinzer\n\n\nFormat: MP3\nBitrate: 32 Kbps\n\n\nA fast-paced narrative history of the coups, revolutions, and invasions by which the United States has toppled fourteen foreign governments--not always to its own benefit. \n\n'Regime change' did not begin with the administration of George W. Bush, but has been an integral part of U.S. foreign policy for more than one hundred years. Starting with the overthrow of the Hawaiian monarchy in 1893 and continuing through the Spanish-American War and the Cold War and into our own time, the United States has not hesitated to overthrow governments that stood in the way of its political and economic goals. The invasion of Iraq in 2003 is the latest, though perhaps not the last, example of the dangers inherent in these operations.\n\nIn Overthrow, Stephen Kinzer tells the stories of the audacious politicians, spies, military commanders, and business executives who took it upon themselves to depose monarchs, presidents, and prime ministers. He also shows that the U.S. government has often pursued these operations without understanding the countries involved; as a result, many of them have had disastrous long-term consequences.\n\nIn a compelling and provocative history that takes readers to fourteen countries, including Cuba, Iran, South Vietnam, Chile, and Iraq, Kinzer surveys modern American history from a new and often surprising perspective.\n\n\nRunning time: 15:08:47\n\n\nChapter 1  A Hell of a Time Up at the Palace\nChapter 2  Bound for Goo-Goo Land\nChapter 3  From a Whorehouse to a White House\nChapter 4  A Break in the History of the World\nChapter 5  Despotism and Godless Terrorism\nChapter 6  Get Rid of This Stinker\nChapter 7  Not the Preferred Way to Commit Suicide\nChapter 8  We're Going to Smash Him\nChapter 9  A Graveyard Smell\nChapter 10 Our Days of Weakness Are Over\nChapter 11 You're No Good\nChapter 12 They Will Have Flies Walking Across Their Eyeballs\nChapter 13 Thunder Run\nChapter 14 Catastrophic Success","torrent":{"xt":"urn:btih:3fb2791f1be408b026838f82dd0a362d5c76b44d","amp;dn":"Stephen+Kinzer+-+Overthrow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fb2791f1be408b026838f82dd0a362d5c76b44d","infoHashBuffer":{"type":"Buffer","data":[63,178,121,31,27,228,8,176,38,131,143,130,221,10,54,45,92,118,180,77]},"announce":[],"urlList":[]}}