{"title":"Metallica And Philosophy - A Crash Course In Brain Surgery By Wi","uid":7297554,"size":4076550,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ffadd9994d39bd2db8702d7f5f83968532bcec5&amp;dn=Metallica+And+Philosophy+-+A+Crash+Course+In+Brain+Surgery+By+Wi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iradins","files":-1,"time":1337933753,"description":"Editor William Irwin makes a pretty bold statement in the intro to the book when saying this about Metallica's James Hetfield: &quot;Let's set the record straight: Hetfield's lyrics are rock poetry rivaling Dylan and the Doors and more philosophically significant than the Beatles and U2.&quot;\nMetallica and Philosophy is a collection of essays from various professors and academics. They use Metallica songs and lyrics and examine different philosophers and philosophical concepts. It's part of a book series that also includes philosophical examinations of South Park, 24, Lost and many others.\n\nThis is an intriguing concept for a book, and for the most part it works. The ideal consumer of this book is a huge Metallica fan who also enjoys reading about philosophy, and I'm not sure if that's a huge market. The essays can get pretty academic and technical, but there are several that shed a lot of light on the band and their work.\n\nThe 20 different essays take on everything from alcoholism to existentialism to capital punishment to euthanasia. Metallica has an immense catalog, and it's interesting to see a few songs that were dissected and mentioned in several different chapters by different authors. The most popularly analyzed songs include &quot;Damage, Inc.,&quot; &quot;Disposable Heroes,&quot; &quot;Escape,&quot; &quot;Eye Of The Beholder,&quot; &quot;One&quot; and &quot;The Unforgiven.&quot;\n\nThis is a book with a unique viewpoint and perspective, and hardcore Metallica fans should find it an interesting read.","torrent":{"xt":"urn:btih:3ffadd9994d39bd2db8702d7f5f83968532bcec5","amp;dn":"Metallica+And+Philosophy+-+A+Crash+Course+In+Brain+Surgery+By+Wi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ffadd9994d39bd2db8702d7f5f83968532bcec5","infoHashBuffer":{"type":"Buffer","data":[63,250,221,153,148,211,155,210,219,135,2,215,245,248,57,104,83,43,206,197]},"announce":[],"urlList":[]}}