{"title":"Vascular Disruptive Agents for the Treatment of Cancer ","uid":7774220,"size":6346137,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:412c89fb13eb27907d949c93f210c1a7f6e1a186&amp;dn=Vascular+Disruptive+Agents+for+the+Treatment+of+Cancer+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1351616016,"description":"Tim Meyer, &quot;Vascular Disruptive Agents for the Treatment of Cancer&quot;\n\nEnglish | 2010 | ISBN: 1441966080 | 258 pages | PDF \n\nTumour survival and growth is critically dependent on an independent blood supply. As such tumour vasculature presents an ideal target for cancer therapy that is widely applicable, accessible and genetically stable rendering it less prone to resistance. Two approaches have been explored for cancer therapy; firstly the prevention of new vessel formation with inhibitors of angiogenesis, and secondly the destruction of existing tumour blood vessels with so called vascular disruptive agents (VDAs).\n\nWhile the first approach appears to delay tumour progression, the second has the potential to cause massive cell death and tumour regression. It is the second approach of vascular targeting that is the focus of this book. Since the tubulin binding agent combretastatin, derived from the bark of the African bush willow, was discovered by George R Pettit to have antimitotic properties over twenty years ago, the field of vascular targeting has expanded steadily. Coincident with the preclinical and clinical development of these agents, there have been advances in our understanding of their mechanism of action and in the technology required to assess their effects. This book aims to provide a comprehensive account of the current state of the art. Preclinical target identification and validation are discussed and the optimum pre-clinical animal models described. The imaging modalities that can be used to assess the efficacy of these agents are examined and a comprehensive review of the clinical development of key drugs is provided. Finally, the recent research exploring rational combinations of VDAs with other agents is reviewed and the potential place of VDAs in the future of cancer therapy is critically appraised.\n","torrent":{"xt":"urn:btih:412c89fb13eb27907d949c93f210c1a7f6e1a186","amp;dn":"Vascular+Disruptive+Agents+for+the+Treatment+of+Cancer+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"412c89fb13eb27907d949c93f210c1a7f6e1a186","infoHashBuffer":{"type":"Buffer","data":[65,44,137,251,19,235,39,144,125,148,156,147,242,16,193,167,246,225,161,134]},"announce":[],"urlList":[]}}