{"title":"Godzilla Side by Side","uid":10640140,"size":7991274713,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:41983bb7591525702934cc323ce1d6cec91169ef&amp;dn=Godzilla+Side+by+Side&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FredMSloniker","files":-1,"time":1406440738,"description":"When TransWorld Releasing Corp. brought the movie 'Godzilla' to the United States as 'Godzilla, King of the Monsters!', they made quite a few changes. A number of scenes were deleted, primarily removing American culpability for unleashing Godzilla and general anti-nuke sentiment. Many scenes were cut down for length. A number of scenes were rearranged, particularly during Godzilla's main assault on Tokyo. Finally, new scenes with Raymond Burr as an American reporter were added. 'Godzilla: Side by Side' aims to compare and contrast the original movie and the American version in the most straightforward way possible: by placing the two movies side by side, matched frame by frame, preserving every frame from both films.\n\nFirst, blank frames were inserted into each film as necessary to line them up after each instance where a scene was added or deleted. One instance of different scenes being shown simultaneously remains, however. The original had one scene dissolve into another, while the American version had a different, slightly longer scene dissolve into the other scene at a later point. Following this rule and the rule against deleting frames strictly would mean showing the Japanese scene and one dissolve, then the American scene and another dissolve (or vice versa), before the films joined up again. As both scenes, combined, are ten seconds long, an exception was made.\n\nNext, scenes that the American version relocated elsewhere in the film were returned to their original positions. Again, there were exceptions to this rule. The American version re-purposed some scenes, most notably a speech by Dr. Yamane that was given a completely different meaning. In these instances, the scenes were left in place.\n\nThe final product leaves the American version watchable, albeit with a choppy soundtrack (due to musical cues moving around as scenes were re-arranged). Laying it side by side with the original version, however, shows just how vigorously it was edited for American consumption.\n\nThe MP4 contains two audio tracks. The first uses the American audio track when available and the Japanese audio track when necessary; the second uses the Japanese audio track when available and the American audio track when necessary. The Japanese version of the movie is also subtitled.\n\nI hope that you enjoy watching 'Godzilla: Side by Side'!\n","torrent":{"xt":"urn:btih:41983bb7591525702934cc323ce1d6cec91169ef","amp;dn":"Godzilla+Side+by+Side","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41983bb7591525702934cc323ce1d6cec91169ef","infoHashBuffer":{"type":"Buffer","data":[65,152,59,183,89,21,37,112,41,52,204,50,60,225,214,206,201,17,105,239]},"announce":[],"urlList":[]}}