{"title":"Buke and Gase - General Dome (2013) [FLAC]","uid":8093195,"size":279779391,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:43f65b4286e6a7e15f3e2d870429f75221a5228b&amp;dn=Buke+and+Gase+-+General+Dome+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1359767389,"description":"\n  Buke and Gase - General Dome (2013) [FLAC]\n\n  Released: 2013\n  Duration: 42:33\n  Genre: Pop/Rock\n  Style: Post-Rock, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Houdini Crush \n  02 Hiccup \n  03 In the Company of Fish \n  04 General Dome \n  05 Hard Times \n  06 Sturtle \n  07 Twisting the Lasso of Truth \n  08 You Do Yours First\n  09 Split Like a Lip, No Blood on the Beard \n  10 Cyclopean \n  11 Contortion in Training \n  12 My Best Andre Shot\n  13 Metazoa\n\n  Very few bands are capable of completely encapsulating their sound with their writing credits quite like Buke and Gase, who open the liner notes of General Dome, their second full-length outing, with the statement that &quot;all songs improvised, organized, written, discussed, performed, discarded, recorded, and produced by Buke and Gase.&quot; This statement of purpose really captures the deconstructed and subsequently reconstructed nature of the band's lurching sound, which melds a host of fractured homemade instruments with the voice of Arone Dyer, whose vocals feel like warm honey flowing through the carefully arranged chaos created by the Brooklyn band. While it would be easy to go on endlessly about the myriad musical touchstones they pull into their work, what's really important is that their work...well...works. \n\n  The way Buke and Gase pull together no wave's sense of texture with dance-punk's ear for rhythm is impressive enough, but the cohesion and approachability of General Dome are really what make the album. Buke and Gase have found a way to push melodic boundaries without sacrificing listenability, creating an album that offers a challenge to those willing to dive into its layered sound while providing a satisfyingly rhythmic experience for the casual listener to get lost in. That isn't to say that they've watered down their sound since 2010's Riposte, but more that they've achieved a more refined sense of balance, knowing exactly where and when to push the limits while still keeping the sound grounded enough that the listener is able to get lost in the song rather than the concept.","torrent":{"xt":"urn:btih:43f65b4286e6a7e15f3e2d870429f75221a5228b","amp;dn":"Buke+and+Gase+-+General+Dome+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43f65b4286e6a7e15f3e2d870429f75221a5228b","infoHashBuffer":{"type":"Buffer","data":[67,246,91,66,134,230,167,225,95,62,45,135,4,41,247,82,33,165,34,139]},"announce":[],"urlList":[]}}