{"title":"Front Magazine Collection PDF MEGAPACK [CARG]","uid":7717640,"size":3360827596,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43fb5a49b6ad627d226b6a5feb2f9325b58c1045&amp;dn=Front+Magazine+Collection+PDF+MEGAPACK+%5BCARG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hard2Find2","files":-1,"time":1349974402,"description":"CARG Release Front Magazine Collection PDF MEGAPACK . \n\n\n\nBe sure to check out the other CARG PDF release's. To show your support for the time and effort in building this collection, Please seed at full speed during and after download so that others can also enjoy.\n\n\n\n\nThis collection contains 47 Front Magazine Pdf files. \n\n\n\nFront was first published by Cabal Communications in 1998, it was created to rival IPC's publication Loaded, catering to a demographic of 16- to 25-year-old males. It began as part of the British &quot;lads' mag&quot; genre of magazines though the covers rejects this description with the statement &quot;Front is no lads' mag&quot;. It also retains a much higher female readers' percentage than other magazines in the genre.\n \nWhilst a major selling point is the photo-shoots of models, the magazine also focuses heavily on music, films, gadgets and games, plus sections on fashion and sport. Glamour shoots within the magazine usually involve well-known models rather than celebrities.\n \nThe magazine has also been responsible for a number of high profile stunts, most notably smuggling an Eric Cantona lookalike into the Manchester United team photo during a Champions League game. Today it is edited by Steve Beech and published by The Kane Corporation who are based in Soho, London.\n \nThe Kane Corporation is led by self-made millionaire entrepreneur Dominic McVey (born 1985) and managing director of talent agency Money, Francis Ridley.\n\n\n &lt;a href=&quot;\nhttp://www.frontarmy.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.frontarmy.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:43fb5a49b6ad627d226b6a5feb2f9325b58c1045","amp;dn":"Front+Magazine+Collection+PDF+MEGAPACK+%5BCARG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43fb5a49b6ad627d226b6a5feb2f9325b58c1045","infoHashBuffer":{"type":"Buffer","data":[67,251,90,73,182,173,98,125,34,107,106,95,235,47,147,37,181,140,16,69]},"announce":[],"urlList":[]}}