{"title":"VeryPDF Office to Any Converter v2.0 Incl Keygen-BRD [TorDigger]","uid":8345865,"size":11644485,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:444e60cbca6440f8b1dc88190f1750fe121231a9&amp;dn=VeryPDF+Office+to+Any+Converter+v2.0+Incl+Keygen-BRD+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":9,"time":1365201124,"description":"Office to Any Converter\n\nOffice to Any Converter is a conversion tool for converting Office documents to other formats. It supports source MS Office documents like Word, Excel and PowerPoint, and target formats like PDF, WMF, and EMF. It also supports to convert one image to another image formats, for example, png to gif. It supports to encrypt, edit description and add watermark for converted PDF.\n\nKey Features\n\nConvert Office document to image\nOffice to Any Converter can convert Office documents to various image formats. The application supports to set the image color depth, resize the image. For the TIFF output format, Office to Any Converter also supplies many kinds of compression methods.\n\nConvert documents to PDF\nOffice to Any Converter can be used to convert any Office documents to PDF documents. It supports to encrypt, edit description and add watermark for converted PDF.\n\nEdit PDF description and encrypt PDF\nOffice to Any Converter is able to edit PDF description such as producer, creator, title, subject, author, etc. It also supports to encrypt the PDF document for security.\n\nFeatures of Office to Any Converter\n\nConvert MS Office documents to PDF files in batches.\nConvert MS Office documents to Postscript, EPS, TIFF, JPG, PNG, etc. files in batches.\nSupply various compression methods for output TIFF format.\nSupport output formats: PDF, PS, EPS, SWF, XPS, HPGL, PCL, TIF, PNG, JPG, BMP, GIF, TGA, PCX, EMF and WMF.\nAble to convert Office documents to PDF files without MS Office installed.\nAble to edit PDF description.\nOption to encrypt the PDF document.\nAble to add page number for the output PDF document.\nOption to add watermark for the PDF document.\nOption to set color depth and resize image when converting document to image.\n\nSystem Requirements:\n\nWindows 2000 / XP / Server 2003 / Vista / Server 2008 / 7 / 8 of both 32 and 64-bit.\n\nHomepage: http://www.verypdf.com/office-to-any/index.html\n\nInstallation Instructions:\n\n- Install program.\n- Use Keygen to get Valid serial for registering application.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:444e60cbca6440f8b1dc88190f1750fe121231a9","amp;dn":"VeryPDF+Office+to+Any+Converter+v2.0+Incl+Keygen-BRD+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"444e60cbca6440f8b1dc88190f1750fe121231a9","infoHashBuffer":{"type":"Buffer","data":[68,78,96,203,202,100,64,248,177,220,136,25,15,23,80,254,18,18,49,169]},"announce":[],"urlList":[]}}