{"title":"Underworld (Brad Armstrong, Wicked Pictures / 2013)","uid":8901905,"size":1514088490,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:44d4535c755bc41eac4ad84d23da44451a729fa0&amp;dn=Underworld+%28Brad+Armstrong%2C+Wicked+Pictures+%2F+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"KlixXxo","files":1,"time":1378824143,"description":"Underworld (Brad Armstrong, Wicked Pictures / 2013)\n\nWicked Pictures and award winning director Brad Armstrong take you on a journey into the UNDERWORLD. Prepare for an erotic masterpiece like no other, one that blends amazing sex, breath-taking visuals, tantalizing costumes, intriguing characters, and out of this world production design. Tanya (jessica drake) and her boyfriend Brian (Steven St. Croix) are mugged by a pair of masked men, as they walk through an underground parking structure. The robbery goes horribly wrong and Tanya is shot. She is rushed to the emergency room and the emergency medical team works feverishly in an attempt to save her life. While in her coma-like state, Tanya enters an eerie UNDERWORLD, a dream-like purgatory where lost souls go to find out their fate. Along the way she meets a cast of mystical characters, each of which relate in some way to things Tanya is experiencing in the operating room above. Every word becomes a vivid, visual image that triggers a reaction in Tanyas subconscious. Scarlet, (Asa Akira) a raven hair temptress draped in red, symbolizesthe blood that flows from Tanyas body. Slice (Xander Corvus) a ghoulish man with long knife-like fingers represents the surgeons scalpel. Mecca (Julia Ann) an automated mechanical woman, is the machinery that is keeping Tanya alive. Gauze (Capri Cavanni) beautiful woman wrapped in fabric signifies Tanya hearing the word gauze over and over in the operating room. Radius(Tommy Gunn) is a barbarian like traveler representing her shattered bones. Stitch (Asphyxia Noir) plays a mischievous doll-like vixen that plays as the sutures that repair Tanyas body. All of these characters help guide Tanya on her journey through the UNDERWORLD. Finally, Tanya meets Death (Derrick Pierce) who has come to take her. Will she be able to beg or barter for her life? Will she finish her journey and live to tell the tale? Get ready to experience the erotic movie adventure of a lifetime.\n\nAdrianna Luna, Asa Akira, Asphyxia Noir, Cameron Dee, Capri Cavanni, jessica drake, Julia Ann, Presley Hart\n\nFeature\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=uw0jjnt72qqz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=uw0jjnt72qqz.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=yx2y79z5kdek.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=yx2y79z5kdek.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:44d4535c755bc41eac4ad84d23da44451a729fa0","amp;dn":"Underworld+%28Brad+Armstrong%2C+Wicked+Pictures+%2F+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44d4535c755bc41eac4ad84d23da44451a729fa0","infoHashBuffer":{"type":"Buffer","data":[68,212,83,92,117,91,196,30,172,74,216,77,35,218,68,69,26,114,159,160]},"announce":[],"urlList":[]}}