{"title":"Jack Bruce - The Collection 1992","uid":6745611,"size":462703161,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:44f1042352fd44c67f1754261f479f4778e267b5&amp;dn=Jack+Bruce+-+The+Collection+1992&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"barber9","files":-1,"time":1318677373,"description":"John Symon Asher Jack Bruce (born 14 May 1943, Bishopbriggs, East Dunbartonshire) is a Scottish musician and songwriter, respected as a founding member of the British psychedelic rock power trio, Cream, for a solo career that spans several decades, and for his participation in several well-known musical ensembles. Best recognized as a memorable vocalist and bass guitarist, Bruce has been referred to as a World-class pioneer in his main instrument; a composer of some of the most endurable and recognisable rock songs of our time, an accomplished classical, jazz and Latin musician and one of popular music's most distinctive and evocative voices. He is also trained as a classical cellist. The Sunday Times stated: many consider him to be one of the greatest bass players of all time. (wikipedia)\n\n- - -\n\nThe composer, the singer, the multi-instrumentalist, the Legend.  Hailed as one of the most powerful vocalists and greatest bassists of his time, his improvisational skill and utterly unique, free-spirited approach to composition and performance would forever change electric music.  His pioneering, full-toned, free-wheeling playing on the electric bass revolutionised the way the instrument is used and influenced the playing of countless bassists to today, including Sting and Jaco Pastorius.  His work with bands such as Cream and the Tony Williams Lifetime, as well as his solo material, unlocked the doors to the pent-up energy of a new approach to the art of sound, breaking the barriers of tradition and creating a kind of music that had never been heard. (jackbruce.com)\n\n\n- - -\n\nJack Bruce - The Collection 1966-1974\n(Castle Communications/Polygram 1992)\n\n 1. Tales Of Brave Ulysses\n 2. SWLABR\n 3. White Broom\n 4. Politician\n 5. As You Said\n 6. Never Tell Your Mother She's Out Of Tune\n 7. Theme For An Imaginary Western\n 8. Tickets To Waterfalls\n 9. Spoonful\n10. Weird Of Hermiston\n11. Rope Ladder To The Moon\n12. He The Richmond\n13. The Clearout\n14. I Feel Free\n15. Folk Song\n16. Golden Days\n17. Running Through Your Hands\n18. Keep It Down\n19. Keep On Wondering\n20. Sunshine Of Your Love\n","torrent":{"xt":"urn:btih:44f1042352fd44c67f1754261f479f4778e267b5","amp;dn":"Jack+Bruce+-+The+Collection+1992","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44f1042352fd44c67f1754261f479f4778e267b5","infoHashBuffer":{"type":"Buffer","data":[68,241,4,35,82,253,68,198,127,23,84,38,31,71,159,71,120,226,103,181]},"announce":[],"urlList":[]}}