{"title":"Little Shop of Treasures (AllSmartGames repack)","uid":6642961,"size":27015792,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:45792b582afcd0441a082e8eb1f5d9e9cd2e7247&amp;dn=Little+Shop+of+Treasures+%28AllSmartGames+repack%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"busterthefox","files":3,"time":1314820353,"description":"I didn't create this torrent. Original repack by All Smart Games.\nI was looking for this here on Pirate Bay, but found nothing but number two, so here it is! The original! :D\n\nSimply run the installer and play. I've been playing it flawlessly for about an hour and a half, and Avast! Antivirus hasn't picked anything up.\n\nFor those who don't know, LSoT is a find the object game. The goal is to get customers the items they want to buy. However, each shop you visit is horribly cluttered, and many items are hidden so that you might pass right by them. If you can find ten items within five minutes, you're able to move on to the next round. If you can find 15, you earn a Gold star for that level!\n\nThe story is simple: you're opening an imports shop, but you spent all of your savings just to buy the building. You spend a few weeks helping local shop owners for some cash to do renovations. Once you complete your shop, you can start your business!\n\nI don't know the exact system requirements, but this is what I remember:\n\nProcessor: 233 MHz\nDirect X 8\nRAM: You'll be able to run this unless you have pretty much no RAM at all.\n\nSo yeah, overall VERY low spec game. It runs perfectly on my junker.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:45792b582afcd0441a082e8eb1f5d9e9cd2e7247","amp;dn":"Little+Shop+of+Treasures+%28AllSmartGames+repack%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45792b582afcd0441a082e8eb1f5d9e9cd2e7247","infoHashBuffer":{"type":"Buffer","data":[69,121,43,88,42,252,208,68,26,8,46,142,177,245,217,233,205,46,114,71]},"announce":[],"urlList":[]}}