{"title":"19th century american fiction on screen(pdf){Zzzzz}","uid":11394057,"size":2070148,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47341cfc16b6e238caa8f6a795574a3091f72290&amp;dn=19th+century+american+fiction+on+screen%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415318754,"description":"The process of translating works of literature to the silver screen is a rich field of study for both students and scholars of literature and cinema. The fourteen essays collected in this 2007 volume provide a survey of the important films based on, or inspired by, nineteenth-century American fiction, from James Fenimore Cooper's The Last of the Mohicans to Owen Wister's The Virginian. Many of the major works of the American canon are included, including The Scarlet Letter, Moby Dick and Sister Carrie. The starting point of each essay is the literary text itself, moving on to describe specific aspects of the adaptation process, including details of production and reception. Written in a lively and accessible style, the book includes production stills and full filmographies. Together with its companion volume on twentieth-century fiction, the volume offers a comprehensive account of the rich tradition of American literature on screen.\n\nPublisher: Cambridge University Press; 1 edition (March 8, 2007)\nLanguage: English\nISBN-10: 0521603161\nISBN-13: 978-0521603164\n\nEditorial Reviews\n\nReview\n&quot;These provocative, informative, and insightful essays open up new avenues of exploration for scholars and students, and the volume was designed with probable classroom use in mind. The book fills a gap in literary and film studies by demonstrating the role of film in what Palmer terms 'furthering the reach of honored, significant, and popular literary texts.'&quot;\n- Roger W. Smith, Studies in American Naturalism\n\nIn tandem with its companion, Twentieth-Century American Fiction on Screen (2007), this volume explores film adaptation in a format that will be handy for courses based on literary period...This is a fine addition to the literature...Recommended.\n-N. A. Baker, Earlham College, Choice\nBook Description\nThe fourteen essays collected in this 2007 volume provide a survey of the important films based on, or inspired by, nineteenth-century American fiction. Together with its companion volume to twentieth-century fiction, the volume offers a comprehensive account of the rich tradition of American literature on screen","torrent":{"xt":"urn:btih:47341cfc16b6e238caa8f6a795574a3091f72290","amp;dn":"19th+century+american+fiction+on+screen%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47341cfc16b6e238caa8f6a795574a3091f72290","infoHashBuffer":{"type":"Buffer","data":[71,52,28,252,22,182,226,56,202,168,246,167,149,87,74,48,145,247,34,144]},"announce":[],"urlList":[]}}