{"title":"Front Page Woman (Bette Davis) [1935] @! .avi","uid":4727822,"size":540705814,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4782ac5e993e3c3475e686173bd4be50b22b3463&amp;dn=Front+Page+Woman+%28Bette+Davis%29+%5B1935%5D+%40%21+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":1,"time":1234839910,"description":"       Bette Davis\t ... \tEllen Garfield\n\tGeorge Brent\t... \tCurt Devlin\n\tRoscoe Karns\t... \tToots O'Grady\n\tWini Shaw\t... \tInez Cordoza (as Winifred Shaw)\n\tWalter Walker\t... \tJudge Hugo Rickard\n\tJ. Carrol Naish\t... \tRobert Cardoza (as J. Carroll Naish)\n\nReporter Curt Devlin loves sob sister Ellen Garfield but believes women are &quot;bum newspapermen&quot;. When she learns the identity of a murdered arsonist, he calls it luck. When she goes after the murderer he gets enough evidence to have Maitland Coulter arrested. She finds a bunch of &quot;not guilty&quot; ballots and publishes the wrong story; he eavesdrops on the jury and gets the correct verdict. After being fired she gets a confession from the real killer and gets Coulter released. Written by Ed Stephan \n\nGreatly enjoyed this Betty Davis film which I had never viewed and found Davis at her very best in appearance and in a very light hearted role she portrayed as Ellen Garfield. I believe Davis was around 27 years of age when she appeared in this film and she was very charming and had a good supporting actor, George Brent, (Curt Devlin) who was a star reporter for his newspaper and was in competition with Ellen Garfield to get the big scoop or headline stopper for their respective newspapers. This couple were also love birds who had intentions to get married only under certain terms they agreed upon together, a sort of contest that would lead to some very important big steps in their lives. Veteran actor Roscoe Karns, (Toots O'Grady) was the photographer for Curt Devlin and gave a great supporting comical role through out the entire picture. This is a very enjoyable 1935 Classic film and I believe that Davis and Brent both gave outstanding performances. Enjoy. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:4782ac5e993e3c3475e686173bd4be50b22b3463","amp;dn":"Front+Page+Woman+%28Bette+Davis%29+%5B1935%5D+%40%21+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4782ac5e993e3c3475e686173bd4be50b22b3463","infoHashBuffer":{"type":"Buffer","data":[71,130,172,94,153,62,60,52,117,230,134,23,59,212,190,80,178,43,52,99]},"announce":[],"urlList":[]}}