{"title":"Exposing Myth of the Islamic Jesus","uid":4495376,"size":265018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:481f2bb75bdbf389cfd7a607fd2f355e141be15f&amp;dn=Exposing+Myth+of+the+Islamic+Jesus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IndianChristian","files":1,"time":1226171257,"description":"A must read article for Christians and Muslims. \n\nMuslims and Christians claim to believe in a Jesus whose characteristics as described by both these religions are exact opposites. In Christianity Jesus is God, in Islam he is a mere prophet. In Christianity Jesus is the Lord of Lords, in Islam he is a slave of Allah. In Christianity Jesus is a Jew speaking in the name of Yahweh. In Islam, Jesus is a Muslim speaking in the name of Allah. In Christianity Jesus was crucified and resurrected, in Islam he was not crucified nor resurrected. In Christianity Jesus came as the sacrificial lamb to die for the sins of mankind, in Islam Jesus came as a torch bearer to pave the way for the coming of Muhammad. In Christianity Jesus will come again in full glory to reign over all men, in Islam Jesus will come again with the sword to destory Jews and Christians, convert the entire world to Islam, to marry &amp; have children and then die of old age and be buried in medina.\n\nSo which is the true Jesus? Is it the Biblical Jesus or the Islamic Jesus? What are the common points between the Muslim Jesus and the Christian Jesus? What are the differences? Why are there differences? This booklet addresses all these points. \n\nAt the end, It also addresses the crux of the issue - Since there are differences between the christian and the islamic versions of Jesus, either the diciples of Jesus or Muhammad, the self proclaimed prophet of Islam must have lied about Jesus. So who lied? Was it the disciples or Muhammad? Read about it in this terrific article by Muslim turned Christian Kashmiri evangelist Rashid Alamir. \n\nThis book has come as a blessings for many Muslims who wanted to know more about Christianity. Since the Bible and the Torah are banned in Islamic societies, such material is the only known source of knowledge about Christianity for Muslims. Muslims for ages have been fed fictitious cock and bull stories about Christianity.  This book has put the cat among the pigeons for Muslims about their beliefs. And as result many Muslims have left Islam after doing their own reaseach on Islam. This book has served as the entry point for these muslims. \n\nPS: This book is also available in the &quot;The Truth about Muhammad&quot; torrent uploaded by me. It is one of the three books in that torrent.\n\nUploaded by Indian Christian\n","torrent":{"xt":"urn:btih:481f2bb75bdbf389cfd7a607fd2f355e141be15f","amp;dn":"Exposing+Myth+of+the+Islamic+Jesus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"481f2bb75bdbf389cfd7a607fd2f355e141be15f","infoHashBuffer":{"type":"Buffer","data":[72,31,43,183,91,219,243,137,207,215,166,7,253,47,53,94,20,27,225,95]},"announce":[],"urlList":[]}}