{"title":"Screenwriting Tips, You Hack: 150 Practical Pointers.pdf","uid":9373193,"size":3671330,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48533a01a9a0deeb9041cb8d4430f48c76559912&amp;dn=Screenwriting+Tips%2C+You+Hack%3A+150+Practical+Pointers.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1387567841,"description":"Xander Bennett worked as a script reader in the trenches of Hollywood, reading and covering hundreds of mediocre screenplays. After months of reading about heroic Sea World trainers, transgendered circus detectives and crime-fighting chupacabras, he couldn't take it any more. Xander started a blog called 'Screenwriting Tips, You Hack', a place designed to provide short, witty tips on screenwriting for amateur writers all the way up to journeymen scribes.\n\nThis book is the evolution of that blog. Dozens of the best tips (along with many brand-new ones) have been expanded into bite-sized chapters full of funny, insightful, highly-usable advice. Let Xander's pain be your gain as you learn about the differences between film and television structure, how to force yourself to write when you really don't want to, and why you probably shouldn't base your first spec script around an alien invasion.\nGet valuable advice from inside the system, written by a former script reader.\nGo step-by-step through the entire process of writing a screenplay, from concept to first draft to polish to marketing your script.\nExpanded tips offer real examples of what works and what doesn't, written in a witty and conversational voice.\nAdvice for all levels of screenwriter, from absolute novice to seasoned spec writer.\nA focus on Hollywood film, while also featuring extra advice for television and writers outside the US.\n\nScreenwriting Tip #99 Voice-over usually feels like scaffolding. You know - something you left in there when you were constructing the first draft, but really should have torn out after it served its purpose.\n\nScreenwriting Tip #120 Always remember that funny trumps everything. Your script could be written in crayon with your name spelled wrong on the cover, but if it's genuinely funny, none of that matters.\n\nScreenwriting Tip #156 The easiest way to write kick-ass protagonists is to make them incredibly good at what they do.\n\nConfused at the outline stage? Stuck in the swamp of Act Two? Don't know who your protagonist is or where she's going?\n\nYou might feel like a hack. But don't worry - you're not alone. Even the most experienced writers feel like this at times. Sometimes we just need a few short pointers and reminders to set us on the path again.\n\nReview\n\n&quot;Bennett's pointers cover all aspects of the writing process, beginning with the mental preparation necessary before you ever put pen to paper, or, fingers to keyboard. He then leads us through the full arc of drafting, revising, polishing, and ultimately pitching and selling your screenplay. Like most screenwriters, Bennett is well-versed in pop culture, and his movie references are a geek's delight...Unless of course, you're too much of a geek, and you notice that his reference to Rocky III teaching us that there's no easy way out actually refers to Rocky IV. Hair-splitting aside, Bennett's easy-to-apply screenwriting tips can only improve your writing.&quot;--MoviePie\n\n&quot;I've never written a screenplay, but I still believe that Xander Bennett's Screenwriting Tips, You Hack, has made me a better writer. I'm not being facetious here; Bennett's book has given me a much better appreciation for techniques of screenwriting and helped me ask questions about how I write my still-non-screenplay work.&quot;--review on DGSwartz.com\n\n&quot;Screenwriting Tips, You Hack elaborates upon close to 200 tips from the popular micro-blog that's now under the umbrella of The Black List. These great tips are compiled into helpful chapters on outlining, characters, ideas, rewriting, etc., which makes the book great for referencing when you've hit a particular roadblock in your writing. It also features a ton of helpful real-life examples, from Top Gun and Forrest Gump to Groundhog Day and Breaking Bad. Bennett's experience as a reader definitely informs his effective prose, but the book is filled with suggestions as opposed to complaints. Screenwriting Tips, You Hack is definitely a book that can help you think about your script in a new way - or help you get started on your first script!&quot;--AspiringTVWriter.blogspot","torrent":{"xt":"urn:btih:48533a01a9a0deeb9041cb8d4430f48c76559912","amp;dn":"Screenwriting+Tips%2C+You+Hack%3A+150+Practical+Pointers.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48533a01a9a0deeb9041cb8d4430f48c76559912","infoHashBuffer":{"type":"Buffer","data":[72,83,58,1,169,160,222,235,144,65,203,141,68,48,244,140,118,85,153,18]},"announce":[],"urlList":[]}}