{"title":"Fluid Catalytic Cracking VII - Materials, Methods and Process In","uid":12080401,"size":4981514,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:488409d68e789aa29b30d3dba0c1535dcfdc4b20&amp;dn=Fluid+Catalytic+Cracking+VII+-+Materials%2C+Methods+and+Process+In&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435748408,"description":"Fluid Catalytic Cracking VII - Materials, Methods and Process Innovations (Elsevier, 2007).pdf\n\nISBN: 978-0-444-53060-8\nISSN: 0167-2991\n\nSince 1987, the Petroleum Division of the American Chemical Society (ACS) has sponsored at 3 year intervals an international symposium on fluid cracking catalysts (FCC) technology. This volume collects the recent progress of this technology as reported in the papers presented during the 232th National Meeting of the ACS in San Francisco, September 10-14, 2006.\nSixty-six years after the introduction of the fluid cracking catalyst process, it remains the main process of gasoline generation for the estimated 237 millions cars on US roads. Catalysts testing and evaluation still remains a subject of interest, debate and controversy. Lambda sweep testing, testing of SOx, NOx and combustion promoters have been discussed in details together with catalyst evaluation for atmospheric residues and metal contaminated oils cracking.\nOf particular interest has been the introduction of novel concept in process design aimed at improving cracked product selectivity such as two-stage risers for better gasoline and olefins production and downer technology for high severity processes . The importance of solid state nuclear magnetic resonance (NMR) in the study of crude oils, catalysts and reaction products are illustrated by several examples. Two contributions describe the use of predictive methods to understand FCC aging and deactivation\nand personal overviews of the development of SOx and combustion promoters technology are presented. \n* Presents findings from the tri-annual international symposium on fluid cracking catalysts (FCC) technology, sponsored by the Petroleum Division of the American Chemical Society (ACS) \n* Two contributions describe the use of predictive methods to understand FCC aging and deactivation\n* Personal overviews by the authors of the development of SOx and combustion promoters technology","torrent":{"xt":"urn:btih:488409d68e789aa29b30d3dba0c1535dcfdc4b20","amp;dn":"Fluid+Catalytic+Cracking+VII+-+Materials%2C+Methods+and+Process+In","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"488409d68e789aa29b30d3dba0c1535dcfdc4b20","infoHashBuffer":{"type":"Buffer","data":[72,132,9,214,142,120,154,162,155,48,211,219,160,193,83,93,207,220,75,32]},"announce":[],"urlList":[]}}