{"title":"Green and Sustainable Pharmacy (2010) - (Malestrom)","uid":5641740,"size":3265038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48d6e08ce75c23b3316df0fe2dcb7639cbcf657b&amp;dn=Green+and+Sustainable+Pharmacy+%282010%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1277137405,"description":" &lt;a href=&quot;http://bayimg.com/kanfIaAce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/kanfIaAce&lt;/a&gt;\n\nGreen and Sustainable Pharmacy By Klaus KÃƒÂ¼mmerer, Maximilian Hempel\nPublisher: Springer 2010 | 313 Pages | ISBN: 3642051987 | PDF\n\n\n\nWithin recent years pharmaceuticals have come into focus as contaminants of the environment (see for example KÃƒÂ¼mmerer, K. editor: Pharmaceuticals in the Environment). At the same time the issue of sustainable chemistry gained momentum. Bringing both together would result in sustainable pharmacy. Sustainable pharmacy is a totally new issue and approach. It addresses environmental, economical and social aspects of pharmacy. In the present stage the focus will be on environmental issues along the whole lifecycle of a pharmaceutical entity. That is dealing with resources and energy input but also with waste issues for example during the synthesis and production of an active pharmaceutical ingredient. Furthermore, it would also look on the compounds themselves and will aim to improve the degradability of the compounds after their use in the environment to reduce the environmental risk caused by pharmaceuticals in the environment. Another issue is the people using pharmaceuticals such as pharmacists, medical doctors and patients. How can they contribute to more efficient use of pharmaceuticals with less environmental burden and less risk for drinking water. The book &quot;Sustainable Pharmacy&quot; will address all these issues and will be the first one dealing with this important topic. ","torrent":{"xt":"urn:btih:48d6e08ce75c23b3316df0fe2dcb7639cbcf657b","amp;dn":"Green+and+Sustainable+Pharmacy+%282010%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48d6e08ce75c23b3316df0fe2dcb7639cbcf657b","infoHashBuffer":{"type":"Buffer","data":[72,214,224,140,231,92,35,179,49,109,240,254,45,203,118,57,203,207,101,123]},"announce":[],"urlList":[]}}