{"title":"Flight of the Intruder -Leading Role: Danny Glover","uid":4521998,"size":736805935,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:493aa4c1a7ad4b53a8125a1c6e3e360e9031f257&amp;dn=Flight+of+the+Intruder+-Leading+Role%3A+Danny+Glover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jazz3","files":2,"time":1227201447,"description":"Movies : Action : DVD Rip : English\nMovie Description \nIn the last days of the Vietnam War, U.S. navy fighter pilots aboard an aircraft carrier have become disillusioned with the way the war is going and the pointless missions they are required to fly. Because the authorities have forbidden them from bombing strategic spots during the Paris peace talks, ace pilot Lt. Jake &amp;#039;Cool Hand&amp;#039; Grafton (Brad Johnson) and his partner, a cynical veteran bombardier named Cole (Willem Dafoe), decide to take matters into their own hands. As they plan a daring raid on the People&amp;#039;s Resistance Park in downtown Hanoi (where the Viet Cong display captured U.S. artillery), Grafton and Cole find themselves torn between their loyalty to their commanding officer (Danny Glover) and their sense of personal honor. Based on the novel by Stephen Coonts. \n\nCredits \nCast: Danny Glover \nDirector: John Milius \n\nFilm Notes \nColor by Technicolor. \n\nHanoi Matte Painting by Matte World; Hanoi Miniatures by Donald Pennington, Inc.; Model Aircraft by Eaglery Movie Stunt Models; \nAnimation and Additional Opticals by Available Light. \n\nFilmed on location on the island of Kauai in Hawaii, in Panavision. \n\nMade with the cooperation of the Department of Defense and the Department of the Navy. \n\nJohn Milius is best known for directing the classic surf film &quot;Big Wednesday&quot; and co-writing the screenplay for &quot;Apocalypse Now.&quot; \n\nThe novel &quot;Flight of the Intruder,&quot; by Stephen Coonts, was on the &quot;New York Times&quot; best-seller list for 28 weeks. \n\n","torrent":{"xt":"urn:btih:493aa4c1a7ad4b53a8125a1c6e3e360e9031f257","amp;dn":"Flight+of+the+Intruder+-Leading+Role%3A+Danny+Glover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"493aa4c1a7ad4b53a8125a1c6e3e360e9031f257","infoHashBuffer":{"type":"Buffer","data":[73,58,164,193,167,173,75,83,168,18,90,28,110,62,54,14,144,49,242,87]},"announce":[],"urlList":[]}}