{"title":"Core Rhythm Dance Exercise Program (4 DVD's)","uid":4679695,"size":12193682821,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:49f126af4ec5c3014e17848d85c49c38b625a34b&amp;dn=Core+Rhythm+Dance+Exercise+Program+%284+DVD%5C%27s%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pyrite0101","files":29,"time":1233028091,"description":"In CORE RHYTHMS FULL WORKOUT Jaana and Julia teach you the 3 Core Movements essential to Latin dancing and give you drills to exercise your core to uplifting Latin music. Jaana and Julia make it FUN to follow with their never before seen instructional help segments within the workout. This workout is for anyone who is willing to get up and move! \n\nIn CORE RHYTHMS QUICK WORKOUT, Jaana and Julia give you a workout for those days when you barely have half an hour to yourself. This workout is the same as the full workout but it has been squeezed into just 20 minutes. CORE RHYTHMS QUICK WORKOUT challenges your coordination skills, but with the help of the back view you will be moving and grooving in no time! \n\nJaana Kunitz and Julia Powers are joined by their husbands to bring you LATIN DANCE MADE EASY. In this instructional program, Bob and Julia Powers and James and Jaana Kunitz teach you 3 popular Latin dances that you and a partner can take straight to the clubs for a night out on the town! \n\nIn CORE RHYTHMS KICK START you can truly work at your own pace. For the first time ever, you can learn world class slimming dance moves literally one step at a time! This one of a kind program takes you step by step through the basic movements that will give anyone the body of a dancer. You can choose from different views of the workout and follow the beat of the music with a visual on-screen aid.","torrent":{"xt":"urn:btih:49f126af4ec5c3014e17848d85c49c38b625a34b","amp;dn":"Core+Rhythm+Dance+Exercise+Program+%284+DVD%5C%27s%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49f126af4ec5c3014e17848d85c49c38b625a34b","infoHashBuffer":{"type":"Buffer","data":[73,241,38,175,78,197,195,1,78,23,132,141,133,196,156,56,182,37,163,75]},"announce":[],"urlList":[]}}