{"title":"Sexual Liberty Now (1971)","uid":5372681,"size":680876032,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4a638e90f85a848d7a9618921fea4cafeddfd74e&amp;dn=Sexual+Liberty+Now+%281971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1266482176,"description":"Sexual Liberty Now (1971)\n &lt;a href=&quot;\nhttp://www.imagengratis.org/images/sexuallibe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagengratis.org/images/sexuallibe.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0257160/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0257160/&lt;/a&gt;\n\nStudio  After Hours Cinema \nRelease Date  1971\nCategory  Clasicc \nDirector  John Lamb\nStarring  Ron Gans, Fr. Morton Hill, Bodil Joensen, Lyndon Johnson \n\nThe film is bookended with an Adam and Eve (Uschi Digard) couple in the forest to set the tone of the film, that what we are to see is entirely natural. Stringing together clips of magazine covers, interviews, and some clinical films of how the reproduction system works, all in an effort to enlighten us about how sex liberates us from violence and sex crimes. There is nothing sexually stimulating about this film, nor is it interesting enough to want to &quot;learn&quot; from it or even motivating to want to get on the bandwagon that sex on films are beneficial. The major motivation for the film seems to be an excuse for the final sequences where we finally get to see some genital contact, yet by this time, it is innocuous and overtly clinical to have a real argument about &quot;sexual freedom&quot;, presumably it's initial intent.\n\nReleased in 1969 from writer, cinematographer and director John Lamb (MERMAIDS OF TIRBURON) SEXUAL FREEDOM IN DENMARK is styled from the &quot;white coater&quot; genre, otherwise known as a &quot;Marriage Manual&quot;. Designed specifically for the married couples can learn from pornography and enhance their sex life, rather than shy away from sexual arousal depicted on the big screen. The other aim of the film was an attempt to suggest through statistics and testimony that watching pornography does not corrupt people's minds, but enlivens them to be more playful in their sexual acts. Nudity is not a crime! (a new bumper sticker?) But these ideas are lost by the time the movie comes to a close and there is no turning back.\n\nOn-screen interviewer, Olle Lassen, in and around Copenhagen, questions a girl on the street, a former Miss Denmark, a famous journalist and a bunch of nude women shooting a movie, about the social morals of sexuality - all to no real effect. An omniscient voice throughout the film attempts to convince us that watching &quot;erotica is no more anti-social than bird watching or stamp collecting.&quot; The dialogue is spoken in English, so it is evident this was for American audiences to show to us how free those crazy Denmarkians are and that we need to loosen up! Yet, this film is so tightly wound up in making sure it remains in an educative role that I am hard pressed to believe that Denmark is the place to liberate your senses.\n\nAfter watching all these nudist camps and nude pageants, the film degrades into how the reproductive system works. Then we are then shown childbirth, various body types leading the way into physical differences of penises and vaginas, presented in a clinical setting. Perhaps the most unsettling and disturbing image is a 5-second clip of diseased genitals. It is enough to put you off for weeks.\n\nBy today's standards, much of this is already known by the majority of people and so I feel like I am back in health class, so it is not very fascinating. Although, I don't think I was privy to seeing actual genital penitration in my health class, especially seeing fornication while sitting on a chair. It is in these last scenes that we see a few couples perform various positions and techniques, with our humble narrator, droning on end about the proper ways of copulation; seeding the ovum and use of contraceptives (an uncredited Suzanne Fields makes her appearance). \n\nI usually enjoy exploitation films as they tend to be ridiculous and funny. SEXUAL FREEDOM IN DENMARK takes itself a little on the serious side to have any fun with it. I agree with Michael J. Bowen who writes &quot;the movie, in sum, is a kind of &quot;mondo&quot; film dotted with occasional glimpses of actual genital contact&quot;, as if we are seeing sex for the first time in the most natural environment. Yet, all of the explicit sex are couples in this pure white, sanitary environment! For audiences today, it might be fitting for a 40-year old virgin who just got married, but otherwise it is strictly for the curious connoisseur. \n\nDirector John Lamb's success with this film (2 million at the box office) led to his second sex education film, SEXUAL LIBERTY NOW! Seemingly a sequel, however, this is one film that has just as much product as promise. Anytime a film begins with a close-up of a penis pile-driving a pussy, coupled with an off-screen narration of a biblical quote (complete with god-like voice), has my immediate attention. \n\nStarting off with a bang (well, how would you start?), set to some groovy tunes while swinging couples get it on with each other, shows just how much fun sexual liberty can be! But those pesky beaurocrats keep getting in the way. They have strong opinions and we must listen to them. They obviously do not like pornography and find it completely immoral, distateful and evi. We know they don't like sex because they are still wearing their clothes. \n\nOn the lighter side, however, while our incongrous narrator continues to explain to us that pornography is not harmful, we get to see loads of fellatio, coitus and all those other swell Latin words.\n\nSEXUAL LIBERTY NOW! does not have anything different to say politically from the previous film, but it certainly has a lot more to show. It goes as far to support that pornography is healthy by talking to a priest who has screenings with groups of people because sex is our god-given right. Otherwise the film is a cornucopia of various tidbits of erotica from all different lands and eras. I don't know who would be listening to the narrator in this film, but I am sure whatever he is saying, it's real important.\n","torrent":{"xt":"urn:btih:4a638e90f85a848d7a9618921fea4cafeddfd74e","amp;dn":"Sexual+Liberty+Now+%281971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a638e90f85a848d7a9618921fea4cafeddfd74e","infoHashBuffer":{"type":"Buffer","data":[74,99,142,144,248,90,132,141,122,150,24,146,31,234,76,175,237,223,215,78]},"announce":[],"urlList":[]}}