{"title":"An Illustrated Guide to Veterinary Medical Terminology 3rd Ed ","uid":12046864,"size":43107222,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a929c87520f60c5994e14e16815c42b7e07a5d4&amp;dn=An+Illustrated+Guide+to+Veterinary+Medical+Terminology+3rd+Ed+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1434916659,"description":"Publisher: Cengage Learning; 3 edition (December 22, 2008)\nLanguage: English\nISBN-10: 1435420128\nISBN-13: 978-1435420120\n\nAn Illustrated Guide to Veterinary Medical Terminology, Third Edition provides a visual approach to learning medical terms and understanding the basics of veterinary medicine. A systematic process of breaking down medical terms into their component parts allows readers to comprehend the root medical concepts and apply critical thinking skills when faced with new and unfamiliar medical terminology. Chapters progress from basic terminology related to anatomical positioning to body systems, and then to species- specific terminology. Case studies exemplify how medical terminology would be experienced in an actual veterinary practice.\n\nAbout the Author\n\nJanet Romich, a longtime veterinarian, teaches a variety of science-based courses at Madison Area Technical College in Madison, Wis., where she was honored with the Distinguished Teacher Award in 2004 for use of technology in the classroom, advisory and professional activities, publication list, and fundraising efforts. She is also an IACUC member for a hospital research facility and received the Wisconsin Veterinary Technician Association's Veterinarian of the Year Award in 2007 for her contributions to the education of veterinary technician students and in promoting the use of veterinary technicians in the workplace. Dr. Romich is also the author of FUNDAMENTALS OF PHARMACOLOGY FOR VETERINARY TECHNICIANS, 2e and UNDERSTANDING ZOONOTIC DISEASES as well as a co-author on DELMAR'S VETERINARY TECHNICIAN DICTIONARY. She received her Bachelor of Science degree in animal science from the University of Wisconsin-River Falls and her Doctor of Veterinary Medicine and Master of Science degrees from the University of Wisconsin-Madison. She remains active in veterinary practice through her relief practice, where she works in both small- and mixed-animal practices","torrent":{"xt":"urn:btih:4a929c87520f60c5994e14e16815c42b7e07a5d4","amp;dn":"An+Illustrated+Guide+to+Veterinary+Medical+Terminology+3rd+Ed+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a929c87520f60c5994e14e16815c42b7e07a5d4","infoHashBuffer":{"type":"Buffer","data":[74,146,156,135,82,15,96,197,153,78,20,225,104,21,196,43,126,7,165,212]},"announce":[],"urlList":[]}}