{"title":"The_economist_screensaver.exe","uid":3936782,"size":18032612,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b0645a1761d90fd7439963f1791f81c6bfc35cc&amp;dn=The_economist_screensaver.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"turdferguson7857","files":1,"time":1197850193,"description":"The Economist Screensaver is a treasure trove of fascinating data on 66 of the world&amp;#039;s major economies. Drawing on the 2007 edition of the bestselling \u001cPocket World in Figures\u001d, it presents facts and figures on population, demographics, the economy, society, health and education around the world. The screensaver also features a ticker displaying the headlines of new articles published on Economist.com, as well as some of the witty one-liners used in The Economist&amp;#039;s renowned advertising campaigns. Notes on the data and definitions used in the screensaver are here.\n\nGlobe\nThe screensaver displays a globe that begins rotating on start up. After one minute of inactivity, the globe will stop rotating and data for a randomly selected country will be displayed. After a further 20 seconds of inactivity, the globe will resume rotating. After five minutes Economist advertising slogans will begin to appear.\n\nCountries can be selected manually by clicking on them (data is available only for those countries which appear highlighted in red). To rotate the globe manually, click on the arrows either side of it. Click on the magnifying glass icon below the globe to turn the zoom function on and off.\n\nClocks\nFour clocks at the top of the screen display the time locally, in New York (EST), London (GMT) and Hong Kong.\n\nArticle headlines\nNew articles published on Economist.com are highlighted in the display panel at the bottom of the screen. Click on a headline to view the full article.\nDisclaimer\n\nWhile every effort has been taken to ensure the proper operation of The Economist Screensaver, The Economist Newspaper Limited cannot accept any responsibility or liability for reliance by any person on this information or for the operation or functionality of the screensaver. Click here to read the full terms and conditions regarding the screensaver.","torrent":{"xt":"urn:btih:4b0645a1761d90fd7439963f1791f81c6bfc35cc","amp;dn":"The_economist_screensaver.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b0645a1761d90fd7439963f1791f81c6bfc35cc","infoHashBuffer":{"type":"Buffer","data":[75,6,69,161,118,29,144,253,116,57,150,63,23,145,248,28,107,252,53,204]},"announce":[],"urlList":[]}}