{"title":"Valerie 1957 DVdRip Mp4 Lee1001","uid":9823502,"size":856518419,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4b1d0960b90caadf4309d6ab1f1704d709757923&amp;dn=Valerie+1957+DVdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xultfoad","files":2,"time":1395730846,"description":"Valerie 1957 DVdRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0051149/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0051149/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Valerie_%281957_film%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Valerie_%281957_film%29&lt;/a&gt;\nValerie is an American western first released on 1st August 1957, directed by Gerd Oswald. The film stars Sterling Hayden, Anita Ekberg, Anthony Steel, Peter Walker and John Wengraf. \n\nHayden turns in one of his best chores in years, while Ekberg impresses as an actress as well as a scenic wonder.\n\nA noir in a western's clothing\n\nThis strange and forgotten gem begins with John Garth (Hayden), a cattle rancher, showing up at his in-laws' house. He goes in, shots are fired, then he comes out and quietly leaves the scenes. No words are spoken. Then, the camera follows a dog inside the house, where we pan across the dead bodies of the old man and woman and we pause on Anita Ekberg's wounded body in an armchair, an image which remains in the background of the opening credits. The rest of the movie uses Garth's trial as a plot device for a &quot;Rashomon&quot;-style account of Civil War veteran John Garth's marriage to Valerie Horvat (Ekberg), the daughter of two immigrants. Firstly, we hear it from the point of view of the new preacher (Anthony Steel), who kinda falls in love with Valerie, then from Garth's perspective and, finally, Valerie tells it. \n\nA rather interesting and naturally from director Gerd Oswald, technically quite solid. Sterling Hayden gives another off-beat tough-guy performance, while Anita Ekberg is nicely effective as either the devoted wife...or the slutty whore. I'm highly recommending Valerie. \n\nHayden was a genuine adventurer and man of action, not dissimilar from many of his movie parts. He dropped out of high school at the age of 16 and took a job as mate on a schooner.[5] His first voyage was to Newport Beach, California from New London, Connecticut.[4] Later, he was a fisherman on the Grand Banks of Newfoundland, ran a charter yacht, and served as a fireman on eleven trips to Cuba aboard a steamer.[4] He skippered a trading schooner in the Caribbean after earning his master's license, and in 1937 he served as mate on a world cruise of the schooner Yankee.[4] After serving as sailor and fireman on larger vessels and sailing around the world several times, he was awarded his first command aged 22, skippering the square rigger Florence C. Robinson 7,700 miles from Gloucester, Massachusetts, to Tahiti in 1938\n\nSailor,Marine,OSS agent ,Actor and acclaimed writer\n\nVIDEO\nSize.... 816mb\nDuration.... 01:22:10\nCodec.... h264\nFrame Width..... 640\nFrame Height.... 480\nData Rate.... 1256kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 128kbps\n2 Channel Stereo\nAudio Sample Rate.... 44KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:4b1d0960b90caadf4309d6ab1f1704d709757923","amp;dn":"Valerie+1957+DVdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b1d0960b90caadf4309d6ab1f1704d709757923","infoHashBuffer":{"type":"Buffer","data":[75,29,9,96,185,12,170,223,67,9,214,171,31,23,4,215,9,117,121,35]},"announce":[],"urlList":[]}}