{"title":"Xev Bellringer - Mommy Gives You a Shower [1080p]","uid":13537805,"size":1487057076,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4b6032d99eb89d50262bb6449dbf520b6fa5a973&amp;dn=Xev+Bellringer+-+Mommy+Gives+You+a+Shower+%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxsunset","files":1,"time":1455451432,"description":"Screenshots: \nhttp://imgur.su/image/Mo20\r\n\r\nI'm so sorry that I couldn't take you to the hospital, I won't let work get in the way of being a better mother anymore. My poor baby, your hands are all bandaged up, does it hurt? Are you hungry? The doctor said you can't do a lot of normal everyday tasks and that I'd have to help feed you...and some private things like going to the bathroom and taking a shower.\r\n\r\nI know, I know baby but it's only for a few weeks, ok? It'll be embarrassing at first, but the doctor said many mothers have had to do this for their sons. If they can do it, we can too sweetie. I see the hospital did nothing to clean you up so why don't you go upstairs so I can wash you.\r\n\r\nHoney, you will have to put your modesty aside, I'm sure nothing has changed much since I saw you naked last. See? You're...practically the same...eh hem, why don't you hop in, the water's warm now. Let's soap you up here...and down your legs. Oh dear, my top got all wet...I'm going to have to take it off so it won't be damaged.\r\n\r\nUm...sweetie....you've got an erection. It's ok, I suspected this might happen. I have to wash it though honey, there's no way you can go three weeks without cleaning down there. I think the cloth is too harsh on your sensitive penis...I'll just use my hands ok? There... let's rinse and dry you off.\r\n\r\nYou know, honey...I don't think your erection will go away on it's own. And...you can't handle it yourself. Such a hard cock must be painful too, I should really make it feel better for you, baby. Just slip it into Mommy's mouth mmmph.\r\n\r\nYou can make me happy too, baby. If you just put it in my pussy it'll--OHH!! Oh God, baby that feels so good. You're going to cum already? Not my Mommy's pussy sweetie. Right before you cum, pull it out and spray your semen on my face, ok?","torrent":{"xt":"urn:btih:4b6032d99eb89d50262bb6449dbf520b6fa5a973","amp;dn":"Xev+Bellringer+-+Mommy+Gives+You+a+Shower+%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b6032d99eb89d50262bb6449dbf520b6fa5a973","infoHashBuffer":{"type":"Buffer","data":[75,96,50,217,158,184,157,80,38,43,182,68,157,191,82,11,111,165,169,115]},"announce":[],"urlList":[]}}