{"title":"(2013) Koji - Crooked In My Mind [FLAC] {100.XY}","uid":10511885,"size":245816453,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4be5b4abacbd451cad0bc97c5c0786b11b02e2b1&amp;dn=%282013%29+Koji+-+Crooked+In+My+Mind+%5BFLAC%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"100.XY","files":-1,"time":1404855030,"description":"(2013) Koji - Crooked In My Mind\n\n\nWikipedia:\nKoji (born Andrew Koji Shiraki, February 12, 1987, Harrisburg, Pennsylvania, United States) is an American songwriter and activist.\n\n\nReview:\nKoji has always impressed upon me deeply. His music and words grind away and rile inner turmoil because of how evocative they are. His acoustic medleys strip you down to the bare essence of what makes you tick and here, he continues to plug away at the gaps in the soul with a pleasant effort in Crooked In My Mind. It's filled with nostalgia, conviction and it doesn't let up when it comes to Koji's manner of swaying you with his musical prose.\n\n&quot;Chasing A Ghost&quot; is his acoustic diary of romance and its affiliated nuances. As an artist, activist and adventurer from Pennsylvania, his brand of post-punk/indie music shines here as per the usual - warm, alternative strokes of the paintbrush. His strumming is so peaceful and if you're desirous of strong storytelling, his clean and soft voice is more than an honest tradeoff for the electric noise. Too many of these tracks can be tedious, and understandably so, but he's adaptable per song and it prevents any wear and tear from setting in. Maybe he could have reduced the number of songs but then again, his formula works. You can see why he's been around the likes of La Dispute and Into.It. Over.It and he comes off like a cross-pollination of Johnny Rzeznik and Elliot Smith.\n\n&quot;Spinning Silent&quot; in its lush, steady build eventually crescendos into something more uptempo with soft 'whoa-ohs' as Koji spills on emotional wrecks in his life. He loves to swing these tunes to the softer spots of the listener and he fabricates this emo-ether with such ease. It's debatable if all acoustic artists, or most, specifically target touchpoints of introspection but Koji definitely contends as one who deserves his spot as a passionate lyricist. This track mentions the intermediate struggles in life, as he talks about grinding away gingerly and wincing for the inevitable collisions in the world. The eventual loss, pain and anguish are felt in his sorrowful words. What strikes consistently is that his voice carries the spine of all the tracks, rather than the guitar. He builds around his vocal pattern in songs like &quot;Fragile Times,&quot; a testament to this in its own mellowing and grim tone. It's nothing incredibly unique, but it fits.\n\nI still think the record should have been one or two tracks shorter but it's not that detrimental as it closes off. &quot;In The Line&quot; has a nice western-slinging ballad feel to it as Koji's tamed disposition matches a nice, crisp piece of percussion to put a little oomph into the record, as the cymbals would signify. They blend and match to his delivery so well. The timing's spot on, which is evident when you look at the production of the album in its entirety. Back in 2011, I balked at the drastic notion and ideology of such artists like Koji. As I matured, I realized his ability to use an album such as this as a conversational piece to allay one's fear in and of the world. More so, a lot of his stuff is personal and relatable, and that's the crux of Koji. All his records show this and Crooked In My Mind doesn't fail to disappoint.\nReview by RENALDO69 @ punknews.org\nRate 4/5\n\n\n\n\n\nTrack List:\n1. Chasing a Ghost 4:02\n2. The Near and Far 3:46\n3. Spinning Silent 3:13\n4. Distance/Divide 3:32\n5. Fragile Times 3:18\n6. Creeping 3:31\n7. In the Line 3:13\n8. Pang and Flash 4:32\n9. What You Leave Behind 5:17\n\n\nSummary:\nCountry: USA\nGenre: Indie,Folk\n\n\nMedia Report:\nSource : CD\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 16-bit PCM\nBit rate mode : Variable\nBit rate : ~ 837-1000 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nBit depth : 16 bits\n","torrent":{"xt":"urn:btih:4be5b4abacbd451cad0bc97c5c0786b11b02e2b1","amp;dn":"%282013%29+Koji+-+Crooked+In+My+Mind+%5BFLAC%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4be5b4abacbd451cad0bc97c5c0786b11b02e2b1","infoHashBuffer":{"type":"Buffer","data":[75,229,180,171,172,189,69,28,173,11,201,124,92,7,134,177,27,2,226,177]},"announce":[],"urlList":[]}}