{"title":"Mozilla FireFox v12.0 Portable[Team Nanban][TPB]","uid":7206152,"size":29266203,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4c6f91277851e46ba10a598d423ff74953495e22&amp;dn=Mozilla+FireFox+v12.0+Portable%5BTeam+Nanban%5D%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"594mgnav","files":3,"time":1335102476,"description":"Mozilla FireFox v12.0 Portable[Team Nanban][TPB]\n\nDESCRIPTION:\n\nMozilla Firefox - Without a doubt the best web browser of all time. It's fast, reliable, easy to use and \nhighly secure free browser. One of the main advantages of the browser Mozilla Firefox - the flexibility and extensibility. \nSimple and concise, but at the same time easy to use interface allows you to master the program in minutes.\n\nThe main advantages of Mozilla Firefox:\n- Convenient bookmarks toolbar, which allows one click to create a bookmark or go to your favorite site and \nfind the title of the latest news.\n- Integrated search bar that allows you to locate information in various search engines. \nThe number of search engines can be increased by installing the necessary plugins.\n- Tab. Ability to view and interact with multiple sites at once in separate tabs of a browser window.\n- Automatic updates. In most cases, the size of the updates, no more than a few hundred kilobytes.\n- Protection of privacy. One click of the mouse, you can delete all personal data: browsing history, cookies, \nWeb form data, passwords ...\n- Safe on the Internet navigation. Firefox stores your privacy and protects against viruses, spyware and pop-ups. \nAnd with instant identification of websites Firefox will block access to websites online scams, dangerous trades and forgery.\n\n- The full scale. Ability to view any part of the web page in a larger size.\n- Support for RSS. The ability to create bookmarks.\n- Extensibility. Mozilla Firefox - the browser that has the largest number of add-ons (plugins). \nYou can customize the toolbar to put the additional modules and themes. Using Mozilla Firefox plug-ins turned \nfrom a small compact browser in a beautiful multi-purpose tool for exploring the World Wide Web.\n\n\nPLZ SEED AFTER DOWLOADING...\n\n&quot;SHARING IS CARING&quot;\n\nif u like my releases, then plz add +rep to me in this link.\n          &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=277915&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=277915&lt;/a&gt;\t","torrent":{"xt":"urn:btih:4c6f91277851e46ba10a598d423ff74953495e22","amp;dn":"Mozilla+FireFox+v12.0+Portable%5BTeam+Nanban%5D%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c6f91277851e46ba10a598d423ff74953495e22","infoHashBuffer":{"type":"Buffer","data":[76,111,145,39,120,81,228,107,161,10,89,141,66,63,247,73,83,73,94,34]},"announce":[],"urlList":[]}}