{"title":"Astrid Williamson - Boy For You [1998][EAC,log,cue. FLAC]","uid":8753678,"size":307341268,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4fe47b87b4bd3e220fcd6ec72eab572c20acb5ed&amp;dn=Astrid+Williamson+-+Boy+For+You+%5B1998%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":12,"time":1375097184,"description":"Artist: Astrid Williamson\nRelease: Boy For You\nReleased: 1998\nLabel: Nude Records\nCatalog#: NUDE 10CD\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Alternative Pop/Rock\n\n1. I Am The Boy For You \n2. Everyone's Waiting \n3. What Do You... \n4. World At Your Feet \n5. Sing For Me \n6. Someone \n7. Hozanna \n8. If I Loved You \n9. Outside \n10. Say What You Mean \n11. If You See The Man\n\n\nNow solo after Goya Dress quietly called it a day -- after the group's lone album, the luscious, John Cale-produced Rooms -- Astrid Williamson's abilities as a first-rate writer, considered lyricist, and stunning vocalist remain obvious. Yet it seems Williamson is condemned to being a fringe favorite -- despite more favorable press -- and a nonentity in the U.S., lacking domestic release. Boy for You, a rumination on unrealistic lifestyles and relationship expectations, drips substance while surveying the different moods Williamson's voice can fill. The somber, mostly piano songs are lush tapestries of reflective, moody chamber sound. Some of the acoustic, full-band numbers would tickle a Joni Mitchell fan. The overtly sexual &quot;If I Loved You&quot; and &quot;Everyone's Waiting&quot; are wistful, sun-drenched, welcoming pop tunes. Others like &quot;Outside&quot; and &quot;I Am the Boy for You&quot; survive, nay, prosper, despite a vague attempt at instant currency via hip-hop beats. In fact, on the latter, she uses the big beat to fashion a hypnotic sway instead of a dancefloor shake and, in the choruses, lets out one of those trademark, ascending, full-mouthed wails, stopping all traffic. We're talking wondrous belting, the kind that freezes. &quot;World at Your Feet,&quot; &quot;Sing for Me,&quot; and &quot;Say What You Mean&quot; touch places inside that leave one in shaken contemplation. The production crystallizes perfectly behind the flowing, burbling melodies and that voice. Best of all, these are the songs where the piano's most melancholic chords fit best with the ringing acoustic strum, while pungent, swelling background organ hypnotizes. It all adds up to a record that at its most average is still marvelous, and at its best is like the most involving film you've seen this year. You say you want substance over style? What would you give for both at once?","torrent":{"xt":"urn:btih:4fe47b87b4bd3e220fcd6ec72eab572c20acb5ed","amp;dn":"Astrid+Williamson+-+Boy+For+You+%5B1998%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe47b87b4bd3e220fcd6ec72eab572c20acb5ed","infoHashBuffer":{"type":"Buffer","data":[79,228,123,135,180,189,62,34,15,205,110,199,46,171,87,44,32,172,181,237]},"announce":[],"urlList":[]}}