{"title":"Ashampoo MP3 Check &amp; Convert","uid":3375118,"size":1780869,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5067601a1e1e30c1b5339146a2cc48ddea5fda9a&amp;dn=Ashampoo+MP3+Check+%26+Convert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"corodam","files":1,"time":1125081823,"description":"Ashampoo MP3 Check &amp; Convert \n\nFrench:\n    * Fonction de s&amp;eacute;lection am&amp;eacute;lior&amp;eacute;e pour l?analyse et la conversion de fichiers\n    * Fonction de tri am&amp;eacute;lior&amp;eacute;e pour les pistes Audio plus longues\n    * Nombre d?am&amp;eacute;liorations &amp;laquo; sous le capot &amp;raquo;\n\nAshampoo MP3 Check &amp; Convert 2.0 est un outil simple mais tr&amp;egrave;s puissant pour travailler avec des fichiers Audio MP3.\n\nSi vous utilisez des fichiers MP3 que vous n?avez pas produits vous-m&amp;ecirc;me, vous aurez sans doute rencontr&amp;eacute; de nombreux probl&amp;egrave;mes lors de leur gravure pour en faire des CD Audio. Ceci est le cas lorsque les fichiers MP3 sont corrompus ou qu?ils ne sont pas compatibles avec le format de CD Audio. Ashampoo MP3 Check &amp; Convert 2.0 met fin une fois pour toutes &amp;agrave; ces probl&amp;egrave;mes !\n\n    * Analyse : Effectue une v&amp;eacute;rification rapide en s&amp;eacute;rie (batch mode) de n?importe laquelle ou de toutes vos pistes MP3 pour identifier les probl&amp;egrave;mes, dommages, mauvais &amp;eacute;tat et compatibilit&amp;eacute; avec le format CD Audio.\n    * Transfert: Tous les fichiers MP3 identifi&amp;eacute;s comme pouvant &amp;ecirc;tre une source de probl&amp;egrave;mes peuvent &amp;ecirc;tre transf&amp;eacute;r&amp;eacute;s automatiquement dans un dossier s&amp;eacute;par&amp;eacute; d&amp;eacute;fini &amp;agrave; cet effet.\n    * Conversion vers WAV : Convertissez rapidement un ou plusieurs fichiers MP3 vers le format WAV - pour, par exemple, &amp;eacute;liminer les dommages et pouvoir ensuite les graver pour en faire un CD Audio.\n    * Conversion vers MP3 : Conversion de haute qualit&amp;eacute; rapide de fichiers WAV vers MP3 ? pour, par exemple, les graver vers des CD MP3 que vous pourrez lire sur de tr&amp;egrave;s nombreux lecteurs de DVD.\n\n \n \n\nAshampoo MP3 Check &amp; Convert 2.0 est un additif parfait &amp;agrave; votre programme de gravure de CD ! Il identifie des fichiers MP3 d&amp;eacute;fectueux et incompatibles rapidement et facilement, fichiers qui n?auraient pas manqu&amp;eacute; de faire des probl&amp;egrave;mes lorsque vous essayez de les graver sur CD.\n\nMais ce n?est pas tout : En quelques clics souris vous pouvez &amp;eacute;galement convertir une ou plusieurs pistes MP3 en fichiers WAV et des pistes WAV en pistes MP3. Il est difficile d?imaginer une interface utilisateur plus simple ? vous v&amp;eacute;rifierez et convertirez comme un professionnel en quelques minutes.\n\nNe pas pouvoir graver une piste est d&amp;eacute;cevant, mais ce qui est encore pire est de graver un CD et de se rendre compte que certaines des pistes MP3 sont illisibles pour votre lecteur de DVD. Cet outil superbe vous permet d?identifier de fa&amp;ccedil;on fiable ce genre de probl&amp;egrave;mes MP3.\n\nQue voudriez-vous faire apr&amp;egrave;s avoir identifier les pistes causant des probl&amp;egrave;mes ? Juste ! Les r&amp;eacute;parer ! Gr&amp;acirc;ce &amp;agrave; Ashampoo MP3 Check &amp; Convert 2.0 vous pouvez convertir des fichiers MP3 corrompus et incompatibles en fichiers WAV standard. Ce faisant, il &amp;laquo; filtre &amp;raquo; automatiquement les probl&amp;egrave;mes ? il vous suffit ensuite de convertir ces fichiers WAV nettoy&amp;eacute;s pour en faire des pistes MP3 parfaitement compatibles que vous pourrez graver sur votre graveur et jouer sur votre lecteur de DVD. Ici aussi, il vous est possible de convertir un fichier, plusieurs fichiers voire la totalit&amp;eacute;s des fichiers de votre liste.\n\nAshampoo MP3 Check &amp; Convert 2.0 constitue la solution fiable pour la gravure sans probl&amp;egrave;me de MP3 Audio!\n\n    * Normaliser: Lorsque vous convertissez des pistes vous pouvez simultan&amp;eacute;ment\n      &amp;laquo; normaliser &amp;raquo; le niveau de volume d?ensemble de vos pistes de sorte que les morceaux seront tous jou&amp;eacute;s au m&amp;ecirc;me volume de base. Cette fonction tombe &amp;agrave; pic lorsque vous voulez graver des CD dont les pistes proviennent de sources diff&amp;eacute;rentes!\n    * Comprimer des fichiers WAV : Gagnez pr&amp;egrave;s de 75% d?espace disque dur en convertissant vos fichiers WAV au format WAV comprim&amp;eacute; sans perte. Ce format poss&amp;egrave;de &amp;eacute;galement l?extension .wav et est totalement compatible avec toutes les applications Windows.\n    * &amp;Eacute;dition de tags ID3: Le Titre, les Noms de l?Artiste, de l?Album et d?autres informations concernant les pistes du CD sont stock&amp;eacute;es dans un en-t&amp;ecirc;te de donn&amp;eacute;es sp&amp;eacute;ciale plac&amp;eacute;e en d&amp;eacute;but du fichier dans ce que l?on appelle les ID3-tags. Toutes les fonctions Propri&amp;eacute;t&amp;eacute;s de Ashampoo MP3 Check &amp; Convert 2.0 affichent maintenant et vous permettent d?&amp;eacute;diter l?information des ID3 tags.\n    * &quot;R&amp;eacute;parer&quot; des MP3 posant des probl&amp;egrave;mes : Dans bien des cas, le programme peut convertir des pistes MP3 corrompues et incompatibles en fichiers WAV standards. Cette op&amp;eacute;ration &amp;eacute;limine automatiquement toutes les donn&amp;eacute;es &amp;agrave; probl&amp;egrave;me, vous pouvez ensuite reconvertir ces fichiers vers des pistes MP3 compatibles. Ceci permet tr&amp;egrave;s facilement de sauver des pistes irrempla&amp;ccedil;ables que vous auriez sinon mises &amp;agrave; la poubelle !\n    * Notez vos r&amp;eacute;sultats: Toutes les op&amp;eacute;rations d?analyse et de conversion sont visualis&amp;eacute;es &amp;agrave; l?&amp;eacute;cran et ces informations peuvent &amp;ecirc;tre stock&amp;eacute;es sous la forme de fichiers texte &amp;agrave; titre de documentation.  \n\nSupporte les versions suivantes de Windows&amp;copy; :\nWindows&amp;copy; 95, 98, Me, NT4, 2000 et XP\n\n\n\nEnglish:\n\n    * Check and convert audio files in the OGG Vorbis format \n    * Several improvements under the bonnet\n\nAshampoo MP3 Check &amp; Convert 2 is a simple but very powerful tool for working with MP3 audio files.\n\nIf you use MP3s that you didn?t make yourself you?ve probably often experienced problems trying to record them to audio CDs. This problem occurs when the MP3 files are corrupt or not compatible with the audio CD format. Ashampoo MP3 Check &amp; Convert 2 puts an end to these problems once and for all! \n\n    * Analyse: Perform quick batch mode checks of any or all of your MP3 tracks for defects, corruption and compatibility with the audio CD format.\n    * Move: All MP3 files identified as problematic can automatically be moved to a separate folder.\n    * Convert to WAV: Quickly convert single or multiple MP3 files to WAV format ?  for example to eliminate defects or to record them to audio CDs.\n    * Convert to MP3: Fast, high-quality conversion of WAV files to MP3 ? for example to burn them to MP3 CDs that you can play on many DVD players. \n\n \n \n\nAshampoo MP3 Check &amp; Convert 2 is the perfect addition to your CD-recording software! It quickly and easily identifies defective and incompatible MP3 files that would cause problems when you try to record them to CD-R.\n\nBut that?s not all: With a couple of mouse clicks you can also convert single or multiple MP3 tracks to WAV and WAV tracks to MP3. The user interface couldn?t be simpler ? you?ll be checking and converting like a pro in minutes.\n\nNot being able to burn a track is bad, but what?s even worse is recording a CD to find out afterwards that some of the MP3 tracks won?t play on your DVD player. This cool tool also reliably identifies this type of MP3 problem.\n\nWhat do you want to do after you?ve identified problem tracks? Right! Repair them! With Ashampoo MP3 Check &amp; Convert 2 you can convert corrupt and incompatible MP3 tracks into standard WAV files. This automatically ?filters? out the problems ? then you just convert these clean WAV files back to fully compatible MP3 tracks that you can burn and play on your DVD player. Here too you can convert and repair individual files, groups of files or all the files on your list.\n\nAshampoo MP3 Check &amp; Convert 2 is the reliable solution for trouble-free MP3 audio CD-recording!\n\n    * Normalise: When you convert tracks you can simultaneously ?normalise? the overall volume level of your tracks so that they all play with the same basic volume. This is great for mixing CDs with tracks from different sources!\n    * Compress WAV files: Save around 75% hard disk space by converting your WAV files into a lossless compressed WAV format. This format has the .wav extension and is fully compatible with all Windows applications.\n    * ID3 tag editing: The Title, Artist, Album and other track details in your MP3 files are all stored in a special data header at the beginning of the file known as &quot;ID3 tags&quot;. All the Properties functions of Ashampoo MP3 Check &amp; Convert 2 now display and allow you to edit the ID3 tag information.\n    * ?Repair? problem MP3s: In many cases the program can convert corrupt and incompatible MP3 tracks into standard WAV files. This automatically removes all the ?problem? data, and you can then convert these files back into fully compatible MP3 tracks. This makes it very easy to rescue irreplaceable tracks that you would otherwise have to bin!\n    * Log your results: All analysis and conversion operations are listed on screen and can be stored in text files for documentation. \n\nSupports the following Windows(R) versions:\nWindows(R) 95, 98, Me, NT4, 2000 and XP\n","torrent":{"xt":"urn:btih:5067601a1e1e30c1b5339146a2cc48ddea5fda9a","amp;dn":"Ashampoo+MP3+Check+%26+Convert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5067601a1e1e30c1b5339146a2cc48ddea5fda9a","infoHashBuffer":{"type":"Buffer","data":[80,103,96,26,30,30,48,193,181,51,145,70,162,204,72,221,234,95,218,154]},"announce":[],"urlList":[]}}