{"title":"Weber-Global Warming-Rest of Story(1992)","uid":4533261,"size":2554670,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51cb171867e64efb3dfea992a328ac1afca7b209&amp;dn=Weber-Global+Warming-Rest+of+Story%281992%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"red_gonzo","files":1,"time":1227638709,"description":"This is Gerd R. Weber&amp;#039;s eye-openning book Global Warming - The Rest of the Story (1992) which elegantly exposes the global warming as a gigantic scientific hoax used for nefarious political purposes. First it was acid rain, then the ozone hole. Now, CO2 in the air is supposed to bring on a climate catastrophe. Is global warming really a threat, are the polar ice caps in danger of melting and are coastal areas of habitation under threat of a deluge? Do we therefore need an energy-CO2 tax? The author of this rare and mostly unknown book explains in straight-forward language what climatological research indicates about the following questions: What is and how does the greenhouse effect work? What does that mean for life on earth? Why is a rise in temperature feared? How and for what reasons has climate changed over the centuries and what role was played by the greenhouse effect? What do we really know about the effect of a growing concentration of greenhouse gases in the atmosphere and what do current computer programs make of that? How do plants and algae cope with increased CO2 and temperature through photosynthesis? Find out what kind of science and mostly politics lies behind the global warming &quot;threat&quot; so at least you&amp;#039;ll know why you&amp;#039;ll be soon forced to pay all kinds of ecological taxes which will have nothing to do with ecology at all. 185 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:51cb171867e64efb3dfea992a328ac1afca7b209","amp;dn":"Weber-Global+Warming-Rest+of+Story%281992%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51cb171867e64efb3dfea992a328ac1afca7b209","infoHashBuffer":{"type":"Buffer","data":[81,203,23,24,103,230,78,251,61,254,169,146,163,40,172,26,252,167,178,9]},"announce":[],"urlList":[]}}