{"title":"Osho_From Death To Deathlessness #14.mp4","uid":15318034,"size":670688171,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5323936c68f0ff5bead9af992b7cb3e72f61decd&amp;dn=Osho_From+Death+To+Deathlessness+%2314.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1468621879,"description":"Very interesting answers in both questions..\r\nand Osho is saying : I am not serious... Don't believe me..\r\nhe wants us to be independent and use our own brain, to be free individuals..\r\n\r\nFrom Death to Deathlessness\r\nChapter #14\r\nChapter title: Get out of this sheepskin\r\n15 August 1985 am in Rajneeshmandir, Oregon, US\r\nLength: \t100 mins\r\n\r\nQuestion 1\r\n\r\nBHAGWAN,\r\nWHY ARE THERE SO FEW AMERICAN SANNYASINS? I RECALL YOU SAYING THAT AMERICA WOULD BE A VERY SPIRITUAL COUNTRY BECAUSE THEY HAD ALREADY MASTERED MATERIAL ABUNDANCE AND FOUND IT DID NOT SATISFY. WHY ARE THEY SO SLEEPY? PLEASE COMMENT.\r\n\r\nAmerica has no roots. It is just a three-hundred-year-old country; it is passing through its childhood. Compared to a country like India which has been there for at least ninety thousand years, America is a just-born baby. So wait a little; babies don't tend to be spiritual.\r\n...and Bhagawan just go on talking very nice, about reasons why many people in both India and America have dificulties to take a step of becoming neo-sannyasin..\r\nprogramming of society is very deep...and in such psichological way that it is very difficult to get rid of this programs.\r\n\r\nQuestion 2\r\n\r\nBHAGWAN,\r\nI'M CONFUSED. THERE IS FEAR AND WANTING IN ME. THERE ARE MOMENTS OF SILENCE AND MOMENTS OF SUPPRESSING MY BODY, MY FEELINGS. WHY DON'T I LET GO TOTALLY? AM I STILL GREEDY? IS THE FALLING BACK INTO OLD PATTERNS AN EXPRESSION OF COWARDLINESS? I HAVE NEVER REALLY BEEN A COWARD, BUT ALWAYS HALF-HEARTED. IN THE LAST WEEKS I HAVE BECOME SO MUCH IN LOVE WITH YOU, MY TRUST HAS GROWN. THE MORE I COULD SAY, &quot;YOU ARE NOT SERIOUS,&quot; OR &quot;I DON'T AGREE,&quot; THE MORE MY FEELINGS GOT IN CONTACT WITH YOU. CAN YOU SAY SOMETHING?\r\n\r\nFirst, confusion is far more significant than certainty which comes out of belief, faith, blindness. Confusion is a good beginning. Confusion will be leading you to become one day Confucius! Just go on. Don't be worried about confusion....\r\n....................\r\nAnswer to question 2 is very nice and may people may find themselves in it..\r\nfree download of Osho's audios and books -on oshoworld(dot)com","torrent":{"xt":"urn:btih:5323936c68f0ff5bead9af992b7cb3e72f61decd","amp;dn":"Osho_From+Death+To+Deathlessness+%2314.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5323936c68f0ff5bead9af992b7cb3e72f61decd","infoHashBuffer":{"type":"Buffer","data":[83,35,147,108,104,240,255,91,234,217,175,153,43,124,179,231,47,97,222,205]},"announce":[],"urlList":[]}}