{"title":"The Long Goodbye - Raymond Chandler   (BBC 2011)","uid":6712338,"size":104838148,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5349ac6b16ee99ba5225ac3b957bceb64d53cce7&amp;dn=The+Long+Goodbye+-+Raymond+Chandler+++%28BBC+2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":2,"time":1317404343,"description":"Ok here we go again carrying on from 26th February,the new BBC Radio 4 version is broadcast tomorrow,this one's from 1978 I'll up the new one ASAP.\n\n\n\nEd Bishop stars as Philip Marlowe in a powerful and atmospheric full-cast dramatisation of Raymond Chandler's classic noir novel.Ed Bishop stars as Philip Marlowe in a powerful and atmospheric full-cast dramatisation of Raymond Chandler's classic noir novel. The first time Marlowe sets eyes on Terry Lennox, he is lying drunk in the passenger seat of a Rolls-Royce Silver Wraith. The next time, he's on Skid Row. After they share a few Gimlets, Marlowe thinks he seems like a nice guy, but he's had a hard life - his white hair and scarred face testify to that. Or could it be marriage to Sylvia Lennox that has turned him prematurely grey? Although beautiful and rich, she plays the field in a big way.  Lennox says he has the promise of a job in Las Vegas, and Marlowe helps him out with the cost of the ticket. Two weeks later, he gets the money back, with a note from Lennox saying he is starting a second honeymoon with Sylvia.  But the honeymoon turns sour, the dame ends up dead and Lennox turns up on Marlowe's doorstep in big trouble. He needs to get away in a hurry, and against his better judgement Marlowe agrees to take him to Tijuana. Soon after, the cops arrive, and Marlowe finds himself cooling his heels in the can, suspected of helping Sylvia's killer escape. And that's not the end of his problems, not by a long shot... \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:5349ac6b16ee99ba5225ac3b957bceb64d53cce7","amp;dn":"The+Long+Goodbye+-+Raymond+Chandler+++%28BBC+2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5349ac6b16ee99ba5225ac3b957bceb64d53cce7","infoHashBuffer":{"type":"Buffer","data":[83,73,172,107,22,238,153,186,82,37,172,59,149,123,206,182,77,83,204,231]},"announce":[],"urlList":[]}}