{"title":"The Twang","uid":4907018,"size":42063376,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:53fa19750cc6fa20ec0dc0f98ad32f430798e435&amp;dn=The+Twang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":11,"time":1242946908,"description":"Formed in 2004 by Phil Etheridge (vocals), Martin Saunders (vocals), Jon Watkin (bass), Matt Clinton (drums) and Stu Hartland (guitar), this Birmingham-based band rose rapidly through the ranks of indie hopefuls to sign a major label contract at the start of 2007. Etheridge and Watkin were childhood friends from the Quinton district of Birmingham who were inspired to start a band after hearing Oasis. The UK music press prominently trumpeted the band's working class background, with some over-excited writers seeing the quintet as the antidote to the mid-00s glut of &quot;posh&quot; indie rockers. Of more note were the musical reference points adopted by the Twang, with overtones of the Happy Mondays and the Streets demonstrating a sound knowledge of both classic indie dance and recent musical developments.\n\nBy 2006 the Twang had attracted the attention of the UK music press and was soon being championed as one of the rising stars of the year. The band signed to B-Unique Records, home of the Kaiser Chiefs, at the start of 2007, and worked with Gavin Monaghan on the recording of their debut album. Preceded by the UK hit singles &quot;Wide Awake&quot; and &quot;Either Way&quot;, Love It When I Feel Like This was released in June 2007.\n","torrent":{"xt":"urn:btih:53fa19750cc6fa20ec0dc0f98ad32f430798e435","amp;dn":"The+Twang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53fa19750cc6fa20ec0dc0f98ad32f430798e435","infoHashBuffer":{"type":"Buffer","data":[83,250,25,117,12,198,250,32,236,13,192,249,138,211,47,67,7,152,228,53]},"announce":[],"urlList":[]}}