{"title":"The Sugar Season - 2014 - EPUB","uid":9702665,"size":2336169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:551982d8aeab078294bab4df1d62ef2f871a73c2&amp;dn=The+Sugar+Season+-+2014+-+EPUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":1,"time":1394028475,"description":"Pages: 304 pages\nPublisher: Da Capo Press (March 4, 2014)\nLanguage: English\nISBN-10: 0306822040\nISBN-13: 978-0306822049\nFormat: EPUB\n\n\n\nA year in the life of one New England family as they work to preserve an ancient, lucrative, and threatened agricultural art--the sweetest harvest, maple syrup...\n\nHow has one of America's oldest agricultural crafts evolved from a quaint enterprise with &quot;sugar parties&quot; and the delicacy &quot;sugar on snow&quot; to a modern industry?\n\nAt a sugarhouse owned by maple syrup entrepreneur Bruce Bascom, 80,000 gallons of sap are processed daily during winter's end. In The Sugar Season, Douglas Whynott follows Bascom through one tumultuous season, taking us deep into the sugarbush, where sunlight and sap are intimately related and the sound of the taps gives the woods a rhythm and a ring. Along the way, he reveals the inner workings of the multimillion-dollar maple sugar industry. Make no mistake, it's big business--complete with a Maple Hall of Fame, a black market, a major syrup heist monitored by Homeland Security, a Canadian organization called The Federation, and a Global Strategic Reserve that's comparable to OPEC (fitting, since a barrel of maple syrup is worth more than a barrel of oil).\n\nWhynott brings us to sugarhouses, were we learn the myriad subtle flavors of syrup and how it's assigned a grade. He examines the unusual biology of the maple tree that makes syrup possible and explores the maples'--and the industry's--chances for survival, highlighting a hot-button issue: how global warming is threatening our food supply. Experts predict that, by the end of this century, maple syrup production in the United States may suffer a drastic decline.\n\nAs buckets and wooden spouts give way to vacuum pumps and tubing, we see that even the best technology can't overcome warm nights in the middle of a season--and that only determined men like Bascom can continue to make a sweet like off of rugged land.","torrent":{"xt":"urn:btih:551982d8aeab078294bab4df1d62ef2f871a73c2","amp;dn":"The+Sugar+Season+-+2014+-+EPUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"551982d8aeab078294bab4df1d62ef2f871a73c2","infoHashBuffer":{"type":"Buffer","data":[85,25,130,216,174,171,7,130,148,186,180,223,29,98,239,47,135,26,115,194]},"announce":[],"urlList":[]}}