{"title":"Hip Hop Collection - Beef III","uid":7542025,"size":2590316544,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:556c575573a89cd1e5669fec9b12782328c4ac27&amp;dn=Hip+Hop+Collection+-+Beef+III&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GRNS3","files":-1,"time":1345240227,"description":"\nThe Hip Hop Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\nBeef III is the third installment of the Beef series. It is a documentary about Hip hop rivalries and beefs (arguments). It was released on DVD on November 15, 2005. It was directed and produced by Peter Spirer and lasts approximately 85 minutes. It was narrated by DJ Kay Slay and scored by Nu Jerzey Devil.\nDuring the mid-to-late 1990s, rappers from parts other than New York City and Los Angeles were emerging. Among them were Twista (a Chicago native) and Bone Thugs-N-Harmony (their members originate from both Cleveland and Columbus, Ohio). They both became very popular for their quick, rapid-fire style of rapping delivery. The beef started with a dispute over who originated this style. Bone Thugs say that Twista did not come out with the rapid-fire style. Layzie Bone elaborated and said &quot;yeah he came spittin it a hundred miles an hour but he wasn't adding the harmony like us&quot;. Twista attacked back with &quot;Crook County&quot; feat. Psychodrama, calling Bone &quot;Hoes of the Harmony.&quot; He also threatened that they were going to see Eazy-E soon. However, Layzie Bone and Twista became good friends and they dropped &quot;Mid- West Invasion,&quot; soon thereafter the beef ended. Krayzie Bone and Wish Bone still had beef with Twista, they put out subliminal messages dissing Twista in Krayzie Bone's &quot;Gemini&quot; album and &quot;Leatherface: The Legend&quot; undeground album. It was until the &quot;Spit Your Game&quot; video shoot that Krayzie, Wish and Twista ended their Beef.\nLil Scrappy was performing at a concert in a high school gym in Orlando. During the concert, the crowd were really getting pumped and excited by the music, then the local police stepped in. They gave Scrappy a warning, because he took his shirt off (which made female fans even more aggressive). The reasoning for this was because the police were afraid of a potential riot. They stated that if Scrappy were to do something like this they would cancel the concert. Then, Scrappy did a stagedive, which made the police react and they entered the stage and stopped the music. An officer then bumped into Lil Scrappy's manager making him angry. The same officer then rushed over to Lil Scrappy and pushes him off stage.\n\n","torrent":{"xt":"urn:btih:556c575573a89cd1e5669fec9b12782328c4ac27","amp;dn":"Hip+Hop+Collection+-+Beef+III","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"556c575573a89cd1e5669fec9b12782328c4ac27","infoHashBuffer":{"type":"Buffer","data":[85,108,87,85,115,168,156,209,229,102,159,236,155,18,120,35,40,196,172,39]},"announce":[],"urlList":[]}}