{"title":"Grieves - Winter &amp; the Wolves (2014) [FLAC]","uid":9847564,"size":353610159,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:55a1f6d5f7e75b7bd499ed1e0e75fc0e24ce8da6&amp;dn=Grieves+-+Winter+%26amp%3B+the+Wolves+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1396103198,"description":"\n  Grieves - Winter &amp; the Wolves (2014) [FLAC]\n\n  Genre: Hip-Hop\n  Styles: Alternative Rap, Underground Rap\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Rain Damage\n  02 Whoa Is Me\n  03 Over You (feat. B. Lewis)\n  04 Serpents\n  05 Breath of Air\n  06 Astronauts (feat. Slug)  \n  07 Autumn\n  08 How's it Gonna Go (feat. B. Lewis)\n  09 Recluse\n  10 Like Child\n  11 Long One\n  12 Kidding Me\n  13 Shreds\n  14 Smoke in the Night\n\n  On Winter &amp; the Wolves, Seattle-based indie rapper Grieves displays significant, even startling, growth from his previous releases, and in the process shakes off any possible accusations that he's an Atmosphere clone. If anything, this vibrant, alive, and diversified release could draw Macklemore or Mac Miller comparisons when it comes to the music and the slick production, but regular visitors to the Rhymesayers label still get their fill of emo and introverted, although this time, it comes with a delicious grain of salt. Key cut &quot;Whoa Is Me&quot; paints Grieves as a sensitive guy who's up for some call-and-response comedy when it comes to his soft heart (&quot;My dog died [When you were six!]&quot; and &quot;My truck broke [You ride the bus!]&quot;). There's the opening number, &quot;Rain Damage,&quot; a forceful, &quot;guess who's back&quot;-type track where the man triumphantly and convincingly spits that he's the &quot;gapped-tooth rapper&quot; with &quot;a bag full of I-don't-give-a-f*cks for that ass,&quot; and don't forget &quot;Rhymesayers, put that logo on the back,&quot; and suddenly these emo outsiders seem entirely &quot;in.&quot; \n\n  Blame his new cohort, producer B. Lewis, for most of the attractive musical flash on multiple tracks; then there's expert knob-twiddler Sapient giving &quot;Recluse&quot; an accordion-based beat that's somehow both sinister and street. Grieves also does fine on his own, claiming a solo production credit on &quot;Long One,&quot; where soul and restraint build a solid foundation for lyrics like &quot;got dumped, she don't need an unemployed punk running round life like the pile of blues records in his trunk.&quot; If Grieves is getting closer to the world of Macklemore, it's a Macklemore world where the ceiling really can hold us, and often does. Still, Grieves has stretched the possibilities of Rhymesayers-type rap with Winter &amp; the Wolves, so kick the mopes to the curb with this one, since it understands and overcomes with extra helpings of clever and cool.","torrent":{"xt":"urn:btih:55a1f6d5f7e75b7bd499ed1e0e75fc0e24ce8da6","amp;dn":"Grieves+-+Winter+%26amp%3B+the+Wolves+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55a1f6d5f7e75b7bd499ed1e0e75fc0e24ce8da6","infoHashBuffer":{"type":"Buffer","data":[85,161,246,213,247,231,91,123,212,153,237,30,14,117,252,14,36,206,141,166]},"announce":[],"urlList":[]}}