{"title":"Croc - Collection [1997, 2000] [Full Games] [MDF] [ENG]","uid":3646220,"size":1065488484,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:569acdc7e2c8abdb067ee9d238e14390feff9308&amp;dn=Croc+-+Collection+%5B1997%2C+2000%5D+%5BFull+Games%5D+%5BMDF%5D+%5BENG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mlody00843","files":2,"time":1174723903,"description":"Croc: Legend of the Gobbos (or just Croc) is a video game developed by Argonaut Software and published by Fox Interactive in 1997. Versions of the game were released for Game Boy Color, PlayStation, Saturn, and Windows.\n\nCroc is a third-person, 3D platform game that stars a crocodile named Croc who seeks to save the Gobbos from Baron Dante. The game takes the player to several islands, with his job to find and save as many Gobbos (little furry creatures with big eyes) as possible and defeat the level bosses which occur every half. This is no easy feat though, for Baron Dante has set his henchmen (Dantinis) around every island you visit. They can be dispatched, but only temporarily, with a blow from your tail.\n\nDespite several positive reviews and decent sales with the original becoming a PlayStation Greatest Hits game, Croc only spawned one sequel, Croc 2, that was released in 1999.\n\nHowever, the Rumors section of Official Playstation Magazine spoke of Croc?s return on the PlayStation 2 sometime near the release of Argonaut Software?s I-Ninja and Malice. The exact month and issue number of the statement is not known at this time.\n\nIt is assumed the project was never established due to the age of the magazine and Argonaut Software\\&amp;#039;s closure in 2004, or postponed as a future opportunity for Fox Interactive to rework Croc to be competitive in today?s market dominated by titles like ?Jak and Daxter?, ?Ratchet and Clank? and ?Spyro The Dragon?. A cancelled 2000 Dreamcast port of Croc 2 is among Croc?s other unreleased projects.\n\nCroc\\&amp;#039;s original advertisements pictured him as less cute than he appears in the game or anywhere else, depicting him devouring industries sales rivals Gex, Mario, Sonic the Hedgehog and Crash Bandicoot and mentioning them as being \\&quot;delicious\\&quot; while appearing to have slightly gained weight in his 3-D render after-image, despite the games manual saying he eats \\&quot;buckets of peas\\&quot;.","torrent":{"xt":"urn:btih:569acdc7e2c8abdb067ee9d238e14390feff9308","amp;dn":"Croc+-+Collection+%5B1997%2C+2000%5D+%5BFull+Games%5D+%5BMDF%5D+%5BENG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"569acdc7e2c8abdb067ee9d238e14390feff9308","infoHashBuffer":{"type":"Buffer","data":[86,154,205,199,226,200,171,219,6,126,233,210,56,225,67,144,254,255,147,8]},"announce":[],"urlList":[]}}