{"title":"The Faculty.nl subs.avi","uid":7020810,"size":1423820999,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56afa1f39089f17efe30752209a2f4c49eb857a5&amp;dn=The+Faculty.nl+subs.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bluntje78","files":-1,"time":1328830908,"description":"The Faculty (1998)\n\n\n\nVerenigde Staten\nhorror/sci-fi\nca.104 min\n\n\n\nRegie:Robert Rodriguez\nmet:Jordana Brewster,Josh Hartnett en Clea DuVall\n\n\n\nZoals vele scholen van vandaag de dag, heeft Harrington High zijn beste tijd gekend. Toch zijn de lokalen gevuld met jongeren die de toekomst hebben: de leiders, de trendsetters, de nerds, de haantjes en de boerenpummels. Tieners die, zoals overal, worstelen met hun niet begrijpende ouders, hun lastige leraren en hun opstandige hormonen. Tot zover lijkt alles normaal, maar de leerlingen van Harrington High doen een vreemde ontdekking. Het vermoeden wordt steeds sterker dat hun saaie leraren in werkelijkheid gevaarlijke buitenaardse wezens zijn! De vriendelijke football-coach, Robert Patrick, scheldt de leerlingen uit en de verlegen Miss Burke.(Famke Janssen), verandert in een femme fatale. Een groepje leerlingen is de enig overgebleven verdedigingslinie. Gezamenlijk gaan zij de strijd aan.\n\n\n\n===================================================================================\n\n\n\nHerrington High, Ohio, a small-town highschool. All of a sudden, the teachers start changing attitude. When Casey and Delilah have to hide in a closet in the teacher's lounge, they witness the strangulation of Nurse Harper by two of them. Shocked, they manage to flee. Only moments later, the nurse seems to be very alive, but also somehow changed, like all the teachers and most of the students. Only Casey, Delilah and four others seem to be suspicious. Proof of an alien infection is finally brought by the chemistry teacher, who also points out a way to kill the infected humans. The plan now is to get the queen, before the aliens can spread out over the whole country.\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0133751/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0133751/&lt;/a&gt;\n\n\navi","torrent":{"xt":"urn:btih:56afa1f39089f17efe30752209a2f4c49eb857a5","amp;dn":"The+Faculty.nl+subs.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56afa1f39089f17efe30752209a2f4c49eb857a5","infoHashBuffer":{"type":"Buffer","data":[86,175,161,243,144,137,241,126,254,48,117,34,9,162,244,196,158,184,87,165]},"announce":[],"urlList":[]}}