{"title":"SereneScreen.com.Marine.Aquarium.3.Beta.8.Screensaver.[3.0.1605]","uid":4740620,"size":3491526,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:576863fcf26be6c7f2f3b403e0c7b161aac94dca&amp;dn=SereneScreen.com.Marine.Aquarium.3.Beta.8.Screensaver.%5B3.0.1605%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buzzinhornets","files":1,"time":1235532534,"description":"SereneScreen.com Marine Aquarium 3\n\nAfter years of development, SereneScreen Marine Aquarium 3 is finally available for download and purchase! This is a Beta-Test version, but your MA3 Key Code will not expire, and entitles you to download all updates through the final version. MA3 is not just an update to previous versions - the entire program has been re-written from the ground up as a full 3D environment, taking advantage of the increased capabilities of modern video cards.\n\nWhat's in the program:\n\n    * An incredible new high-definition 3D tank, bringing a whole new definition to 3D aquarium simulations.\n    * No more 8-fish limit. The larger tank can handle up to 30 fish at once!\n    * Multi-monitor support. Spread your aquarium across two or even three screens!\n    * Music playlist. Choose your own MP3 or other music files to play in the background as you watch the Aquarium!\n\nWhat's coming soon:\n\n    * Moving background objects. Two objects are already moving, with many more to come!\n    * Clock/Calendar. The very next addition!\n    * Custom Logo support. You can already test your custom logo in MA3 and an interface is on the way.\n    * Automatic lights. There will soon be a greatly expanded interface for customizing the background colors.\n    * New realistic fish behavior, including schooling, chasing, and pecking at corals.\n\n\nOnce these features are in place, the stage will be set for many exciting additions. Optional Creature Packs will utilize the large environment as a playground for a wide array of different fish and invertabrates.\n\nIf you want to join the fun and participate as this exciting program matures, you may purchase an MA3 Key Code, or upgrade your Key from MA2.6 to MA3. You are also welcome to go to the Fan Forum and give your thoughts and suggestions.\n\n--- Jim Sachs","torrent":{"xt":"urn:btih:576863fcf26be6c7f2f3b403e0c7b161aac94dca","amp;dn":"SereneScreen.com.Marine.Aquarium.3.Beta.8.Screensaver.%5B3.0.1605%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"576863fcf26be6c7f2f3b403e0c7b161aac94dca","infoHashBuffer":{"type":"Buffer","data":[87,104,99,252,242,107,230,199,242,243,180,3,224,199,177,97,170,201,77,202]},"announce":[],"urlList":[]}}