{"title":"Heights - Old Lies for Young Lives (2013) [FLAC]","uid":9070352,"size":263942471,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:57acec99ee10ac1a61fb38b95f47fa8ba2242795&amp;dn=Heights+-+Old+Lies+for+Young+Lives+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1382192260,"description":"\n  Heights - Old Lies for Young Lives (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Hardcore, Punk, Metal\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 The Best Years\n  02 Eleven Eyes\n  03 March 1964\n  04 The Noble Life\n  05 Windowless\n  06 In Transit\n  07 Stray Rats\n  08 Repeat\n  09 Wake Up, Fall Aslee\n  10 Forth / Here\n  \n  The lead up to the release of Heights second full length has been a controversial one. The decision to eliminate ex-vocalist Thomas Debaere from the Welwyn Garden City group was a shock to all. Especially after the blistering debut 'Dead Ends', which received brilliant response from critics. As soon as the news was announced Heights released a snippet of new music titled 'Heights is Dead'. Due to vocal differences between the previous vocalist and newly recruited ex-bassist Alex Monty, the release caused a large split through the fan base and also some very high tempered reactions. \n\n  Now we spin round to the 29th of April 2013, and after several support slots and an appearance at Ghostfest, Heights release 'Old Lies for Young Lives'. The first track 'The Best Years' shows an instant change in sound compared to the vicious 'Dead Ends'. A more upbeat and light sound is introduced. A notable difference is the guitars, played by Dean Richardson and Tom Green. A more technical sound and higher tone is found instead of the thick, dense chords and chugs which dominated previous work. The vocal and lyrical work from Alex fits well with the new approach and shows a solid start to album. Next up is first single 'Eleven Eyes' which features the one and only Sam Carter whose band Architects have also gone through their fair share of controversy with later releases. One of the stronger and more abrasive songs on the album 'Eleven Eyes' is sure to stay in your head. A outstanding build up and climax to the song with Sam Carter is a highlight of the album but if it was not for the Architects vocalist you feel as though it could of not been such a highlight. \n\n  The band chose their singles well as 'The Noble Lie' shows how far Heights have progressed musically. The introduction of a well placed drum and guitar solo add a different aspect to the image of Heights, whereas 'Dead Ends' was just crushing simplicity. Unfortunately some of the lyric writing does fall flat within this song and throughout the album. 'That ***ed up kid was really nice' is an example from the song 'Windowless'. Rhyming the word ice with nice, let alone using the word nice is just something that is cringe worthy at times. Even though the song is the darkest lyrically and one of the most aggressive on the album. It does feel slightly let down by some of Monty's writing and it does show on occasions throughout. Further for the rest of the album there is nothing that really stands out above the singles already released even including the guitar driven instrumental 'Repeat' and the six minute long closing song 'Forth/Here. Apart from 'In Transit' which in my opinion is the best song on the album. It perfectly blends the chaotic sound of 'Dead Ends' and the new progressed sound of 'Old Lies for Young Lives'. The most interesting note about this song is that the 'Heights is Dead' snippet that was released all that time ago is used as the climax of the song and it has never sound so thick and crippling and I am sure it is to kick things off with the crowd at future shows.","torrent":{"xt":"urn:btih:57acec99ee10ac1a61fb38b95f47fa8ba2242795","amp;dn":"Heights+-+Old+Lies+for+Young+Lives+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57acec99ee10ac1a61fb38b95f47fa8ba2242795","infoHashBuffer":{"type":"Buffer","data":[87,172,236,153,238,16,172,26,97,251,56,185,95,71,250,139,162,36,39,149]},"announce":[],"urlList":[]}}