{"title":"Bob Dylan - The Freewheelin' Bob Dylan (Reissue)","uid":3286795,"size":168564694,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:583e31402cd7165c4beed83e0a7b36b6aba815f7&amp;dn=Bob+Dylan+-+The+Freewheelin%5C%27+Bob+Dylan+%28Reissue%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pippin","files":13,"time":1107810459,"description":"From amazon.com: Dylan's outstanding second album is a tremendous jump from its predecessor. Whereas the debut established him as a peerless interpreter of folk and country-blues classics, and a singer like none before, this followup features some of the most pungent original songs of the '60s. &quot;Blowin' in the Wind,&quot; &quot;Masters of War,&quot; &quot;A Hard Rain's A-Gonna Fall,&quot; &quot;Don't Think Twice, It's All Right,&quot; &quot;I Shall Be Free&quot;: if this sounds like the lineup for a greatest-hits collection, you've got the idea. Nat Hentoff's liner notes are charmingly dated, but Dylan's idiosyncratic singing, unexpected lyrics, and inimitable guitar and harmonica playing are as immediate and relevant as whatever you heard on the radio today. (As great as this is, there's much more: a handful of top-rank outtakes from Freewheelin' appear on the Bootleg Series box set.) &lt;p&gt; Note: This is an mp4 encode of the new &quot;reissue&quot; version of The Freewheelin' Bob Dylan: Sound is superior, both when it comes the remix itself and the new mp4 standard. You may have to download a plugin to play this, but windows media player usually takes care of that automatically. &lt;/p&gt;Btw, uploaded Blonde on Blonde a long time ago, with same setup - its &lt;A HREF=&quot;http://trackerwww.prq.to/torrents-details.php?returnto=%2Faccount-cp.php&amp;id=3254652&quot;&gt;here&lt;/A&gt;, still active.","torrent":{"xt":"urn:btih:583e31402cd7165c4beed83e0a7b36b6aba815f7","amp;dn":"Bob+Dylan+-+The+Freewheelin%5C%27+Bob+Dylan+%28Reissue%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"583e31402cd7165c4beed83e0a7b36b6aba815f7","infoHashBuffer":{"type":"Buffer","data":[88,62,49,64,44,215,22,92,75,238,216,62,10,123,54,182,171,168,21,247]},"announce":[],"urlList":[]}}