{"title":"Mapp and Lucia series by E.F. Benson","uid":9615888,"size":2260707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a40c8e040475bbd3abd552c1d54b61126046c4b&amp;dn=Mapp+and+Lucia+series+by+E.F.+Benson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":8,"time":1392418744,"description":"\nAll six books from E.F. Benson's 1920s series starring Mrs Emmeline 'Lucia' Lucas and Miss Elizabeth Mapp, plus two short stories.\n\nGenre: General Fiction\n\nQueen Lucia\nThe first book in the series, introduces the unique Emmeline 'Lucia' Lucas, a social authority and queen of the charming village, Riseholme. Lucia has to defend her throne as it is in jeopardy with the arrival of Olga Braceley, an opera singer.\n\nMiss Mapp\nArch-schemer and social climber, Miss Mapp spends her days using opera glasses and a notebook to chart her neighbors' affairs. Among her interests are Major Benjamin Flint, whom she has been trying to marry for years.\n\nLucia In London\nHere is Lucia in one of her most extraordinary adventures: can she conquer her new home of London, and still hold her societal ground over the stately country mansions of Riseholme as well? Will the citizens of Riseholme - hurt and maddened by Lucia's desertion for the great city - carry out their plot of revenge?\n\nThe Male Impersonator and Desirable Residences - Short stories starring Miss Mapp\n\nMapp and Lucia\nTwo queens of trivial and respectable (yet shamelessly inquisitive) scheming are brought together with the inevitable result -- war to the last knife and fork.\n\nLucia's Progress\nArch enemies Mapp and Lucia return in the next instalment of E.F. Benson's classic series of rural snobbery. Lucia is now a permanent resident of Tilling and continues her way up the social ladder with gusto, making attempts at the Town Council, finance, a platonic marriage and even the cricket club. Though Miss Mapp will not allow her to take control of the town so easily Lucia is up to the challenge as usual. Lucia employs her most dazzling ingenuity and cunning as the pair launches into a fresh storming of lethal civilities.\n\nTrouble for Lucia\nLucia learns to ride a bicycle, and we live through the saga of Blue Birdie (Mrs. Wyse's dead budgerigar invoked in a seance).Lucia and Georgie renew their acquaintance with the operatic diva Olga Braceley and the composer Cortese, but nobody in Tilling believes her when she claims to have entertained a duchess overnight. ","torrent":{"xt":"urn:btih:5a40c8e040475bbd3abd552c1d54b61126046c4b","amp;dn":"Mapp+and+Lucia+series+by+E.F.+Benson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a40c8e040475bbd3abd552c1d54b61126046c4b","infoHashBuffer":{"type":"Buffer","data":[90,64,200,224,64,71,91,189,58,189,85,44,29,84,182,17,38,4,108,75]},"announce":[],"urlList":[]}}