{"title":"Beres Hammond In Control","uid":5695497,"size":383219826,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5a912a031b09e87f457696fd711898e66d6b9ac7&amp;dn=Beres+Hammond+In+Control&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Arteman020","files":15,"time":1279290136,"description":"Tracklist :\n\n\n1. Reggae Calling \n 2. We've Found It \n 3. Just Say No \n 4. No Disturb Sign \n 5. I Won't Surrender \n 6. Can't Get Enough \n 7. Another Day in the System \n 8. Giving Thanks \n 9. It's Not Too Late \n 10. I Could Beat Myself \n 11. Motherland \n 12. Smile for Me \n 13. Stop Them - (bonus track) \n 14. No Crime - (bonus track) \n\n\n \n\nRecorded at Mixing Lab Recording Studio, Penthouse Recording Studio, Music Works Recording Studio and Black Scorpio Recording Studio, Kingston, Jamaica; Heavy Beat Recording Studio, Miami, Florida.\n\nPersonnel: Beres Hammond (vocals, background vocals); Hugh Beresford Hammond (vocals, background vocals); Marcia Griffiths, Buju Banton, Bunny Rugs, Capleton (vocals); Dalton Browne, Willie Lindo, Steven &quot;Cat&quot; Coore (guitar); Tony Greene (saxophone); David Madden (trumpet, horns); Barry Bailey (trombone); Dean Fraser (horns); Robert Lyn (piano, keyboards); Donald Dennis, Handel Tucker (keyboards, bass guitar); Computer Paul, Digital Pablo (keyboards, drum programming); Clive &quot;Azul&quot; Hunt, Paul Crosdale, Vernon Morrison, Paul &quot;Wrong Move&quot; Crossdale (keyboards); Robbie Shakespeare (bass guitar); Sly Dunbar (drums); Julio Ferrer (drum programming); Ledean Webster, Betty J., Marie Twiggi Gittens, Kashief Lindo, Mickal Rustle , Pam Hall (background vocals).\n\nAudio Mixers: Collin &quot;Bulbie&quot; York; Andre &quot;Dreddy Ranks&quot; Tyrell; Steven Stanley; Delroy &quot;Fatta&quot; Pottinger; Bunny Tom Tom.\n\nAudio Remasterer: Bunny Tom Tom.\n\nRecording information: Black Scorpio Studio, Kingston, Kingston, Jamaica; Heavy Beat Recording Studio, Miami, FL; Mixing Lab Studios, Kingston, Jamaica; Penthouse Recording Studio, Kingston, Kingston, Jamaica.\n\n\n\nUnknown Contributor Roles: Paul Crosdale; Hugh Beresford Hammond; The Firehouse Crew; Robert Lyn; Paul &quot;Wrong Move&quot; Crossdale.\n\nPersonnel: Beres Hammond, Capleton, Bunny Ruggs (vocals); Steven &quot;Cat&quot; Moore, Willie Lindo, Dalton Browne (guitar); Dean Fraser, David Madden (horns); Tony Green (saxophone); Robbie Lyn (piano, keyboards, bass); Handel Tucker, Clive Hunt, Vernon Morrison, Paul Crossdale (keyboards); Donald Dennis (keyboards, bass), Computer Paul, Digital Pablo (keyboards, programming); Julio Ferrer, Mafia, Fluxy, Clement Dodd (programming).\n\nProducers: Willie Lindo, Hugh Beresford Hammond, Phillip &quot;Fatis&quot; Burrell, Donovan Germain, Richard Bell.\n\nVibe (8/94, p.116) - &quot;...Jamaica's surest shot at America's R&amp;B hit parade is so damn good that he even croons baby talk choruses...and actually gets away with it...&quot;\nMusician (8/94, p.90) - &quot;...Hammond insinuates himself deftly within insistent melodies buoyed by bauxtie-heavy basslines and slick but not syrupy\n arrangements...&quot;\n\n\n\nEnjoyyy and Seed .........","torrent":{"xt":"urn:btih:5a912a031b09e87f457696fd711898e66d6b9ac7","amp;dn":"Beres+Hammond+In+Control","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a912a031b09e87f457696fd711898e66d6b9ac7","infoHashBuffer":{"type":"Buffer","data":[90,145,42,3,27,9,232,127,69,118,150,253,113,24,152,230,109,107,154,199]},"announce":[],"urlList":[]}}