{"title":"Meet the Robinsons - 2007 (ENG DUTCH VLAAMS)2Lions-Team","uid":5214732,"size":4512692811,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5b544fd8b24380824b714bd752353744c42672d9&amp;dn=Meet+the+Robinsons+-+2007+%28ENG+DUTCH+VLAAMS%292Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Pioen","files":-1,"time":1260722153,"description":"Meet the Robinsons - 2007       \n \n \n  Verenigde Staten\nAnimatie / Familie\n95 minuten\n\ngeregisseerd door Stephen J. Anderson\nmet de stemmen van Jordan Fry, Ethan Sandler en Wesley Singerman\n\nEen wonderkind ontwerpt een machine die vergeten herinneringen weer kan opwekken. Wanneer hij per toeval de toekomst in reist, ontmoet hij een familie wiens bestaan afhangt van zijn uitvinding.\n\nHet weesjongetje Lewis is een echt wonderkind. Hij is gek op knutselen en omdat hij briljant is bedenkt hij de meest bijzondere uitvindingen. Zijn meest recente uitvinding is een geheugenscanner. Het is een apparaat waarmee hij zijn familie probeert te vinden die hij nooit heeft gekend. Maar de achterbakse Bowler Hat Guy en de duivelse Doris met een hoed vol trucs gooien roet in zijn plannen. Zij stelen zijn nieuwe uitvinding. Lewis is absoluut niet opgewassen tegen deze schurken. Hij heeft de hoop om zijn familie terug te vinden al bijna opgegegeven als de geheimzinnige jongen Wilbur Robinson opeens uit het niets verschijnt. Hij heeft Lewis nodig om de wereld te redden. In een tijdmachine reizen ze naar het jaar 2037. Een tijd waarin hip-hoppende kikkers en brildragende honden net zo gewoon zijn als sprekende dinosaurussen. Waarin auto's vliegen en steden zweven. Daar maakt hij kennis met de excentrieke familie van Wilbur, de Robinsons, en voelt hij voor het eerst wat het is om deel uit te maken van een echte familie. In een verbazingwekkende wending, ontdekt hij dat het lot van de toekomst in zijn handen ligt. Dat lukt met de hulp van de maffe familie Robinson, door vooruit te kijken en in zichzelf te blijven geloven. Ook ontdekt hij het wonderbaarlijke geheim van zijn eigen afkomst.\n\nEnglish\n\nLewis an orphan wants to see what his mother looked like. So he invents a machine that looks through your brain so you can see your memories. But this weird kid says he's from the future and warns him about a guy in a bowler hat. The bowler hat guy messes with his invention and it fails. He decides that he's a failure and no one wants him. But the kid that warned him about the guy is here on a mission to find the bowler hat guy that wants to destroy Lewis. To prove he's from the future he takes lewis to the future. But the time machine breaks and he's stuck in the future until he fixes it. In the meantime he spends quality time with the family. But the bowler hat guy is about to alter time and it's up to Lewis to save the future\n\t\n\nAudio: Dutch, English, Vlaams!\nSubs: Dutch, English!\nCover : Yes\nMenu : YEs\nExtra : yes\n\nFormaat : DVD5 \nBron : Retail\n\n \nGenre : Animatie\nFamiliefilm\nKinderfilm\n \nWeblink : http://www.moviemeter.nl/film/34422 \nWeblink : http://www.imdb.com/title/tt0396555\t\n\n***************************************** \n\nBrought to you by\n\n\n2Lions Team \n\n\n \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!","torrent":{"xt":"urn:btih:5b544fd8b24380824b714bd752353744c42672d9","amp;dn":"Meet+the+Robinsons+-+2007+%28ENG+DUTCH+VLAAMS%292Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b544fd8b24380824b714bd752353744c42672d9","infoHashBuffer":{"type":"Buffer","data":[91,84,79,216,178,67,128,130,75,113,75,215,82,53,55,68,196,38,114,217]},"announce":[],"urlList":[]}}