{"title":"Slash feat Myles Kennedy - iTunes Session (EP)mp3 (2010)","uid":11124749,"size":71183109,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5c7ca67229f9fb84903f40b2c08eed1ac5e1c414&amp;dn=Slash+feat+Myles+Kennedy+-+iTunes+Session+%28EP%29mp3+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":7,"time":1411956754,"description":"Biography\n\nAs the lead guitarist for Guns N' Roses, Slash established himself as one of hard rock's finest and most soulful soloists during the late '80s, technically adept yet always firmly grounded in the gritty Aerosmith and Stones licks he loved. Slash was born Saul Hudson on July 23, 1965, in Stoke-on-Trent, England, to artistic parents both involved in the entertainment industry; his mother was a clothing...\n...More\n\nAs the lead guitarist for Guns N' Roses, Slash established himself as one of hard rock's finest and most soulful soloists during the late '80s, technically adept yet always firmly grounded in the gritty Aerosmith and Stones licks he loved. Slash was born Saul Hudson on July 23, 1965, in Stoke-on-Trent, England, to artistic parents both involved in the entertainment industry; his mother was a clothing designer who worked on David Bowie's film The Man Who Fell to Earth, and his father designed album art for such artists as Neil Young and Joni Mitchell. The family eventually moved to Hollywood, where Hudson attended junior high, received his first guitar, and met future GNR drummer Steven Adler. With Hudson adopting the nickname Slash, given to him by a family friend, the two formed a band called Road Crew; although it proved unsuccessful, it was the vehicle through which they met and eventually joined up with the other members of Guns N' Roses.\n\nThe Gunners debuted in June 1985, and even before Appetite for Destruction was released in 1987, the band acquired a reputation as notorious alcohol and drug abusers. As their popularity soared, the reserved Slash established himself as an important part of the band's visual image, with a top hat and a mound of shaggy black hair covering his face as he typically staggered around the stage with a cigarette dangling from his mouth. Hedonistic excess consumed most of the band, with such incidents as Slash and Duff McKagan's drunken, profane acceptance of the band's American Music Award on live television. In 1990, opening for the Rolling Stones, Axl Rose's infamous on-stage pronouncement that he would leave the band if certain members did not stop &quot;dancing with Mr. Brownstone&quot; (using heroin) was primarily directed at Slash and Adler; Slash kicked his habit within a year, but Adler did not and was fired. In 1992, Slash courted controversy again with a product endorsement for Black Death vodka. Later that year, he was married to actress and model Renee Sorum, a union that lasted five years.\n\nMeanwhile, in spite of controversy and personnel turnovers, Guns N' Roses had actually continued to record music. After the Use Your Illusion sets of 1991 and the 1993 punk covers album The Spaghetti Incident?, the band went on hiatus. Slash formed a side project called Slash's Snakepit, which consisted of fellow Gunners Matt Sorum (drums) and Gilby Clarke (guitar), plus bassist Mike Inez and vocalist Eric Dover. The group released an album in 1995 titled It's Five O'Clock Somewhere; Slash hit the road with a slightly different touring lineup, with Brian Tichy and James LoMenzo signing on as the rhythm section. In 1996, Slash put together a different band to play at a blues festival in Budapest, an endeavor that evolved into Slash's Blues Ball. Featuring vocalist/harmonica player Teddy Andreadis, rhythm guitarist Bobby Schneck, saxophonist Dave McClarem, bassist Johnny Griparic, and drummer Alvino Bennet, Slash's Blues Ball devoted themselves primarily to a repertoire of classic blues covers, plus occasional GNR and Snakepit material.\n\nRumors about the status of Guns N' Roses had been swirling for some time, and in October 1996 it was confirmed that, owing to his unwillingness to follow Axl Rose's interest in industrial and electronic music, Slash was no longer a member of the band (although he left the door open for a reunion if Rose decided to return to guitar-based rock &amp; roll). He gigged off and on with the Blues Ball into 1998, although a rumored live album never materialized. Instead, Slash decided to re-form the Snakepit in 1999 with an entirely different lineup (the original members were by this time involved in other projects, and the Blues Ball was more suited to touring than developing original material). Raspy-voiced singer Rod Jackson and ex-Venice drummer Matt Laug came on board, along with Blues Ball bassist Griparic (now Johnny Blackout) and Teddy Andreadis, who contributed keyboard and harmonica work. After trying out ex-Alice Cooper guitarist Ryan Roxie, Slash settled on rhythm guitarist Kerry Kelly, who had previously worked with Warrant and Ratt.\n\nThe new Snakepit played some gigs together and in the spring of 2000 completed a new album, which was originally slated to be released on Interscope/Geffen. However, feeling that a more traditional guitar rock album would get lost in the promotional shuffle, Slash moved over to Koch, which finally released Ain't Life Grand in October 2000. A few years later, Slash teamed up again with McKagan and other notable rockers to form the supergroup Velvet Revolver, who released their first album in 2004.\n\n\n\nTracklist:\n\n01. Back To Cali\n02. Communication Breakdown (Led Zeppelin Cover)\n03. Fall To Pieces\n04. Rocket Queen\n05. Starlight\n06. Sucker Train Blues\n","torrent":{"xt":"urn:btih:5c7ca67229f9fb84903f40b2c08eed1ac5e1c414","amp;dn":"Slash+feat+Myles+Kennedy+-+iTunes+Session+%28EP%29mp3+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c7ca67229f9fb84903f40b2c08eed1ac5e1c414","infoHashBuffer":{"type":"Buffer","data":[92,124,166,114,41,249,251,132,144,63,64,178,192,142,237,26,197,225,196,20]},"announce":[],"urlList":[]}}