{"title":"Pirates XXX","uid":4385034,"size":2069957632,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5e7df0e6242fa48e1fb209d36b1c5967e3075427&amp;dn=Pirates+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"muryucu","files":1,"time":1220873633,"description":"Pirates (also known as Pirates XXX) is a 2005 pornographic film produced by Digital Playground and Adam &amp; Eve. It stars Jesse Jane, Carmen Luvana, Janine Lindemulder, Devon, Jenaveve Jolie, and Evan Stone. The film was directed by Joone and features many references to the 2003 film Pirates of the Caribbean: The Curse of the Black Pearl.\n\nThe producer stated in an interview that Pirates was the most expensive pornographic film made to date,[1] with a reported budget of over 1 million U.S. dollars[2] and featuring unusually high production values for a pornographic film.\n \n \n In 1763, Captain Edward Reynolds (Evan Stone) is hunting pirates, or at least trying to do so. He does not consider himself a great commander, and neither do most of his crew. Only his first officer, Jules (Jesse Jane), believes in him. When they save a young woman named Isabella (Carmen Luvana) from drowning, she tells them that her husband's ship has been destroyed by the feared Captain Victor Stagnetti (Tommy Gunn) and his crew of cutthroat pirates.\n\nReynolds and his crew go hunting for Stagnetti, who tries to find a map that leads to a powerful secret on an island somewhere in the Caribbean Sea. Stagnetti finds the secret &quot;staff&quot; unlocked by Isabella's husband Manuel (Kris Slater).\n\nAfter the crew escapes the spawn of darkness summoned by Stagnetti, their ship engages Stagnetti's in battle, ending Stagnetti's reign as a pirate.\n \n \n \n &lt;a href=&quot; http://www.piratesxxx.com/main.php?tab=photo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.piratesxxx.com/main.php?tab=photo&lt;/a&gt;","torrent":{"xt":"urn:btih:5e7df0e6242fa48e1fb209d36b1c5967e3075427","amp;dn":"Pirates+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e7df0e6242fa48e1fb209d36b1c5967e3075427","infoHashBuffer":{"type":"Buffer","data":[94,125,240,230,36,47,164,142,31,178,9,211,107,28,89,103,227,7,84,39]},"announce":[],"urlList":[]}}