{"title":"Paula Morelenbaum - Berimbaum (2004) [BossaNova][mp3 320][h33t][","uid":4935697,"size":114783884,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5ea6f05a39c365488e0ef638769fb29b631c1409&amp;dn=Paula+Morelenbaum+-+Berimbaum+%282004%29+%5BBossaNova%5D%5Bmp3+320%5D%5Bh33t%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":17,"time":1244236019,"description":"Paula Morelenbaum - Berimbaum \nOriginal Release Date: November 2, 2004 \nLabel: Universal Latino \nBitrate: 320 kbps\n\nA veteran of the Brazilian samba scene, Morelenbaum has an impeccable pedigree in the music. But for this album, she's chosen as a common thread songs by the great Vinicius DeMoraes, whether as sole or co-composer. It makes for a great theme, with so much quality work to choose from. What makes this so fascinating are the arrangements used to frame the pieces, like the light Brazilian funk used on &quot;Tomara&quot; and &quot;Berimbau,&quot; for example, which both float, lighter than air, over truly imaginative drum programming and instrumental performances. Morelenbaum's glorious voice sets the standard throughout, breathy but gloriously melodic (she also deserves great credit for her production work here). Even brass sounds feather-light, gliding by the songs. And yet it retains a real groove, a toe-tapping funk that's irresistible and does full justice to the songs themselves. Even a bossa ballad like &quot;Insensetaz&quot; is given quirky little touches, like the irresistible cello line by Morelenbaum's husband, Jacques. It's an album of details and quirks in the melodies and rhythms, gentle and lulling, but still constantly pushing forward, and rewarding no matter how many times you listen to it. ~ Chris Nickson - allmusic.com\n\nPaula Morelenbaum is known for absolutely authentic, traditional takes on bossa classis, particularly Tom Jobim, with whom she and her husband Jaques, performed. But here she is taking on the eletro/ bossacucanova/bebel/eletronica thing with rather strong results. My favorite track by far is the little samba well-known from the Black Orpheus soundtrack, Jobim's O Nosso Amor, which is rarely redone compared to other gems from that film. Here its just giddy with guitar by Luiz Brasil, shortened lyrics, and an almost childlike simplicity from the singer. The other tracks are also a pleasure -- not only because they draw on wonderful, classic compostions but because every arrangement is unique and not much of her husband's cello has been shoehorned into the project (normally his playing is great, but here it's really out of place). ~ Eric Crawford \n\nAbout Paula Morelenbaum\n&quot;Antonio Carlos Jobim used to say that his group, Nova Banda, was made up of five beautiful girls, five handsome guys and a dirty old man. Paula Morelenbaum was one of these girls and her husband, Jaques, one of the boys. In the period 1984-1994, Paula toured around the world with Jobim Brazil, Japan, Europe, Canada, U.S performing at prestigious venues such as the Carnegie Hall and Lincoln Center in New York City, being also featured in the following albums by Jobim: Passarim, Antonio Brasileiro, Tom Jobim InÃƒÂ©dito and Tom canta Vinicius. It all started four years earlier (1980) as a member of vocal ensemble CÃƒÂ©u da Boca, . The group released the albums CÃƒÂ©u da Boca (1981) and Baratotal (1982), having performed extensively in Brazil for five years. In 2004, Paula Morelenbaum released her second solo album, Berimbaum, a tribute to the poet of bossa nova, Vinicius de Moraes. Framed within a modern, electro-acoustic concept, it has garnered warm acceptance both from the public and critics. The album was produced by Paula Morelenbaum in collaboration with Antonio Pinto, Leo Gandelman, Celso Fonseca, Bossacucanova and Beto Villares.&quot;\n\nPersonnel:\nRenato Alsher Engineer\nMauricio Alves Percussion, Xequere\nSidnei Borgani Trombone\nBossacucanova Percussion, Arranger, Keyboards, Producer\nLÃƒÂ©o BrandÃƒÂ£o Organ\nLuis Brasil Guitar (Acoustic), Guitar, Percussion, Engineer\nEdmilson Capelupi Guitar, Guitar (7 String Acoustic)\nEd CÃƒÂ´rtes Saxophone\nMarcelo Costa Berimbau\nLuciana De Moraes Vocals, Spoken Word\nVinÃƒÂ­cius de Moraes Vocals, Spoken Word\nAlexandre Fonseca Percussion, Sampling, Loops, Loop\nCelso Fonseca Guitar (Acoustic), Guitar, Percussion, Arranger, Guitar (Electric), Programming, Producer, Engineer, Program\nCarlinhos Freitas Mastering\nLeo Gandelman Flute, Arranger, Keyboards, Sax (Baritone), Producer, Engineer, Fender Rhodes, Mouth Organ\nNahor Gomes Trumpet, Trumpet (Bass)\nPaulo Jobim Guitar (Acoustic), Guitar\nSidinho Moreira Percussion\nJaques Morelenbaum Cello, String Arrangements, DX-7, Electric Cello\nPaula Morelenbaum Vocals, Whistle (Human), Producer, Art Direction, Concept, Art Supervisor, Project Graphics, Assobios\nAntonio Carles Marques Pinto Guitar, Percussion, Arranger, Keyboards, Producer, Bateria, Program, Baixo\nAntonio Carlos Neves Pinto Guitar (Acoustic), Bass, Percussion, Arranger, Drums, Keyboards, Programming, Ukulele, Producer, Engineer\nCarlos Alberto Sion Executive Producer\nDudu Trentin Keyboards\nAndre Vasconcelos Baixo\nBeto Villares Bass, Arranger, Guitar (Electric), Producer, Engineer, Sampling, Guitarra Concheros, Baixo\nJuliano Zanoni Arranger, Programming, Engineer, Loops, Rhythm Programming \n\nPaula Morelenbaum - Berimbaum Tracks:\n01  Tomara\n02  ConsolaÃƒÂ§ÃƒÂ£o\n03  Berimbau\n04  Canto de Ossanha\n05  Insensatez\n06  Medo de Amar (Vire Essa Folha Do Livro)\n07  Brigas Nunca Mais\n08  VocÃƒÂª E Eu\n09  Seule\n10  Desalento\n11  Primavera\n12  O Nosso Amor","torrent":{"xt":"urn:btih:5ea6f05a39c365488e0ef638769fb29b631c1409","amp;dn":"Paula+Morelenbaum+-+Berimbaum+%282004%29+%5BBossaNova%5D%5Bmp3+320%5D%5Bh33t%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ea6f05a39c365488e0ef638769fb29b631c1409","infoHashBuffer":{"type":"Buffer","data":[94,166,240,90,57,195,101,72,142,14,246,56,118,159,178,155,99,28,20,9]},"announce":[],"urlList":[]}}