{"title":"[DVD5 ITA-ENG] Pulp Fiction [CR-Bt]","uid":4718345,"size":4680839168,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5f2b8d1e4aec2c1292d97784830de82a749d369a&amp;dn=%5BDVD5+ITA-ENG%5D+Pulp+Fiction+%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CR-Bt","files":14,"time":1234387709,"description":"[DVD5 ITA-ENG] Pulp Fiction [CR-Bt]\n\nTRAMA\n\n4 storie di violenza s'intersecano in una struttura apparentemente circolare che va avanti e indietro nel tempo: si chiude 1) due balordi (T. Roth, A. Plummer) si accingono a fare una rapina in una tavola calda; 2) due sicari (J. Travolta, S.L. Jackson) recuperano una valigetta preziosa, puliscono la loro auto, insozzata dal sangue e dal cervello di un uomo ucciso per sbaglio, con l'aiuto di Mr. Wolf (H. Keitel), l'uomo che risolve problemi, e vanno a mangiare proprio nella tavola calda della rapina; 3) uno dei due sicari (Travolta) deve portare a ballare Mia (U. Thurman), moglie del capo (V. Rhames), che, scambiata eroina per cocaina, va in overdose; 4) il pugile Butch (B. Willis) contravviene ai patti, vince un incontro che doveva perdere e scappa con la borsa.\n\nRECENSIONE\n\nIspirato a quella narrativa popolare di ambiente criminale che, dagli anni '30 e '40, era pubblicata dai pulp magazines, il 2? film di Q. Tarantino (1963) procede sul filo di un'irridente ironia, di un efferato umorismo nero, di una dialettica tra buffonesco e tragico (tra fun e funesto) che mettono azioni, gesti e personaggi come tra parentesi, in corsivo, anche quando, come nel torvo episodio della sodomizzazione, questo film divertente e caustico dai dialoghi irresistibili penetra nell'abominio del male. Vietato in Italia ai minori di 18 anni. Palma d'oro a Cannes e Oscar per la sceneggiatura (Tarantino, Roger Avary). \n\n\nInformazioni complete su Colombo-Reloaded.org","torrent":{"xt":"urn:btih:5f2b8d1e4aec2c1292d97784830de82a749d369a","amp;dn":"%5BDVD5+ITA-ENG%5D+Pulp+Fiction+%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f2b8d1e4aec2c1292d97784830de82a749d369a","infoHashBuffer":{"type":"Buffer","data":[95,43,141,30,74,236,44,18,146,217,119,132,131,13,232,42,116,157,54,154]},"announce":[],"urlList":[]}}