{"title":"(2005) Quasimodo Jones - Robots &amp; Rebels","uid":8553481,"size":106945431,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5fa7fb99695aa0bc9a93c2bd8289da208e989557&amp;dn=%282005%29+Quasimodo+Jones+-+Robots+%26amp%3B+Rebels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Voshra","files":-1,"time":1370706743,"description":"Quasimodo Jones - Robots &amp; Rebels (2005)\n\n\nQuality: 320CBR | Source: WEB | Genre: Electronic\n\n\nFile List:\n1. Quasimodo Jones - Quasimodo Jones - love commando - Robots &amp; Rebels - 2005 - 320 kbps (4:03)\n2. Quasimodo Jones - Quasimodo Jones - bad cock,good cock - Robots &amp; Rebels - 2005 - 320 kbps (2:50)\n3. Quasimodo Jones - Quasimodo Jones - cannibal woman - Robots &amp; Rebels - 2005 - 320 kbps (2:56)\n4. Quasimodo Jones - Quasimodo Jones - kansas - Robots &amp; Rebels - 2005 - 320 kbps (4:46)\n5. Quasimodo Jones - Quasimodo Jones - why kill time when you can kill yourself - Robots &amp; Rebels - 2005 - 320 kbps (3:08)\n6. Quasimodo Jones - Quasimodo Jones - mixed abuse - Robots &amp; Rebels - 2005 - 320 kbps (2:55)\n7. Quasimodo Jones - Quasimodo Jones - the ballad of quasimodo jones - Robots &amp; Rebels - 2005 - 320 kbps (4:58)\n8. Quasimodo Jones - Quasimodo Jones - rock n roll dream - Robots &amp; Rebels - 2005 - 320 kbps (3:07)\n9. Quasimodo Jones - Quasimodo Jones - somebody stop me before i kill again - Robots &amp; Rebels - 2005 - 319 kbps (3:07)\n10. Quasimodo Jones - Quasimodo Jones - dressed for sick sex - Robots &amp; Rebels - 2005 - 320 kbps (3:12)\n11. Quasimodo Jones - Quasimodo Jones - trailor trash tracy - Robots &amp; Rebels - 2005 - 320 kbps (2:16)\n12. Quasimodo Jones - Quasimodo Jones - hellnight - Robots &amp; Rebels - 2005 - 320 kbps (3:27)\n13. Quasimodo Jones - Quasimodo Jones - ride the bull - Robots &amp; Rebels - 2005 - 320 kbps (3:29)\n\n\n\nA bit about the album:\nQuasimodo Jones is definitely a unique artist and has a signature style that's unmistakably awesome; that's all I can say. Sadly, not many people know about him and his stuff is hard to come by - have a listen, its not to everyone's style for sure but *shrug* it's only 100ish MB of your life :P\n\nFrom The Internet:\n&quot;Quasimodo Jones and Kid Rock are the same sides of a 5 cent coin. They both stand at eye level on the stoop of the entrance to their RV in a trailer park of White Trash USA. Their musical affinity is not only similar to ringing bells made of silicone, but they also speak with an aggressive tone when it comes to their brutal images. The direct comparison to Kid Rock is of course a stinking farce cause he's a lazy bum. Quasimodo Jones has already recorded 23 albums that he made himself. The records were never released because they were ahead of their time. Quasimodo Jones makes 'Rock with 70s plugins and his guitar'. As a producer he was able to blackmail Hakan Lidbo who will supposedly receive a first class star-banner on his gravestone.\n\nRock'n Roll Dream hit first place with readers of 'Hustler' magazine in the category of hog-rotten rock songs. This is why T.Raumschmiere drops off a remix with only one hand. Even the astounding Beate Bartel heard about it from the center of the earth where she has been residing of late. From here she sends her recordings against the laws of gravity straight up a shaft directed at select groups. 'Somebody stop me before I kill again,' the other piece of Quasimodo Jones, is of another caliber maybe 22mm spooky electro. The nice thing about this record is, moreover, that it's not an album.\n\nThat one's still on the way says the official smog warning coming from the Shitkatapult camp. But who really is Quasimodo Jones? Jones is an orphan from Wisconsin and also a tramp who cites the riddim of train-wheels as an early musical influence. He learned to drink, throw down, and accept Elvis as King from his stepfather. His mother taught him to scream since that's how he came out into the world thanks to her alcohol and heroin abuse. Even though he never handled it well, Jones was allowed to stay at home since school was regarded as something for rich snobs by his caretakers. His first experience on stage was at the tender age of 8 with the Oak Ridge Boys.\n\nHis second performance was with a stolen guitar from the neighboring kid where he sang Elvis songs and ended up in juvi. This is where he first discovered smoking up along with other drugs. He is most proud of having hit his stepfather in the face with a baseball bat, knocking all of his teeth out as he fell from a tree onto the ground. His favorite show is Alf.&quot; ","torrent":{"xt":"urn:btih:5fa7fb99695aa0bc9a93c2bd8289da208e989557","amp;dn":"%282005%29+Quasimodo+Jones+-+Robots+%26amp%3B+Rebels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fa7fb99695aa0bc9a93c2bd8289da208e989557","infoHashBuffer":{"type":"Buffer","data":[95,167,251,153,105,90,160,188,154,147,194,189,130,137,218,32,142,152,149,87]},"announce":[],"urlList":[]}}