{"title":"Eisenhower - The Fight for The Future (Documentary)","uid":4857362,"size":490265845,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:60902b06224411101825d90244a6775fbaa96b97&amp;dn=Eisenhower+-+The+Fight+for+The+Future+%28Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Katkwaraye","files":-1,"time":1240116069,"description":"Source: DVD\nFormat: mkv (because Matroska is how I roll)\nRunning Time: 57:52\nOrg Year: 2007\nSize: 467 MB\nripped by myself\n\nThe History Makers of World War II: Eisenhower - The Fight for The Future\n\nIn the history of World War II many have argued that the bombing of Pearl Harbor by the Japanese in 1941 was the point at which Adolf Hitler lost any advantage that he may have previously had. Effectively this event forced the United States of America into World War II. providing the Allied Forces with everything required to successfully fight on for victory over Adolf Hitler and the Axis Powers.\n\nYet one of the most significant contributions to the war effort was nothing to do with ordinance, ammunition or even regiments of military personnel. Instead it was none other than Dwight D Eisenhower, who would after distinguished service in World War II, go on to become the 34th President of the USA.\n\nAs the Supreme Allied Commander in Europe Eisenhower was charged with the planning and carrying out of the Allied assault on Normandy, better known today as the D-Day Landings that turned out to be the beginning of the end of the war.\n\nThe character of Eisenhower is as fascinating as those of Sir Winston Churchill and Adolf Hitler and the role he played in World War II was of equal significance, so step back in time to witness history and Dwight D Eisenhower in action.\n\nIf you need a seed, PM me here: http://suprbay.org/member.php?u=74576","torrent":{"xt":"urn:btih:60902b06224411101825d90244a6775fbaa96b97","amp;dn":"Eisenhower+-+The+Fight+for+The+Future+%28Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60902b06224411101825d90244a6775fbaa96b97","infoHashBuffer":{"type":"Buffer","data":[96,144,43,6,34,68,17,16,24,37,217,2,68,166,119,95,186,169,107,151]},"announce":[],"urlList":[]}}