{"title":"Lewis&amp;Peron-Liberty Reclaimed(American revolution&amp;conspiracy aga","uid":4454924,"size":267873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60962fa26809349dace459d614f5577e1432a27a&amp;dn=Lewis%26Peron-Liberty+Reclaimed%28American+revolution%26conspiracy+aga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"red_gonzo","files":1,"time":1224435575,"description":"This is James Lewis&amp;#039; and Jim Peron&amp;#039;s inspiring book Liberty Reclaimed - A New Look at American Politics (1984) which is a most readable introduction to the ideals of the American Revolution and its unique political philosophy. But what is even more important it explains how these ideas are being perverted and destroyed. James Lewis, Libertarian Party&amp;#039;s Vice-Presidential candidate in the 1984 U.S. presidential election, wrote this book for the newcomer to politics. It shows how the collectivist view has wormed its way into US political system and points to the dangers we face because of it. Written in the libertarian tradition of Thomas Jefferson and Tom Paine it serves as an important expose of collectivism and an inspiring account of the moral principles that helped make the United States prosperous and free. The American Revolution presented a new ideology to the people. No longer was it to be Government over man, now it was man over Government. Its founding fathers saw government as a servant of the people and not their master. Knowing that human rights can only thrive in a free economic system, they said little about government control of the economy. They believed in laissez-faire capitalism because it is the only economic system consistent with human rights. But as the author sadly concludes, the people of America today would be considered virtual slaves by the men who founded it. Liberty Reclaimed is a fascinating book for anyone concerned about freedom, economic sanity and world peace. 85 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:60962fa26809349dace459d614f5577e1432a27a","amp;dn":"Lewis%26Peron-Liberty+Reclaimed%28American+revolution%26conspiracy+aga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60962fa26809349dace459d614f5577e1432a27a","infoHashBuffer":{"type":"Buffer","data":[96,150,47,162,104,9,52,157,172,228,89,214,20,245,87,126,20,50,162,122]},"announce":[],"urlList":[]}}