{"title":"Bon Jovi - Only Lonely  (2nafish)","uid":5350666,"size":171270148,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:60abe1f56d0e43a5aeebd33beb5f34c88544bf34&amp;dn=Bon+Jovi+-+Only+Lonely++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265781312,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Only Lonely&quot; is a single from American Rock band Bon Jovi. It was the first single taken from their second album, 7800Ã‚Â° Fahrenheit.\n\nDebuting on the Hot 100 on April 20, 1985, it peaked at #54 and remained on the charts for eight weeks. The song fared better on the Mainstream Rock Tracks chart, where it peaked at #28 in May.\n\n&quot;Only Lonely&quot; was played in the 1987 drama film Light of Day starring Michael J. Fox, Gena Rowlands, Joan Jett and Michael McKean.\n\n7800Ã‚Â° Fahrenheit is Bon Jovi's second album, and was released in April 1985. It introduced the classic '80s Bon Jovi logo that would later on be used in Slippery When Wet and New Jersey.\n\nApproximate sales were in excess of one million copies. The singles &quot;In and Out of Love&quot; and &quot;Only Lonely&quot; both charted in the Billboard Hot 100 (although both failed to reach the top 40 status of &quot;Runaway&quot; from the previous album), and still get occasional airplay on US AOR and hard rock format radio stations.\n\nThe album was remastered and re-released in 1998, adding the music video for &quot;In and Out of Love&quot; as a bonus track.\n\nThe band has essentially disowned this album in recent years because they believe the material presented on it does not match the standards set on their later releases. Aside from a few extremely rare performances of the song 'Tokyo Road' (all of which occurred in Japan), nothing from this album has been played live in almost 20 years since the conclusion of the Jersey Syndicate Tour. However, January 21st, 2010, the Bon Jovi official website has announced that during The Circle Tour, from 2010 and 2011, Bon Jovi will play off of the 7800Ã‚Â° Fahrenheit album, the first time in over 20 years.\n\nBon Jovi is an American rock band from Sayreville, New Jersey. Formed in 1983, Bon Jovi consists of lead singer and namesake Jon Bon Jovi, guitarist Richie Sambora, keyboardist David Bryan, drummer Tico Torres, former bassist Alec John Such, as well as current bassist Hugh McDonald. The band's line-up has remained mostly static during their 26-year history, the only exception being the departure of Alec John Such in 1994, who was unofficially replaced by Hugh McDonald. The band have become known for writing several rock anthems, and achieved widespread recognition with their third album Slippery When Wet, released in 1986. Bon Jovi are well-known for songs including &quot;Livin' on a Prayer&quot;, which has become their signature song, as well as &quot;You Give Love a Bad Name&quot;, &quot;Wanted Dead or Alive&quot;, &quot;Bad Medicine&quot;, &quot;Keep the Faith&quot;, &quot;Bed of Roses&quot;, &quot;Always&quot;, &quot;It's My Life&quot; and &quot;Have a Nice Day&quot;. Their latest hit single is &quot;We Weren't Born to Follow.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:60abe1f56d0e43a5aeebd33beb5f34c88544bf34","amp;dn":"Bon+Jovi+-+Only+Lonely++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60abe1f56d0e43a5aeebd33beb5f34c88544bf34","infoHashBuffer":{"type":"Buffer","data":[96,171,225,245,109,14,67,165,174,235,211,59,235,95,52,200,133,68,191,52]},"announce":[],"urlList":[]}}