{"title":"Chriskitch - Big Flavours from a Small Kitchen (gnv64)","uid":12000010,"size":13863003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60afa7befebff2a7e98e5d63741cf45467c089f8&amp;dn=Chriskitch+-+Big+Flavours+from+a+Small+Kitchen+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":4,"time":1433757601,"description":"Chriskitch - Big Flavours from a Small Kitchen\nby Chris Honor and Laura Washburn Hutton\nMitchell Beazley | June 2015 | eISBN: 9781784720865 | 12.6 mb\n\nAustralian-born chef Chris Honor has been hailed by Giles Coren of The Times as 'a nailed-on culinary genius', running 'the most rewarding small local restaurant I have encountered in years'. His recipes for great salads, sweet and savoury bakes, soups and wonderful sharing plates are highly original, but really simple to create at home, and with American food writer Laura Washburn Hutton he shares 100 of his most memorable recipes. Chris writes: 'What this book will offer the reader is an education in balancing taste and texture, with plenty of visual inspiration. It is as much guidebook as cookery book because I don't necessarily think in terms of recipes, I think in terms of combinations. Mix up the flavours and textures and, at the same time, make it appeal to the eye. Be generous, make it unpredictable; this is what I do. My book will teach the reader to do this too.'\n\nAbout the Author\nChris Honor has worked with a range of world-class chefs during his diverse career - including Gordon Ramsay, David Nicolas, Chris Janson and Henry Brosi. He has worked all over the world and managed a team of 120 chefs at the Dorchester in London, but wanted to return to his cooking roots when launching his own restaurant. His new venture, Chriskitch, based in Muswell Hill, north London, uses his Australian upbringing, classical French training and world-wide experiences to create fantastically flavourful food that has customers queuing round the block. &lt;a href=&quot;\nhttp://s10.postimg.org/la4n7ng15/laura.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s10.postimg.org/la4n7ng15/laura.jpg&lt;/a&gt;\nLaura Washburn Hutton (Author) Since graduating from the prestigious Ecole de Cuisine La Varenne in Paris, Laura Washburn Hutton has had a number of careers. In Paris, she worked as an assistant to Patricia Wells. Later, after moving to London, she worked as a Commissioning Editor, overseeing the publications of many cookery books as well as writing numerous publications herself. Opting for a better work-life balance, she has slowed down the pace to be able to 'have the time to actually cook instead of only reading about it'. She now combines writing about food with teaching people how to cook.\n\nCONTENTS\nIntroduction\nSalads - Raw Salads, Cooked Salads, Grains and Pulses\nBrunch - Eggs Meze\nSoups\nMains - Fish, Meat, Vegetables\nBakery - Breads, Cakes\nExtras - Drinks, Salad dressings, Conserves and chutneys, Flavoured salts and sugars, Pickles\nIndex\nAcknowledgements\n &lt;a href=&quot;\nhttp://s3.postimg.org/mprp2nann/Chriskitch_Big_Flavours_from_a_Small_Kitchen.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s3.postimg.org/mprp2nann/Chriskitch_Big_Flavours_from_a_Small_Kitchen.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:60afa7befebff2a7e98e5d63741cf45467c089f8","amp;dn":"Chriskitch+-+Big+Flavours+from+a+Small+Kitchen+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60afa7befebff2a7e98e5d63741cf45467c089f8","infoHashBuffer":{"type":"Buffer","data":[96,175,167,190,254,191,242,167,233,142,93,99,116,28,244,84,103,192,137,248]},"announce":[],"urlList":[]}}