{"title":"The Sex Education Show 2008 Season1","uid":4816139,"size":2262054146,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6103715f75c751b3128e5bfb749aaa96c077028a&amp;dn=The+Sex+Education+Show+2008+Season1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0712120","files":7,"time":1238580435,"description":"NOTE: This is NOT porn, it is a sex education show broadcasted by Channel 4.\n----------------------------------------------------------------------------\n\nThe Sex Education Show, Season 1 (complete: 6 episodes)\nChannel 4, 2008\n\n\nAnna Richardson hosts a series which aims to tackle the UK's sexual ignorance and reticence.\nThe series explores British attitudes to sex discovering what people of all ages know, think and do in the bedroom. Examining the rise in STIs, teenage pregnancy and the ubiquity of pornography, she discovers a country where it appears easier to have sex than talk about it. Specially commissioned surveys and discussions cover the full range of sexual experiences and their consequences.\n\n----------------------------------\nS01E01\nDate: 9th Sept,2008\nAnna Richardson explores British attitudes to sex, discovering what people of all ages know, think and do in the bedroom.\nExamining the rise in STIs, teenage pregnancy and the ubiquity of pornography, she discovers a country where it appears easier to have sex than talk about it.\nSpecially commissioned surveys and discussions cover the full range of sexual experiences and their consequences.\n----------------------------------\nS01E02\nDate:15 Sept '08\nAnna puts herself through a full sexual MOT and goes back to school to show teenagers the symptoms of the most common STIs. A football team find out if testing for men is a painful as rumoured, and a group of teenagers reveal how social networking sites are used to organise sex parties with strangers. Plus, an anatomy lesson on female genitals and Anna makes her first foray into burlesque.\n----------------------------------\nS01E03\nDate:23 Sept '08\nThe daunting realities of the delivery room are revealed as Anna Richardson visits the maternity ward at Countess of Chester Hospital, and Gordon Ramsay's wife Tana describes her personal experiences of childbirth. A group of teenagers get a hands-on lesson in contraception, and Anna tries to discover whether aphrodisiac foods really do boost a person's sex drive.\n----------------------------------\nS01E04\nDate:30 Sept '08\nAnna Richardson embarks on an emotional roller-coaster ride as she takes a fertility test, and investigates claims that perfumes can attract the opposite sex. She also reveals the truth about men's lack of genital hygiene with the help of Long Ashton football team.\n---------------------------------\nS01E05\nDate: 7th Oct, 2008\nAnna Richardson's exploration of British attitudes to sex continues as she gets to grips with alternative ways to lead a responsible sex life without the use of the contraceptive pill. A group of apprehensive teenagers also become `baby borrowers' for a day, and a teenage girl who has had more than 60 sexual partners talks candidly about her lifestyle.\n----------------------------------\nS01E06\nDate: 14th Oct, 2008\nIn the final programme of the series, Anna Richardson organises a sex education class with a difference,\nin which the inquisitive pupils will be tutored by their own parents.\nHowever, the unsuspecting teenagers discover they are not alone in their embarrassment,\nas their would-be teachers are asked to candidly reveal their own sexual histories.\nPlus, Anna examines the inner workings of the libido.","torrent":{"xt":"urn:btih:6103715f75c751b3128e5bfb749aaa96c077028a","amp;dn":"The+Sex+Education+Show+2008+Season1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6103715f75c751b3128e5bfb749aaa96c077028a","infoHashBuffer":{"type":"Buffer","data":[97,3,113,95,117,199,81,179,18,142,91,251,116,154,170,150,192,119,2,138]},"announce":[],"urlList":[]}}