{"title":"Jaime Roos - Repertorio  (EAC) [WAV]","uid":13053193,"size":1000406794,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:620c62b6443d6f5ca864ec9865890bf783a1db42&amp;dn=Jaime+Roos+-+Repertorio++%28EAC%29+%5BWAV%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ISOARG","files":16,"time":1450640824,"description":"Jaime Roos - Repertorio  (EAC) [WAV] 600ppp\r\n\r\n\r\nJaime Andrés Roos Alejandro, conocido popularmente como Jaime Roos (Montevideo, Uruguay, 12 de noviembre de 1953) es un cantante, músico, compositor y productor uruguayo de música popular de ese país.\r\n\r\nLos tambores que recorren el Barrio Sur, lo que transmite la radio, la música de los tablados del carnaval, los Beatles y el rock han sido algunas de las influencias que asimiló para luego plasmar una música con personalidad y sello propio que le ha valido el éxito con el que cuenta en su país, y que se está extendiendo a nivel internacional. Estas características hacen que sea uno de los cantantes uruguayos más populares, con gran venta de discos, y conciertos con entradas agotadas.\r\n\r\nVivió desde chico en un departamento sobre la calle Convención a metros de Durazno, esquina que inmortalizó en una de sus canciones más conocidas, «Durazno y Convención». Su música fusiona rock, candombe, milonga, tango y murga, interpretando el sonido de Montevideo. Es reconocido hincha de Defensor Sporting, a cuyo primer campeonato dedicara otro de sus temas más conocidos, «Cometa de La Farola». Entre sus éxitos caben de mencionar «Brindis por Pierrot», «Amándote» y «Si me voy antes que vos»","torrent":{"xt":"urn:btih:620c62b6443d6f5ca864ec9865890bf783a1db42","amp;dn":"Jaime+Roos+-+Repertorio++%28EAC%29+%5BWAV%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"620c62b6443d6f5ca864ec9865890bf783a1db42","infoHashBuffer":{"type":"Buffer","data":[98,12,98,182,68,61,111,92,168,100,236,152,101,137,11,247,131,161,219,66]},"announce":[],"urlList":[]}}