{"title":"Jesus Shakes India (Part 1)","uid":8774923,"size":608801389,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:6210bd78525d2f6d07c01cc4c3874591d891f5ea&amp;dn=Jesus+Shakes+India+%28Part+1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IndianChristian","files":19,"time":1375530984,"description":"Jesus shook India, the land of Spiritual Darkness through Benny Hinn. Scores were healed and cured in the name of Jesus Christ during the 3 day crusade attended by approx 7 million people. Benny Hinn himself made it clear that he himself cannot heal even a fly; It is Jesus who heals. \n\nThe caste Hindus were livid with rage and hatred seeing the miracles. Even before the program started, they went on stone-pelting and arson rampage across the city of Bangalore which left several persons injured. Normal life was disrupted as angry mobs forcibly shut down shops and blocked traffic in many areas following the bandh call given by the Hindu Jagran Vedike a Hindu Terrorist organization. Over 200 buses and private vehicles were damaged and several houses and shops set on fire.\n\nYet people attended in droves. 60% of those in attendance were Hindus. the love of Jesus shone on the sick people. Jesus is love and he loves everyone. Hinduism has 330 million gods and scores of godman and sages. But none of them can do even one puny miracle. All the 330+ million gods and godman cannot match one servant of the true God by the name of Benny Hinn.\n\nScores are coming to Jesus Christ in Bangalore today. A decade back Christians made up only 4% of the 6.5 million population. Today the number around 8% in Bangalore and Bangalore's population has grown to 8.5 million as per the lastest census. \n\n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n","torrent":{"xt":"urn:btih:6210bd78525d2f6d07c01cc4c3874591d891f5ea","amp;dn":"Jesus+Shakes+India+%28Part+1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6210bd78525d2f6d07c01cc4c3874591d891f5ea","infoHashBuffer":{"type":"Buffer","data":[98,16,189,120,82,93,47,109,7,192,28,196,195,135,69,145,216,145,245,234]},"announce":[],"urlList":[]}}