{"title":"off road drive demo 2011 (Russian)","uid":6544400,"size":653150290,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:630780ec5a2432e62f455bb2eb7d84987e6ee99e&amp;dn=off+road+drive+demo+2011+%28Russian%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dagger33","files":1,"time":1310805390,"description":"Off-Road Drive\n\nPlatforms: PC, Xbox 360\n\nOff-Road Drive is the next title in the famous off-road driving simulation series.\n\nCross-country driving in specially tuned Sport Utility Vehicles (SUVs) is the real challenge for determined and tough extreme sports drivers. This sport becomes more and more popular across the world every day.\n\nOff-Road Drive lets players participate in various international competitions never seen before in a video game. All virtual contests are the exact duplicates of the real ones, including various extreme driving and use of the rules established by the international auto sports federations.\n\nVehicles in the game have the same features as the real prototypes. Each one belongs to a certain class suitable for certain competitions and fully complies with the international requirements. While completing the tracks in varying difficulties, players not only control the speed and heading of the vehicle, but locking the main, front and rear differential gears, using the winch, shifting into low gear and adjusting tire pressure.\n\nKey features:\n\nState-of-the-art Unreal Engine 3 provides for stunning visuals and a realistic physics model: off-road vehicle behavior is simulated using real-world parameters, including vehicle suspension type and resistance of the environment. Depending on driver actions, the vehicle can bog down, stall or skid.\nNew specially modified off-road vehicles, including exotic ones like the Russian UAZ.\nUnprecedented tuning abilities: compressor for adjusting tire pressure, winch, snorkel, suspension lifting and others.\nVarious international competitions including Petronas Suvium Silverstone Challenge in Thailand, the largest Russian Ladoga-trophy raid and many more.\nDozens of the hardest tracks with plenty of difficult obstacles such as swamps, mud, water bodies, steep slopes, quick sands and rock blockages.\nVarious multiplayer modes via Internet and LAN.","torrent":{"xt":"urn:btih:630780ec5a2432e62f455bb2eb7d84987e6ee99e","amp;dn":"off+road+drive+demo+2011+%28Russian%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"630780ec5a2432e62f455bb2eb7d84987e6ee99e","infoHashBuffer":{"type":"Buffer","data":[99,7,128,236,90,36,50,230,47,69,91,178,235,125,132,152,126,110,233,158]},"announce":[],"urlList":[]}}