{"title":"Richard Dawkins - The Ancestor's Tale (audio &amp; illustrations)","uid":5289742,"size":164182381,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:638f8782635432b122b2ff87389e425186a34127&amp;dn=Richard+Dawkins+-+The+Ancestor%5C%27s+Tale+%28audio+%26+illustrations%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LucasArt","files":37,"time":1263857387,"description":"THE ANCESTOR'S TALE - RICHARD DAWKINS - AUDIO FILES WITH FULLY ILLUSTRATED PDF FILES.\n\n\nThe Ancestor's Tale (subtitled A Pilgrimage to the Dawn of Life) is a 2004 popular science book by Richard Dawkins, with contributions from Dawkins' research assistant Yan Wong. It follows the path of humans backwards through evolutionary history, meeting humanity's cousins as they converge on common ancestors. The book was nominated for the 2005 Aventis Prize for Science Books.\n\nThe narrative is structured as a pilgrimage, with all modern animals following their own path through history to the origin of life. Humans meet their evolutionary cousins at rendezvous points along the way, the points at which the lineage diverged. At each point Dawkins attempts to infer, from molecular and fossil evidence, the probable form of the most recent common ancestor and describes the modern animals that join humanity's growing travelling party. This structure is inspired by Geoffrey Chaucer's The Canterbury Tales.\n\nThe pilgrimage visits a total of 40 &quot;rendezvous points&quot; from rendezvous zero, the most recent common ancestor of all of humanity, to rendezvous 39, eubacteria, the ancestor of all surviving organisms. Though Dawkins is confident of the essential shape of this phylogenetic taxonomy, he enters caveats on a small number of branch points where a compelling weight of evidence had not been assembled at the time of writing.\n\nAt each rendezvous point, Dawkins recounts interesting tales concerning the cousin animals which are about to join the band of pilgrims. Every newly recruited species, genus or family has its own peculiar features. For instance, Dawkins discusses why the axolotl never needs to grow up, how new species come about, how hard it is to classify animals, and why our fish-like ancestors moved to the land. These peculiar features are studied and analyzed using a newly introduced tool or method from evolutionary biology, carefully woven into a tale to illustrate how the Darwinian theory of evolution explains all diversity in nature.\n\nEven though the book is best read sequentially, every chapter can also be read independently as a self-contained tale with an emphasis on a particular aspect of modern biology. As a whole, the book elaborates on all major topics in evolution. The Ancestor's Tale can be considered an encyclopedia[citation needed] on evolution written as a collection of stories.\n","torrent":{"xt":"urn:btih:638f8782635432b122b2ff87389e425186a34127","amp;dn":"Richard+Dawkins+-+The+Ancestor%5C%27s+Tale+%28audio+%26+illustrations%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"638f8782635432b122b2ff87389e425186a34127","infoHashBuffer":{"type":"Buffer","data":[99,143,135,130,99,84,50,177,34,178,255,135,56,158,66,81,134,163,65,39]},"announce":[],"urlList":[]}}