{"title":"De Re Metallica - Georgius Agricola - auen1","uid":7979026,"size":486854934,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:639b333a6e1410a6928ef61866c53c64fd6a64de&amp;dn=De+Re+Metallica+-+Georgius+Agricola+-+auen1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Auen1","files":-1,"time":1357107329,"description":"The classic. Enjoy and please seed.\n\n\nDe re metallica (Latin for On the Nature of Metals (Minerals)) is a book cataloguing the state of the art of mining, refining, and smelting metals, published a year posthumously in 1556 due to a delay in preparing woodcuts for the text. The author was Georg Bauer, whose pen name was the Latinized Georgius Agricola. The book remained the authoritative text on mining for 180 years after its publication. It was also an important chemistry text for the period and is significant in the history of chemistry.[1]\n\nAgricola had spent nine years in the Bohemian town of Joachimsthal, now in the Czech Republic. (Joachimsthal is famous for its silver mines and the origin of the word &quot;Thaler&quot; and, ultimately, &quot;dollar.&quot;) After Joachimsthal, he spent the rest of his life in Chemnitz, a prominent mining town in Saxony. Both Joachimsthal and Chemnitz are in the Erzgebirge, or Ore Mountains.\n\nIn 1912, the first English translation of De Re Metallica was privately published in London by subscription. The translators were Herbert Hoover, a mining engineer (and later President of the United States), and his wife, Lou Henry Hoover, a geologist and Latinist. The translation is notable not only for its clarity of language, but for the extensive footnotes, which detail the classical references to mining and metals. Subsequent translations into other languages, including German, owe much to the Hoover translations, as their footnotes detail their difficulties with Agricola's invention of several hundred Latin expressions to cover Mediaeval German mining and milling terms that were unknown to classical Latin.","torrent":{"xt":"urn:btih:639b333a6e1410a6928ef61866c53c64fd6a64de","amp;dn":"De+Re+Metallica+-+Georgius+Agricola+-+auen1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"639b333a6e1410a6928ef61866c53c64fd6a64de","infoHashBuffer":{"type":"Buffer","data":[99,155,51,58,110,20,16,166,146,142,246,24,102,197,60,100,253,106,100,222]},"announce":[],"urlList":[]}}