{"title":"Metallica - Ride The Lightning (1984) WMA320","uid":6085129,"size":128549971,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:644723a95ce2247640f0de322738c3d762ead2cc&amp;dn=Metallica+-+Ride+The+Lightning+%281984%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1294292805,"description":"When I first bought this album, it instantly became my favorite. I thought it was incredible, and that nothing could ever touch it. Well, since then I have changed my mind. I have found a lot (but not a whole lot) of albums that are just as good as this one, and even better. But, make no mistake, this is one of the greatest albums ever made, for sure. When the acoustic intro to &quot;Fight Fire with Fire&quot; starts out, you might think you bought the wrong album, but then the heavy guitar hits you like a ton of bricks, and before you know it, you're thrashing around, destroying everything in sight. The guitars are very tight, and awesome solos abound. Cliff's bass is very menacing (if not a bit hard to hear). Lars doesn't stand out much, but he does a pretty decent job. There isn't a bad moment on here, but the highlights would have to be the classic &quot;For Whom the Bell Tolls&quot;, the amazing ballad &quot;Fade to Black&quot;, and, one of the greatest thrash songs ever, &quot;Creeping Death&quot;. It all amounts to what is simply one of the greatest thrash metal albums ever made. There is a great deal of argument as to which Metallica album is the best. Many seem to think that &quot;Master of Puppets&quot; is the best, but I am very adamant in my decision that this is their finest moment. If pressed, I would say that this one and MOP are close to equal. I certainly prefer this one to &quot;Kill Em All&quot; and &quot;And Justice for All&quot;, but MOP is a very close call. Anyway, if you love great metal, this is one album you should definitely buy. If you like this album, and want to hear more great metal, I would recommend &quot;Powerslave&quot; by Iron Maiden (which came out in the same year as RTL, by the way), &quot;Reign in Blood&quot; by Slayer, &quot;The New Order&quot; by Testament, &quot;Among the Living&quot; by Anthrax, &quot;Peace Sells...&quot; by Megadeth, &quot;Cowboys from Hell&quot; by Pantera, and anything by Iced Earth. Man, this was great metal. I wish more people did stuff like this today. \n\nby The Wickerman\n\nTRACKLIST:\n\n01 - Fight Fire With Fire.wma                                    \n02 - Ride The Lightning.wma                                      \n03 - For Whom The Bell Tolls.wma                                 \n04 - Fade To Black.wma                                           \n05 - Trapped Under Ice.wma                                       \n06 - Escape.wma                                                  \n07 - Creeping Death.wma                                          \n08 - The Call Of Ktulu.wma    \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:644723a95ce2247640f0de322738c3d762ead2cc","amp;dn":"Metallica+-+Ride+The+Lightning+%281984%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"644723a95ce2247640f0de322738c3d762ead2cc","infoHashBuffer":{"type":"Buffer","data":[100,71,35,169,92,226,36,118,64,240,222,50,39,56,195,215,98,234,210,204]},"announce":[],"urlList":[]}}