{"title":"sweet electra - lying to be sweet","uid":4646668,"size":71691320,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:646ccfa2ecb766a96a65255101a452dd7d9f5cc8&amp;dn=sweet+electra+-+lying+to+be+sweet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fatfreddycat","files":12,"time":1231906905,"description":"From the &quot;electronic music mexican capital&quot;; Guadalajara, born this project who has been one of the most important projects in the history of Nopal Beat Records (label who was the creator of the Acid Cabaret sound in the world). The firts album of the band &quot;lying to be sweet&quot; which production was leaded by Giovanni Escalera and Guillermo Ramirez (current member of Galapago), counted with the Valentina GonzÃƒÂ¡les's feminine vocals, Paloma Cumplido and Abigail VÃƒÂ¡zquez who in turn tints Sweet Electra's sound with the violin. At the pair of the marked female presence that would give a distinctive stamp to the group, Sweet Electra worked also with the metals of Chemin and Arturo Santilla (PlÃƒÂ¡tistiko), Morfeo HernÃƒÂ¡ndez in the percussions and Juan Carlos Lorenzana in the transverse flute.\nLatin rythms mixed by electronic samplers, atmospeheres, winds, percussions, metals, violins and female voices with lyrics in Spanish, portuguese, english and french, the final result couldn't be easy to describe as it is to enjoy, relax and at the same time makes move your body in a really soft beat.\nPoetry in female shapes, the violin acompanied by electronic sounds and a mix of chill out, ambient, bosa nova, lounge, electronic, house, down tempo, latin rythms and percussions mixed wit the very particular acid cabaret sound that in the new milenium made shine to the new projects from Guadalajara City.\nThis album contains remixes of the tracks Assim and Firefly made by God Is My Name (an experimental band from Jalisco who works in violins and deconstrictions of sounds in time and cadence.) ","torrent":{"xt":"urn:btih:646ccfa2ecb766a96a65255101a452dd7d9f5cc8","amp;dn":"sweet+electra+-+lying+to+be+sweet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"646ccfa2ecb766a96a65255101a452dd7d9f5cc8","infoHashBuffer":{"type":"Buffer","data":[100,108,207,162,236,183,102,169,106,101,37,81,1,164,82,221,125,159,92,200]},"announce":[],"urlList":[]}}