{"title":"Justice Machine","uid":4582926,"size":209543530,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:64965290c30d0cc44694a202f6ac12b299f3c1f2&amp;dn=Justice+Machine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gilgamesh07","files":16,"time":1229504193,"description":"This torrent includes all of the Justice Machine comics that are known to have been scanned as of 12/2/2008.\n\nThe Justice Machine is a fictional team of superheroes originally created by Michael Gustovich and appearing in comic books from many small publishers in the 1980s and 1990s.\n\nJustice Machine debuted in Noble Comics' Justice Machine #1 (June 1981#, created by writer-penciler Michael Gustovich, with the first issue cover penciled by John Byrne and inked by Gustovich. This initial series lasted five issues, cover-dated Winter 1981, April 1982, Fall 1982, and Winter 1983. The first three issues were published in magazine format. An annual publication, Justice Machine Annual #1 #1983) was published by Texas Comics, and featured a crossover with the then-defunct Tower Comics' superhero team T.H.U.N.D.E.R. Agents, by writer William Messner-Loebs (as Bill Loeb) and penciler Bill Reinhold. A second story, by writer-penciler Bill Willingham, introduced the superhero team the Elementals.\n\nThis led to a miniseries, Justice Machine featuring the Elementals #1-4 (May-Aug. 1986#, by writer Willingham and artist Gustovich, published by Comico. That company subsequently published an ongoing Justice Machine series #vol. 2) that lasted 29 issues (Jan. 1987 - May 1989#, plus a 1989 annual. That series' initial creative team consisted of writer Tony Isabella and artist Gustovich.\n\nInnovation Comics published a three-issue miniseries, The New Justice Machine #Nov. 1989 - March 1990#, by Mark Ellis with pencils by Darryl Banks and others, and inks by Gustovich. An accompanying annual, Justice Machine Summer Spectacular #1 #Summer 1990#, by writer Messner-Loebs and penciler Reinhold, had originally been intended for publication by Texas Comics in 1983.[1] This was followed by the one-shot Hero Alliance &amp; Justice Machine: Identity Crisis #1 #April 1990#, by writer Ellis, pencilers Banks and Rik Levins, and inker Gustovich, as well as a new ongoing series, Justice Machine vol. 3, which ran seven issues #April 1990 - April 1991#. Initially produced by the same creative team as the annual, it acquired series creator Gustovich as both penciler and inker for issues #4-6, and Isabella as writer for issues #5-7.\n\nFinally, Ellis' Millennium Publications produced two issues of a fourth volume #Oct. &amp; Dec. 1992#, by writer Ellis and penciler Banks. These feature updated versions of the characters. Ellis had purchased the Justice Machine rights from Gustovich in 1991.\n\nIn the first two versions of the team, the Justice Machine is an elite law enforcement agency from the planet Georwell, a parallel world with advanced technology that the Machine members believe is a utopia. Arriving on Earth in pursuit of Maxinor, a criminal and accused terrorist from their world, the team members soon discover that Georwell is much more fascist and dystopian than they had previously believed. Meanwhile the Georwellian authorities have activated a second team, the Guardians.\n\nZarren, their corrupt superior, has the Machine indicted as traitors and they have no choice but to remain on Earth. Later, Zarren falls victim to his own schemes and must flee to Earth, where he sets himself up as the president of small South American island, the Arriba Atoll.\n\n&quot;Georwell&quot; is a play on George Orwell, the author of 1984, and the society of Georwell is based on the society of 1984, though much more technically advanced.\n\nIn &quot;The Chimera Conspiracy&quot; scripted by Mark Ellis and Darryl Banks #published by Millennium Publications# it is revealed that Georwell is actually Earth in an alternate future, some 900 years hence. Rather than traveling from one dimension to another, the Justice Machine went sideways and backward in time, drawn to a temporal nexus point where the events which eventually create Georwell are in a state of flux.\n\nThanks to the scanners and to the shiverman for his tireless efforts to find the difficult to find comic scans and share them with the rest of us.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:64965290c30d0cc44694a202f6ac12b299f3c1f2","amp;dn":"Justice+Machine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64965290c30d0cc44694a202f6ac12b299f3c1f2","infoHashBuffer":{"type":"Buffer","data":[100,150,82,144,195,13,12,196,70,148,162,2,246,172,18,178,153,243,193,242]},"announce":[],"urlList":[]}}