{"title":"[MomLickTeens / RealityKings] Alexis Fawx , Chloe Couture (Sexy","uid":12642319,"size":460405284,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:650026a314bdf6e00dc1e437655ab96bab8cd909&amp;dn=%5BMomLickTeens+%2F+RealityKings%5D+Alexis+Fawx+%2C+Chloe+Couture+%28Sexy+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UniX","files":1,"time":1446010705,"description":"[MomLickTeens / RealityKings] Alexis Fawx , Chloe Couture (Sexy Slit) SD **NEW OCT 28,2015**\r\n\r\nSCREENS;\r\n \nhttp://imgurx.net/share-FE8C_563050EF.html\r\n\r\nChloe Couture was sent home from school because she wasn't wearing a bra. Her tiny tits and hard nipples were a site to see. A semi see through white shirt just added some sexiness. Her step mom Alexis Fawx got the call from Chloe's school, so she was home ready to handle the situation she was put in. Chloe was trying to get a certain boy's attention which was the result of her actions. Her actions also messed up Alexis's plans which step mommy wasn't very happy about. Chloe didn't understand why the girls night out mattered. Alexis was going to show her why. Chloe didn't know what to do. Her emotions were running wild. As her step mom was coming onto her, she really got turn on, but was she wasn't sure what to do about it. Alexis kept at it until Chloe gave into her naughty desires. Alexis stole a kiss and Chloe became even more intrigued. She grabbed some serious boobs as Alexis was spread her legs. After the excitement of Chloe's first female contact these two went at it like they were covered in candy. Alexis buried her face in Chloe's young pussy and fingered but her holes. Chloe came real quick because she had never felt anything like it. Alexis sat on Chloe's face to make sure she got the point across. Chloe was loving it though. She licked her step mom's ass clean. They finger banged each other for one last wet climax. Chloe wont act up again in school since she can now get all the loving she wants at home","torrent":{"xt":"urn:btih:650026a314bdf6e00dc1e437655ab96bab8cd909","amp;dn":"%5BMomLickTeens+%2F+RealityKings%5D+Alexis+Fawx+%2C+Chloe+Couture+%28Sexy+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"650026a314bdf6e00dc1e437655ab96bab8cd909","infoHashBuffer":{"type":"Buffer","data":[101,0,38,163,20,189,246,224,13,193,228,55,101,90,185,107,171,140,217,9]},"announce":[],"urlList":[]}}