{"title":"Paul McCartney Live 2005-Space Within Us-rECOn-1080p H264 DTS5.1","uid":10937611,"size":6858316442,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:653ef51a9d8f040e45394900de463c6e74288a83&amp;dn=Paul+McCartney+Live+2005-Space+Within+Us-rECOn-1080p+H264+DTS5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"videoadvocate","files":-1,"time":1409448187,"description":"Paul McCartney Live 2005-Space Within Us-rECOn-1080p H264 DTS5.1 AVCHD\n\nThis release is intended to commemorate the recent tour.  Sourced from the blu-ray disk, we have edited out all of the talking and interviews, so that only the music remains.  Also included are the three &quot;audio check&quot; songs that are included as extras on the disk.  While I know some of you may prefer the entire video, I find that the interviews and talking parts distracts from what otherwise is a fantastic live performance.  Those who prefer the complete version and are tempted to complain, please use a dime and call someone who gives a damn and find another more suitable release.\n\nBeatles fans are sure to get a whole lotta enjoyment from a Paul McCartney concert, recorded during the US tour in 2005. During the show, Paul and the audience talk with and listen to the astronauts abord the MIR space station.  The show includes a combination of Beatles, Wings, and Paul McCartney songs of various styles and tempo, performed in front of lively and loud groups of all ages.  It seems everyone know the words. Drive My Car and Helter Skelter are practically guaranteed to give you goosebumps.  Paul is especially personable and engaging as the band leader and front man.\n\nSome might wish the video was not so focused on the audience and that the audio did not include so much crowd noise.  At times I agree the camera changes too fast and is distracting to some degree but not objectionable.  This along with the crowd noise makes the experience seem very much like actually being in the audience.  After all, it's not in a studio so this is how things really looked and sounded.  \n\nThe original blu-ray disk was disassembled and rECOnstructed as follows.  The original 1080i VC-1 video was re-encoded and deinterlaced using X264 video.   The original PCM5.1 audio was encoded to DTS5.1.  I have also included a downmixed DD2.0 audio track for those with less sophisticated audio gear.  \n\nThe disk is authored as an AVCHD suitable for either BD or DVD / AVCHD media.  Chapters points are included.  The content easily fits on a standard DVDR double sided disk.  Just be sure to burn using UDF2.5 file system.\n\nSo others can be sure of the quality of this torrent, please come back and comment below after you have finished and played the contents.  This way others will get another opinion of this release.  \n\nProduct Details\n\nArtist: Paul McCartney\nVideo: H264, uncropped, progressive, 1920 x 1080, 29.976fps\nAudio: English (DTS 5.1 lossy; Dolby Digital 2.0 lossy)\nCompression: DTS 1536kbps 5.1 channel; Dolby Digital 448kbps 2.0 channel) \nSubtitles: NA\nRegion: NA\nAspect Ratio: 16:9\nRun Time: 1 hour 28 minutes 12 seconds\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Space_Within_US&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Space_Within_US&lt;/a&gt;\n\nSong List:\n\n00 Whole Lotta Shakin' Goin' On (sound check)\n01 Friends To Go (sound check)\n02 How Kind of You (sound check)\n03 Magical Mystery Tour\n04 Flaming Pie\n05 Let Me Roll It\n06 Drive My Car\n07 Till There was you\n08 I'll Get You\n09 Elanor Rigby\n10 Maybe I'm Amazed\n11 Got to Get You\n12 Fine Line\n13 I will\n14 Follow the Sun\n15 Good Day Sunshine\n16 For No One\n17 Fixing A Hole\n18 Penny Lane\n19 Too Many People\n20 English Tea\n21 I've Got A Feeling\n22 Follow Me\n23 Jenny Wren\n24 Helter Skelter\n25 Yesterday\n26 Get Back\n27 Please Please Me\n","torrent":{"xt":"urn:btih:653ef51a9d8f040e45394900de463c6e74288a83","amp;dn":"Paul+McCartney+Live+2005-Space+Within+Us-rECOn-1080p+H264+DTS5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"653ef51a9d8f040e45394900de463c6e74288a83","infoHashBuffer":{"type":"Buffer","data":[101,62,245,26,157,143,4,14,69,57,73,0,222,70,60,110,116,40,138,131]},"announce":[],"urlList":[]}}