{"title":"A LIttle Night Music- 2010 Broadway Revival cast (Catherine Zeta","uid":5627149,"size":451656362,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:66f5a78ac26479ed6ac53a09bdadd11a65d78d7b&amp;dn=A+LIttle+Night+Music-+2010+Broadway+Revival+cast+%28Catherine+Zeta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"hkbrandon","files":25,"time":1276524742,"description":"320kbps.  'A Little Night Music,' a bittersweet tale of romantic longing and furtive liaisons unfolding over a single midsummer's evening in the Swedish countryside, remains among composer and lyricist Stephen Sondheim's most admired and best known works, as well as one of his most commercially successful. The musical, inspired by Ingmar Bergman's classic film 'Smiles of A Summer Night' and featuring a book by Hugh Wheeler, logged in 601 performances during its first Broadway run in 1973.\nBack then, the New York Times theater critic called the lavish Harold Prince-directed production 'heady, civilized,\nsophisticated and enchanting.' The sumptuous score even yielded an enduring adult pop hit in the rueful 'Send in the Clowns,' brought to Top 40 and adult contemporary radio via Judy Collins' elegant, contemplative interpretation on Elektra Records.\nNew York magazine has called this new, more intimate, chamber-style production, developed at London's Menier Chocolate Factory by acclaimed director Trevor Nunn, 'stunning..., devastatingly good.' Nun himself describes his daringly pared-down approach as 'a good deal more Chekhovian in its intentions.' Oscar-winning actress Catherine Zeta-Jones\n(Chicago) makes her long-awaited Broadway debut in the lead role of Desiree, originated in '73 by Glynis \nJohns. The Hollywood Reporter called Jones' performance 'captivating' and her rendition of 'Send In the Clowns' a \n'revelation... she handles the poignant and comic aspects of her character with equal aplomb.' USA Today concurred: 'Zeta-Jones brings great warmth and vitality to the role and makes it easier to see why Desiree's old lover, Fredrik the\nmale lead, played with suave brio by Alexander Hanson would vie with a blustering dragoon for her affections.' The New York Times hailed Jones' show-stopping co-star Angela Lansbury, without a doubt the hardest working octogenarian on Broadway, as 'indomitable and invaluable,' calling her performance as a wise and omniscient former courtesan 'quite delicious.'\nThe Times also praised the intricacy and delicacy of Mr. Sondheim's score, 'which sets a deep-blue wistfulness to\nthree-quarter time.' Nunn's austere, reconceived staging, says the Hollywood Reporter, 'does a wonderful job of accentuating the emotional complexities and endlessly witty dialogue of Hugh Wheeler's book.' London's Daily Telegraph\ngave this Broadway transfer an equally enthusiastic assessment: 'Far from another star vehicle, this thoroughly British affair is good, old-fashioned entertainment at its sparkling best.' Perhaps most importantly, Sondheim himself, who is also represented on Broadway this season with a bilingual staging of 'West Side Story,' reacted positively in a recent New York Times interview: 'You get to concentrate on the piece of work,' he says of the current staging, which features eight\nmusicians and a five-voice chorus. 'I'm just pleased that somebody wants to do it, and that it gets a chance to be seen again... It's a greater pleasure when these pieces get another outing.'\nAs theatergoers - and listeners to this newly recorded cast album - will surely attest: the pleasure is decidedly ours. This new Broadway production is scheduled to run at least through June 2010. \n","torrent":{"xt":"urn:btih:66f5a78ac26479ed6ac53a09bdadd11a65d78d7b","amp;dn":"A+LIttle+Night+Music-+2010+Broadway+Revival+cast+%28Catherine+Zeta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66f5a78ac26479ed6ac53a09bdadd11a65d78d7b","infoHashBuffer":{"type":"Buffer","data":[102,245,167,138,194,100,121,237,106,197,58,9,189,173,209,26,101,215,141,123]},"announce":[],"urlList":[]}}