{"title":"Neil Young and Crazy horse-WELD- vhs rip-","uid":4074001,"size":967887453,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6713260f639d268adbe689690532cdf8d99a6b9b&amp;dn=Neil+Young+and+Crazy+horse-WELD-+vhs+rip-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ozthepissedoffhippy","files":4,"time":1205197350,"description":"__________                  __    ___.    .__   __          \n\\______   \\  ____    ____  |  | __\\_ |__  |__|_/  |_  ______\n |       _/ /  _ \\ _/ ___\\ |  |/ / | __ \\ |  |\\   __\\/  ___/\n |    |   \\(  &lt;_&gt; )\\  \\___ |    &lt;  | \\_\\ \\|  | |  |  \\___ \\ \n |____|_  / \\____/  \\___  &gt;|__|_ \\ |___  /|__| |__| /____  &gt;\n        \\/              \\/      \\/     \\/                \\/ \n\n\n\n\n\n\nNeil Young&amp;#039;s biorhythms have led him to the brutal crucible of Crazy Horse every so often since his second solo album, giving him the opportunity to, um, weld chaos and familiarity into a precarious ritual that perhaps the Who, more than anyone, best understand. This concert video, compiled from snatches of performance shot during a long tour somewhere around 1990, is the visual accompaniment to a double-CD package (also called Weld) of live material released in 1991. If you were at one of the shows, you&amp;#039;ll instantly recognize the streak of surrealism surrounding this production, including enormous Marshall amplifiers on the stage (props, though the show is loud enough to make one believe they&amp;#039;re real) and an odd preface featuring a salt-of-the-earth farmer type dragging an oversized microphone (with stand) while Jimi Hendrix&amp;#039;s version of &quot;The Star-Spangled Banner&quot; blares through the arena.\n\nYoung and Crazy Horse instantly get down to business, however, with one of their searing takes on &quot;Hey Hey My My (Into the Black),&quot; followed by a muscular &quot;Crime in the City&quot; and a cover of Bob Dylan&amp;#039;s &quot;Blowin&amp;#039; in the Wind.&quot; The latter, a haunting, (mostly) solo performance by Young, sounds like the echo of a long-ago clarion call from the optimistic 1960s, and it goes a long way toward refining this show&amp;#039;s unspoken theme: building a temporary bridge to a ghostly past. Young and the band do just that, repeatedly and in different ways as the concert progresses from a strangely fragile but exuberant performance of Young&amp;#039;s early hit, &quot;Cinnamon Girl,&quot; to the mirage-like &quot;Cortez the Killer&quot; and its layered elegy for the Woodstock generation, to the shatteringly beautiful ode to a forgotten young man&amp;#039;s ultimate sacrifice in &quot;Powderfinger.&quot; By the time Young brings us back to the then-reality of the Bush years in &quot;Rockin&amp;#039; in the Free World,&quot; one can&amp;#039;t help but feel robbed by the cruel vicissitudes of history. --Tom Keogh","torrent":{"xt":"urn:btih:6713260f639d268adbe689690532cdf8d99a6b9b","amp;dn":"Neil+Young+and+Crazy+horse-WELD-+vhs+rip-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6713260f639d268adbe689690532cdf8d99a6b9b","infoHashBuffer":{"type":"Buffer","data":[103,19,38,15,99,157,38,138,219,230,137,105,5,50,205,248,217,154,107,155]},"announce":[],"urlList":[]}}