{"title":"Scary Shorts for Halloween (S.S. Charity)(pdf){Zzzzz}","uid":11336465,"size":1160817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67bc91bf0be7bc879c8f1c26c383d6a4285f358a&amp;dn=Scary+Shorts+for+Halloween+%28S.S.+Charity%29%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1414748006,"description":"Scary Shorts for Halloween (S.S. Charity)\n\n\nPublisher: Accent Press, Ltd. (November 30, 2008)\nLanguage: English\nISBN-10: 0954489942\nISBN-13: 978-0954489946\n\nBiography\nLove &amp; Freedom won the Best Romantic Read Award 2011, Dream a Little Dream was nominated for a 'RoNA' (Romantic Novel Award) and for the Best Romantic Read Award 2012. Darcie's Dilemma was nominated for Best Romantic Ebook 2012.\n\nOther novels are Want to Know a Secret?, Starting Over and All That Mullarkey - and watch out for Is This Love? in November 2013.\n\nSue was born in Germany, part of an army family, and lived in Cyprus and Malta, as well as the UK. She's worked in a bank, as a bookkeeper (probably a mistake), for Motor Cycle News and for a typesetter, but is pleased to have wriggled out of all those 'proper jobs'. She loves watching Formula 1 racing, reading, writing, yoga, Zumba and learning the piano.\n\nHer first novel, Uphill All the Way, and the novellas that began life as magazine serials, A Place to Call Home, Between Two Worlds, Where the Heart Is and One Summer in Malta, are now ebooks, available on Amazon.\n\nSue also writes short stories, serials, articles, columns, courses and &quot;how to&quot; books. (Yes - she works jolly hard.) A creative writing tutor for distance learning, residential courses and adult learning, she has woven together strands from all her skills to bring you Love Writing - How To make Money Writing Romantic Or Erotic Fiction, calling on a multitude of published writers and industry professionals to contribute their tips to the book. Endorsed by the London School of Journalism, Katie Fforde, as then chair of the Romantic Novelists' Association, and top author Jill Mansell, this book has received fabulous reviews on Amazon.\n\nHer website is at www.suemoorcroft.com and her blog atYou're welcome to follow @suemoorcroft on Twitter and sue.moorcroft.3 on Facebook","torrent":{"xt":"urn:btih:67bc91bf0be7bc879c8f1c26c383d6a4285f358a","amp;dn":"Scary+Shorts+for+Halloween+%28S.S.+Charity%29%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67bc91bf0be7bc879c8f1c26c383d6a4285f358a","infoHashBuffer":{"type":"Buffer","data":[103,188,145,191,11,231,188,135,156,143,28,38,195,131,214,164,40,95,53,138]},"announce":[],"urlList":[]}}