{"title":"Lionheart (1990) DVDRip - English - Widescreen 720x384","uid":9638416,"size":1481117777,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:67e9467bfa08f299f9da5b1df8270dfb56ac940f&amp;dn=Lionheart+%281990%29+DVDRip+-+English+-+Widescreen+720x384&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ILKnight","files":-1,"time":1392872115,"description":"Lionheart (1990)\n\n\nStoryline:\nLyon Gaultier is a deserter in the Foreign Legion arriving in the USA entirely hard up. He finds his brother between life and death and his sister-in-law without the money needed to heal her husband and to maintain her child. To earn the money needed, Gaultier decides to take part in some very dangerous clandestine fights.\n\n\nUploader message:\nNot necessarily close to be one of the best movies from Jean-Claude Van Damme, but still enjoyable if you like this kind of action-fight movies.\n\nI upload this because I search for this movie for many years, without finding a decent rip. I find many torrents with Russian language, or square 4:3 aspect ratio, or too compress video. I even find a DVD-R but sucks because it has a &quot;jump&quot; between chapters (is like miss FPS) and audio was out of sync.\n\nI figure to get a decent copy in english and widescreen, so here it is for anyone searching for it.\n\nA reason why I search for this movie is because I watch it when I was a kid, and after so many years I still feel to watch it again. Worth for keeping in my private movie collection.\n\n\nIf you was looking for the best copy of this movie on torrent, here it is. At least for now, I really don't find anything with better quality.","torrent":{"xt":"urn:btih:67e9467bfa08f299f9da5b1df8270dfb56ac940f","amp;dn":"Lionheart+%281990%29+DVDRip+-+English+-+Widescreen+720x384","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67e9467bfa08f299f9da5b1df8270dfb56ac940f","infoHashBuffer":{"type":"Buffer","data":[103,233,70,123,250,8,242,153,249,218,91,29,248,39,13,251,86,172,148,15]},"announce":[],"urlList":[]}}