{"title":"Documentary ~ Google Behind the Screen [theArchit3kt]","uid":5527306,"size":172570384,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6851a32f48ceb316583e2faad24571e82ee5c745&amp;dn=Documentary+%7E+Google+Behind+the+Screen+%5BtheArchit3kt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theArchit3kt","files":-1,"time":1272815937,"description":"Documentary: Google ~ Behind the Screen\n\nRunning Time: 47:57\nAir Date: 2006\nFile Format: AVI\nVideo Codec: MPEC-4, 320:240 (4:3), 1008kbps, 23,9 fps\nAudio Codec: mp3, stero, 128 kbps\n\nThis 50 minutes documentary gives an in-depth look in the world of Google and search.\n\nWhat if all the world's information would be available and easy to find? What if all the news, all books, all texts, photographs and videos would be collected in one place, and made available, always and everywhere?\n\nThis is the goal of Google, and the company seems to be realising its core mission at an amazing speed: through its popular search engine, through Google Earth, with which users can find any kind of information based on geography, and through Google Print, a project in which Google digitizes complete libraries.\n\nGoogle is divulging ever more information, in the process hiring the smartest people in the industry. But is the company aware of the responsibility it has, being the guard to all the world's information, including personal information about its users?\n\nThis documentary takes a look into the world of Google, in the company's headquarters in Mountain View, California and in its London offices. We see --among others- Vint Cerf, named 'the father' of the Internet who explains the inner workings of Google as a company. Since 2004, Cerf has been working for Google, helping them to develop new applications for the Internet. What is his view on the development of the Internet, and on the role Google plays in today's world?\n\nWith its motto 'Don't be evil', Google seems to have the best intentions. But there are also claims that Google is slowly turning into Big Brother, keeping track of its users and continuously making decisions about the information it provides to an ever faster growing number of users.\n\nWill Google turn out to be a new Library of Alexandria, serving as a middleman that brings all useful information to anyone? Or is it turning into a monopolistic Big Brother that challenges the freedom of information?\n\nResearch: Martijn Kieft\nDirector: IJsbrand van Veelen\n\n-------------------------------------------------------------\n\nCheck out my &quot;Best of Noam Chomsky&quot; Video:\nhttp://vimeo.com/7344978\nor all my uploads on &quot;SuperBayForum&quot;:\nhttp://forum.suprbay.org/showthread.php?tid=62897\n\n..i wish u aLL the best and hope that you will seed this torrent a little bit..\n\n..theArchit3kt..\n\n\n!! keep torr3nts alive !!","torrent":{"xt":"urn:btih:6851a32f48ceb316583e2faad24571e82ee5c745","amp;dn":"Documentary+%7E+Google+Behind+the+Screen+%5BtheArchit3kt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6851a32f48ceb316583e2faad24571e82ee5c745","infoHashBuffer":{"type":"Buffer","data":[104,81,163,47,72,206,179,22,88,62,47,170,210,69,113,232,46,229,199,69]},"announce":[],"urlList":[]}}