{"title":"POtHS - The Bible - 30 - Biblical Collection - Volume 02 - Icons","uid":8313100,"size":6067993073,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:69e1795ec50888ef7c82ea49884ab3eba2aba9ec&amp;dn=POtHS+-+The+Bible+-+30+-+Biblical+Collection+-+Volume+02+-+Icons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":-1,"time":1364520543,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\nBiblical Times\n\n\n\nPOtHS - Biblical Times - 30 - Biblical Collection - Volume 02 - Icons Jacob and Joseph\n\n\nPOtHS says: This is good for all ages. These films are of a much higher Quality than The History Channels portrayal of The Bible.\n\nDescription:\n\nJacob and Joseph:\n\nThe classic story of two brothers who turn against one another out of selfish greed.  Colleen Dewhurst stars as Rebekah, who gives birth to twin boys, Esau and Jacob.\n\nThough Esau is the first-born and entitled to his family's fortune, Jacob is Rebekah's  favorite.  Through a cunning and devious scheme, Rebekah helps steal Esau's birthright from his aging father, Isaac.  The deception tears the family apart for twenty years, but just as reconciliation brings Jacob and Esau together, a new generation of envy is boen.\n\n\nSpecial Features:\n\n  Full Screen Presentation\n  Audio: English (Mono), French\n  Subtitles: English, French, Spanish, Portuguese, Chinese, Korean, Thai\n  Theatrical Trailers\n  Talent Files\n  Scene Selections\n\n\nJacob:\n\nMatthew Modine and Lara Flynn Boyle turn in heartfelt performances as Jacob and Rachel in this poignant romance. Jacob agrees to work for seven years in order to marry the woman he loves, only to be deceived by her father. Forced to start a family with another woman, Jacob agrees to continue his labor in order to win the love of his life.\n\nJoseph:\n\nEmmy Award Winner for Outstanding Mini-Series\n\nJoseph, the favorite son of Jacob, is the enemy of his jealous brothers. After surviving a close brush with death, Joseph is sold to a powerful Egyptian and faces unbearable tests of cruelty and pain. Joseph's master's wife falsely accuses him of treachery and rape. What looks like sure tragedy ends in the greatest triumph in this powerful epic as the goodness of God transcends the evil intents of men. Starring Paul Mercurio, Ben Kingsley and Martin Landau.\n\n--------------------------------------------------------------\n--------------------------------------------------------------\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:69e1795ec50888ef7c82ea49884ab3eba2aba9ec","amp;dn":"POtHS+-+The+Bible+-+30+-+Biblical+Collection+-+Volume+02+-+Icons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69e1795ec50888ef7c82ea49884ab3eba2aba9ec","infoHashBuffer":{"type":"Buffer","data":[105,225,121,94,197,8,136,239,124,130,234,73,136,74,179,235,162,171,169,236]},"announce":[],"urlList":[]}}