{"title":"Joe Kurtz Omnibus - Dan Simmons","uid":9100815,"size":2584867,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ab318010dea138a860b1a7f14852feeb361c3d2&amp;dn=Joe+Kurtz+Omnibus+-+Dan+Simmons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1382763854,"description":"1. Hardcase (2001): Sometimes revenge is best paid in cold steel.\n\nJoe Kurtz has been wronged one too many times. So when he takes out the drug-dealing thug who killed his girlfriend, the ex-PI gets to cool his heels for 11 years in Attica. It's there that he meets &quot;Little Skag&quot; Farino, the son of an aging Buffalo, New York, mob boss. In exchange for protecting the kid's manhood against any unwanted jailhouse affection, Kurtz gets an audience with Little Skag's father upon his release from prison.\n\nSemi-retired Don Byron Farino is still clinging to what dwindling power he holds on the New York organized crime scene. He enlists Kurtz's help to track down the Family's missing accountant - a man with too much knowledge of Family business to have on the loose. But someone doesn't want the accountant found. As the story twists and turns and the body count rises, Kurtz no longer knows whom he can trust. Everyone seems to be after something, from the mob boss's sultry yet dangerous daughter, to a hit man named The Dane, an albino killer who is good with a knife, and a dwarf who is armed to the teeth and hellbent on revenge.\n\nBestselling author Dan Simmons expertly builds the tension as he springs one surprise after another, all the while daring the reader to take a ride with Kurtz through the cold, windy streets of Buffalo where one wrong move could mean a bellyfull of lead.\n\n2. Hard Freeze (2002): There's a bitter wind brewing in Buffalo, New York and it's blowing in more than just snow. &quot;Little Skag&quot; Farino, the last don of the local crime family, wants Kurtz dead and is sending in platoons of hit men, starting with the Attica Three Stooges and working up through more competent killers. Little Skag's beautiful sister, Angelina Farino Ferrara, is back from seven years in Sicily and has her own deadly agenda for Kurtz.\n\nIf that isn't enough, Kurtz is approached by a dying concert violinist who wants his daughter's killer found. Rejecting the case at first, he is soon on the trail of a man who's not just the murderer of one child, but a cold-blooded serial killer who is a master of alternate identities and has the power to send a hundred men after Kurtz. As the bodies pile up like cords of wood, HARD FREEZE hits town with the power of a whiteout blizzard and builds to a truly chilling climax. This is a crime novel where trigger fingers freeze to blue steel.\n\n3. Hard as Nails (2003): Somewhere in western New York there's a remote mountaintop in the moonlight, its dark forests and moon-dappled meadows populated only by corpses, and if ex-PI Joe Kurtz doesn't unravel the secret of that place in five days, he'll be one of them.\n\nEveryone seems to want a piece of Kurtz and most succeed in getting one. Unknown assailants gun down Kurtz and his female parole officer, giving Kurtz the headache of a lifetime but putting pretty Peg O'Toole on life support. While working his own case through a haze of concussion migraine, Kurtz has to deal with Toma Gonzaga, the gay don who owes Kurtz a blood debt, and Angelina Farino Ferrara, the female don who is after Kurtz's body - or maybe just his head.\n\nAnd while someone is murdering all the heroin addicts in Buffalo and hauling away the bodies, a serial killer called the Artful Dodger hatches his twisted plan.\n\nIn Kurtz's corner is police detective Rigby King, a beautiful woman who was his lover when they were both rebellious teenagers in Father Baker's Orphanage. Rigby also has designs on Joe Kurtz, but whether they're aimed at bedding or abetting him, helping him stay alive, or simply putting him away for life, Kurtz will have to discover the hard way.\n\nAll three Joe Kurtz novels in one (omnibus) volume!","torrent":{"xt":"urn:btih:6ab318010dea138a860b1a7f14852feeb361c3d2","amp;dn":"Joe+Kurtz+Omnibus+-+Dan+Simmons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ab318010dea138a860b1a7f14852feeb361c3d2","infoHashBuffer":{"type":"Buffer","data":[106,179,24,1,13,234,19,138,134,11,26,127,20,133,47,238,179,97,195,210]},"announce":[],"urlList":[]}}