{"title":"Van Halen - Right Now","uid":8664078,"size":52421192,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6ad0b458dccea84e0e5305887e1235b0e5eb3745&amp;dn=Van+Halen+-+Right+Now&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fiveofseven","files":1,"time":1373376090,"description":"The music video (directed by Mark Fenske) reflected on events that were occurring at the time, both within the band and social issues in the world around them. It used big block letters to display sentences such as &quot;right now, people are having unprotected sex&quot; and &quot;right now, someone is working too hard for minimum wage&quot;, to describe the footage in the background. This concept was used previously in videos like Phil Collins' &quot;Another Day in Paradise&quot;.\n\nHagar was opposed to the video's concept when it was first explained to him. He stated: &quot;People ain't even going to be listening to what I'm saying because they'll be reading these subtitles&quot;. Despite Warner chairman Mo Ostin phoning him stating that it would be the biggest music video in the group's career, he was still so angry that he disappeared to South Carolina for a week with his then-girlfriend.\n\nDuring the actual filming, he contracted pneumonia and was suffering from a fever, which intensified his anger over the video. Fenske says he did not notice, but allows that he was nervous and busy since it was the first video he had directed and he had many other things to pay attention to. According to Hagar, the scene where he folds his arms and refuses to sing, and the end of the video where he slams the dressing room door were not staged - he was genuinely angry.\n\n&quot;For the idea of the girl setting fire to a guy's photo&quot;, Fenske recalls, &quot;I had a photo of me at 24 that I didn't mind burning.&quot; He says everyone in the video was either a crew member or band member, save one - his mother. He brought her to the Video Music Awards as his date.\n\nThe video won three awards at the 1992 MTV Video Music Awards, including the award for Video of the Year. Bassist Michael Anthony said in a 2011 book that he thought it was the best video Van Halen had ever done. Hagar was still disappointed with the result despite the accolades it received. &quot;I don't think it's enough about the band.&quot; However Hagar would later reuse the video concept and the &quot;right now&quot; lyric for the title track of his 2008 solo album Cosmic Universal Fashion.\n\nIt was later used in Crystal Pepsi commercials between 1992 and 1993, but not without enraging many longtime Van Halen fans. Eddie said that he accepted to license the song to PepsiCo because he knew that if he did not, the company would hire studio musicians to record a cover.\n\n\n\nFile Name:\n08 Right Now - Van Halen\n\nFile Format:\nmp4\n\nDuration:\n00:04:19\n\nBit Rate:\n1617k\n\nFile Size:\n49.99 MB\n\nVideo Codec:\nh264\n\nVideo Bitrate:\n1487k\n\nVideo Size:\n720x528\n\nAspect Ratio:\n1.36:1\n\nFrame Rate:\n23.98fps\n\nAudio Codec:\nmp3\n\nAudio Bitrate:\n128k\n\nChannels:\n2\n\nSample Rate:\n48000","torrent":{"xt":"urn:btih:6ad0b458dccea84e0e5305887e1235b0e5eb3745","amp;dn":"Van+Halen+-+Right+Now","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ad0b458dccea84e0e5305887e1235b0e5eb3745","infoHashBuffer":{"type":"Buffer","data":[106,208,180,88,220,206,168,78,14,83,5,136,126,18,53,176,229,235,55,69]},"announce":[],"urlList":[]}}