{"title":"DriverMax v5.0.Incl.Serial-H (Murlok","uid":4945680,"size":3201061,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6b179b10c3e732e288d31dd99cdea84bdee0aeb1&amp;dn=DriverMax+v5.0.Incl.Serial-H+%28Murlok&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Murlok","files":-1,"time":1244649332,"description":"DriverMax is a new program which allows you to easily reinstall all your Windows drivers. No more searching for rare drivers on discs or on the web or inserting one installation CD after the other. Simply export all your current drivers (or just the ones that work ok) to a folder or a compressed file. After reinstalling Windows you will have everything in one place!\nMost of the situations when Windows is running slower are caused by faulty driver installations. Windows stores all versions of older drivers just in case you want to go back; sometimes it messes up older versions with more recent ones. The Export Wizard will only export the drivers you select by copying the needed files to a folder or a compressed ZIP file.\nAfter reinstalling Windows all drivers will be back in place in less than 5 minutes - sparing you of searching, inserting disc after disk and losing precious time. The Import Drivers wizard allows you to install all the drivers that you exported earlier. The entire operation might take up to 5-10 minutes.\n\nDrivers are used for interfacing with:\n- Printers\n- Video adapters\n- Network cards\n- Sound cards\n- Local buses of various sorts - in particular, for bus mastering on modern systems\n- Low-bandwidth I/O buses of various sorts (for pointing devices such as mice, keyboards, USB, etc.)\n- Computer storage devices such as hard disk, CD-ROM and floppy disk buses (ATA, SATA, SCSI)\n- Implementing support for different file systems\n- Implementing support for image scanners and digital cameras","torrent":{"xt":"urn:btih:6b179b10c3e732e288d31dd99cdea84bdee0aeb1","amp;dn":"DriverMax+v5.0.Incl.Serial-H+%28Murlok","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b179b10c3e732e288d31dd99cdea84bdee0aeb1","infoHashBuffer":{"type":"Buffer","data":[107,23,155,16,195,231,50,226,136,211,29,217,156,222,168,75,222,224,174,177]},"announce":[],"urlList":[]}}