{"title":"James Burke-Lost Get Back Boogie","uid":9766667,"size":258354759,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6ba80aab4cfcc89593139502195e728d4babcec4&amp;dn=James+Burke-Lost+Get+Back+Boogie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":17,"time":1394890280,"description":"This wonderful novel about a Korean War veteran released in the '60s from a Louisiana prison farm where he served a term for manslaughter is neither roman tic nor cynical in its realism. Loner Iry Paret, a country-and-western musician, has survived two years of hacks, trustees and dangerous inmates, not with hope but with a dull, gloomy attentiveness that has written hardship's effects all over him. Once he is paroled, he drinks liquor as if it were a tonic, but even drinking brings no joy. He travels to a fellow prisoner's ranch, and as he heads west, the air clears. His involvement with his acid-dropping pal Buddy Rior dan, Buddy's stoical ex-cowboy father (who feuds with a foul-odored pulpmill) and Buddy's estranged wife, Beth, tugs him between adjustment to straight life and the battles that may send him back to jail. Although the ending strays, this latest novel by the author of The Convict is pensive and cautiously paced. It also contrasts two very different parts of the essence of Americathe hazy bayou and a resolute valley in the beautiful West. ","torrent":{"xt":"urn:btih:6ba80aab4cfcc89593139502195e728d4babcec4","amp;dn":"James+Burke-Lost+Get+Back+Boogie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba80aab4cfcc89593139502195e728d4babcec4","infoHashBuffer":{"type":"Buffer","data":[107,168,10,171,76,252,200,149,147,19,149,2,25,94,114,141,75,171,206,196]},"announce":[],"urlList":[]}}