{"title":"The Profiler:My Life Hunting Serial Killers and Psychopaths(mobi","uid":6728460,"size":442916,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c45729ed39b1250cb2b2b0b5f72ddb414e82361&amp;dn=The+Profiler%3AMy+Life+Hunting+Serial+Killers+and+Psychopaths%28mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".StoneX.","files":-1,"time":1318027005,"description":"In 1990, a young woman was strangled on a jogging path near the home of Pat Brown and her family. Brown suspected the young man who was renting a room in her house, and quickly uncovered strong evidence that pointed to him--but the police dismissed her as merely a housewife with an overactive imagination. It would be six years before her former boarder would be brought in for questioning, but the night Brown took action to solve the murder was the beginning of her life's work.\n\nPat Brown is now one of the nation's few female criminal profilers--a sleuth who assists police departments and victims' families by analyzing both physical and behavioral evidence to make the most scientific determination possible about who committed a crime. Brown has analyzed many dozens of seemingly hopeless cases and brought new investigative avenues to light.\n\nIn The Profiler, Brown opens her case files to take readers behind the scenes of bizarre sex crimes, domestic murders, and mysterious deaths, going face-to-face with killers, rapists, and brutalized victims. It's a rare, up-close, first-person look at the real world of police and profilers as they investigate crimes--the good and bad, the cover-ups and the successes.\n\nPraise for The Profiler&quot;Pat Brown takes us into the very minds of cold-blooded killers. Most people can't comprehend the `why' behind murder. Pat, utilizing her background as one of the country's leading criminal profilers, coaches the reader as to how a killer thinks, reacts, and kills! Incredible!&quot;\n--Nancy Grace, host of Nancy Grace on HLN and bestselling author of The Eleventh Victim\n\n&quot;I've been in law enforcement for almost 18 years now, and after reading The Profiler, I realize how little I understood the mind of the criminal. Pat Brown exposes the methods and the means, the hows and the whys, and exactly what it is that makes a criminal tick--fascinating!&quot;\n--Stacy Dittrich, author of Murder Behind the Badge: True Stories of Cops Who Kill and veteran police officer and law enforcement media consultant\n\n&quot;Anyone who has ever had a passion burning inside them to make a difference should read this book. Pat takes her life experience and brings it to the forefront to make a difference in the lives of crime victims and their families. Her insight into these cases takes profiling of criminals to a whole new level. From her work and wisdom comes the hope we all need to end the viciousness of killers who prey on the innocent.&quot;\n--Derek VanLuchene, president and founder of Ryan United\n\n&quot;In her new book, Pat Brown takes the reader along with her as she works to solve grisly crimes that have baffled others. In her relentless pursuit to illuminate what seem to be hopeless cases, she shows just how deep an investigator must dig and all the details that must be absorbed and interpreted.&quot;\n--Stanton E. Samenow, Ph.D., author of Inside the Criminal Mind\n\n&quot;In The Profiler, Pat Brown finally explains the sometimes spooky world of criminal profiling in a way that even an old-school, ex-flatfoot cop like me can understand. This book is a great insight into the mind of a serial killer hunter.&quot;\n--Chuck Hustmyre, retired ATF agent and author of the true crime books Killer with a Badge and An Act of Kindness\nSee all Editorial Reviews\nProduct Details\n\n    * Format: Kindle Edition\n    * File Size: 489 KB\n    * Print Length: 304 pages\n    * Page Numbers Source ISBN: 1401341268\n    * Publisher: Hyperion e-books; 1 edition (May 18, 2010)","torrent":{"xt":"urn:btih:6c45729ed39b1250cb2b2b0b5f72ddb414e82361","amp;dn":"The+Profiler%3AMy+Life+Hunting+Serial+Killers+and+Psychopaths%28mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c45729ed39b1250cb2b2b0b5f72ddb414e82361","infoHashBuffer":{"type":"Buffer","data":[108,69,114,158,211,155,18,80,203,43,43,11,95,114,221,180,20,232,35,97]},"announce":[],"urlList":[]}}