{"title":"A Geocentricity Primer - Dr. Gerardus D. Bouw","uid":11773458,"size":1734648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c86b35d262d46baaf3d2f0e99703ec4e72329c4&amp;dn=+A+Geocentricity+Primer+-+Dr.+Gerardus+D.+Bouw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427168690,"description":"\nThe topic of geocentricity?the belief that the earth is fixed in space near or at the center of the universe?is a poorly-understood, muchmaligned theory among Christian Fundamentalists, Evangelicals, Jewish people, and Roman Catholics.\n\nThis book refutes the widely accepted heliocentric universe model with arguments refuting heliocentrism and presenting the evidence from Biblical references and new scientific findings for geocentricity, a refinement of geocentrism that allows for the interaction of various parts of the universe.\n\nThe book discusses such topics as the long day of Joshua and Hezekiah?s sign. A fairly technical book, however, it continually looks to validate the truth of the Biblical narratives. This book invites the reader to look to the stars to better understand history, especially biblical history.\n\n\nAbout the author:\nDr. Bouw has had a long-standing interest in astronomy, so much so that he earned a Bachelor of Science in astrophysics from the University of Rochester, Rochester, New York, and an M.S. and Ph.D. in astronomy from Case Institute of Technology (now Case Western Reserve University) in Cleveland, Ohio. His intense interest in cosmology led him to a spiritual birth in 1975. Today he is one of the world's foremost experts in biblical astronomy and geocentricity, having written articles on the Star of Bethlehem, the missing mass of the universe, cosmic isotropy, geocentricity, astrophysical evidence for a young universe, the Pleiades, and the fabric of space and time. Dr. Bouw is also the first astronomer to document evidence that the huge clusters of galaxies rotate. He is the director of the Biblical Astronomer, as well as the editor of its quarterly which is the first and still the only creationist magazine devoted to astronomy.\n\nIn addition to his interest in astronomy, Dr. Bouw is an ardent defender of the inerrancy and preservation of the Holy Bible. To that end he was written a book entitled The Book of Bible Problems which is the first treatise treating the major so-called contradictions in the Bible without recourse to copyist errors. The book is available from the Biblical Astronomer office.\n\nDr. Bouw teaches computer science as a full Professor of Mathematics and Computer Science at Baldwin-Wallace College in Berea, Ohio. (The College does not necessarily share Dr. Bouw?s views of the Bible and science.) In addition to his astronomical and astrophysical degrees, he has also earned an M.C.I.S. degree from Cleveland State University. Dr. Bouw married Elisabeth O?Keefe in 1979 and they have two children","torrent":{"xt":"urn:btih:6c86b35d262d46baaf3d2f0e99703ec4e72329c4","amp;dn":"+A+Geocentricity+Primer+-+Dr.+Gerardus+D.+Bouw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c86b35d262d46baaf3d2f0e99703ec4e72329c4","infoHashBuffer":{"type":"Buffer","data":[108,134,179,93,38,45,70,186,175,61,47,14,153,112,62,196,231,35,41,196]},"announce":[],"urlList":[]}}