{"title":"20th Century Masters: The Best of Rob Zombie","uid":6797585,"size":435743408,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6d821e2a4a29738304e3890d328174bf3a2ca4bc&amp;dn=20th+Century+Masters%3A+The+Best+of+Rob+Zombie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1320516496,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51TlpTdq-vL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51TlpTdq-vL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: 20th Century Masters: Millennium Collection - The Best of Rob Zombie\nArtist: Rob Zombie\nAudio CD (March 13, 2007)\nOriginal Release Date: 2006\nNumber of Discs: 1\nGenre: Metal\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Thunder Kiss '65\n02. Black Sunshine\n03. More Human Than Human\n04. Super Charger Heaven\n05. Dragula\n06. Superbeast\n07. Living Dead Girl\n08. Never Gonna Stop (The Red Red Kroovy)\n09. House of 1000 Corpses\n10. Feel So Numb\n11. The Devil's Rejects\n12. The Lords of Salem\n\n\nAllmusic Review:\nThis edition in Universal's 20th Century Masters, Millennium Collection series (aka The Best of Rob Zombie) is somewhat confusing because this little set, packing as it does a powerful little wallop of evil fun, has been released in two versions. The trick is, both of them are exactly the same musically. However, if you bought it at Best Buy, you get a real plastic jewel case and a bonus DVD with three unreleased videos. It includes two for &quot;American Witch,&quot; one directed by Zombie, the other directed and animated by David Hartman, and you get the Zombie-directed video for &quot;Foxie, Foxie.&quot;\n \nThis 20th Century Masters version of Best Of, from Universal, comes in an environmentally friendly, dodgy digipack with no DVD. The music cops the best tunes off Zombie's records and lays it out here in all its devilish metallic fury. There are ten cuts clocking in at a little under 53 minutes, and include four White Zombie tracks -- &quot;Thunder Kiss '65,&quot; &quot;Black Sunshine,&quot; &quot;More Human Than Human,&quot; and &quot;Super-Charger Heaven,&quot; where Zombie established himself as a Tesco Vee-cum-Alice Cooper for the metal set. Interestingly, these are the weaker tracks -- though they all rock -- when compared to the stellar solo material. &quot;Dragula,&quot; &quot;Superbeast,&quot; &quot;Never Gonna Stop,&quot; and the nine-and-a-half minute &quot;House of 1,000 Corpses,&quot; the theme song to the film Zombie directed by the same name. The industrial rhythms, the churning guitars, Zombie's sickly growl, and the sheer density of the mixes are what makes these tunes perfect for any rotten occasion. The swampy &quot;The Devil's Rejects&quot; -- another title theme to the 2005 sequel of sorts to House of 1,000 Corpses -- starts with a killer Delta blues slide lick and then moves the blues toward metal in one fell swoop. If you don't have the album already, this is a great place to start.","torrent":{"xt":"urn:btih:6d821e2a4a29738304e3890d328174bf3a2ca4bc","amp;dn":"20th+Century+Masters%3A+The+Best+of+Rob+Zombie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d821e2a4a29738304e3890d328174bf3a2ca4bc","infoHashBuffer":{"type":"Buffer","data":[109,130,30,42,74,41,115,131,4,227,137,13,50,129,116,191,58,44,164,188]},"announce":[],"urlList":[]}}