{"title":"Vertical Option Spreads: A Study of the 1.8 Standard Deviation I","uid":9273873,"size":3198474,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6db4f05745914021cba957a457047b2473fe1505&amp;dn=Vertical+Option+Spreads%3A+A+Study+of+the+1.8+Standard+Deviation+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1385825128,"description":"Description\nMake trades on vertical options spreads with the precision of a laser beam\nVertical Options Spreads is a combination of a bona-fide academic research-based study and a complete method to trade credit and debit spreads, along with other complex option combination trades such as iron condors and butterflies. Here, the author has accumulated five years of daily data on the ETF, SPY and provided historical evidence of actual win rates at specific multiples of entry points, both in time and price level. For example, traders will be able to use the weekly options, pick a level of risk and return desired, learn how to place the trade, and then discover the actual percent return that the trade would have yielded.\n\nThis must-have resource includes the basics of option trading and contains references to many excellent works by other authors that explore more about the intricacies of option mechanics and trading. It is far more than an analysis of one specific asset, SPY, featuring a study of probability theory and how it has applied to trading over the past five years, including the highly volatile 2007 to 2009 time frame and the more &quot;normal&quot; 2010 to 2012 time period. The book offer a thorough understanding of how price movement, actual volatility, and implied volatility all provide a complex but workable web in which the informed trader can generate excellent returns. However, the trader must have the discipline to act within the confines of probability and the &quot;law&quot; of large numbers refusing to place trades based on gut feelings or hunches.\n\nOffers high-probability based trading that uses the new weekly options\nContains handy interactive worksheets that allow traders to select their own risk/return with precision\nIncludes a website with daily and weekly information on the estimate of the actual standard deviation points on the price spectrum\nVertical Options Spreads offers traders a research-based guide for trading Standard &amp; Poors 500 ETF, SPY using historic and estimated probabilities and returns that will give them an edge in the marketplace.\n\n\nTable of Contents\nPreface ix\nChapter 1 Introduction 1\n\nChapter 2 How to Be a Wizard 11\n\nChapter 3 Trading Platforms 29\n\nChapter 4 Vertical Spreads and the Iron Condor 37\n\nChapter 5 Structuring a Trade 49\n\nChapter 6 A Brief Visit with the Greeks 65\n\nChapter 7 Risk and Psychology of Investing and Spread Trading 69\n\nChapter 8 Normal Distribution, Probability, and Modern Financial Theory 93\n\nChapter 9 The 1.8 Standard Deviation Solution 111\n\nChapter 10 More Using Your Crystal Ball and Probability 169\n\nChapter 11 Conclusion 231\n\nReferences 237\n\nAbout the Website 239\n\nIndex 241\n\n\nAuthor Information\nDr. CHARLES CONRICK IV has an extensive background in the business, finance, and trading environment. After a long career in investment planning and small to mid-size business valuation, he entered the academic world in 2002 and is now an Associate Professor of Finance at Dickinson State University in Dickinson, North Dakota. Charles has also been an active options trader for the past five years. He holds a Doctorate in Business Administration (DBA) from Argosy University with a double major in accounting and finance. He is a Chartered Financial Analyst (CFA), a Certified Public Accountant (CPA), and a Certified Financial Planner (CFP).\n\nSCOTT HANSON is an accounting professor at a regional university and is an active trader in the options market. Prior to arriving in academia, he held several key financial positions in U.S. corporations and spent some time as an auditor with PricewaterhouseCoopers. Hanson is a CPA, and earned an MBA from Golden Gate University and a master's of accounting from the University of Georgia.","torrent":{"xt":"urn:btih:6db4f05745914021cba957a457047b2473fe1505","amp;dn":"Vertical+Option+Spreads%3A+A+Study+of+the+1.8+Standard+Deviation+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6db4f05745914021cba957a457047b2473fe1505","infoHashBuffer":{"type":"Buffer","data":[109,180,240,87,69,145,64,33,203,169,87,164,87,4,123,36,115,254,21,5]},"announce":[],"urlList":[]}}