{"title":"SQLite Expert Professional v1.7.57","uid":4527117,"size":9487286,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6de792f2e3e06fa037df1f708fbba22c6963f878&amp;dn=SQLite+Expert+Professional+v1.7.57&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jodyanne","files":-1,"time":1227395941,"description":"SQLite Expert is a powerful visual tool that enables you to easily administer your SQLite3 databases and gain significantly better visibility into how your databases are operating. SQLite Expert integrates database management and maintenance into a single, seamless environment, with a clear and intuitive graphical user interface.\n\n\nFeatures and Benefits\n\nBy using SQLite Expert you will be able to:\n\n    * Edit tables and views visually, without writing a line of SQL. Easily restructure fields, indexes, constraints, triggers without losing data already existing in the tables.\n    * Build SQL scripts and generate views visually using the integrated Query Builder.\n    * Create SQLite3 databases, view and change database parameters, check database integrity and vacuum (compact) databases.\n    * Easily transfer data between SQLite databases, import data from SQL scripts or ADO data sources, or export to SQL scripts.\n    * Display and edit data in the grid, including BLOB and image fields. Currently supports BMP, JPG and PNG image formats. BLOB fields can be edited with the integrated hex editor.\n    * Execute SQL queries and display results in the grid or as text.\n\n","torrent":{"xt":"urn:btih:6de792f2e3e06fa037df1f708fbba22c6963f878","amp;dn":"SQLite+Expert+Professional+v1.7.57","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6de792f2e3e06fa037df1f708fbba22c6963f878","infoHashBuffer":{"type":"Buffer","data":[109,231,146,242,227,224,111,160,55,223,31,112,143,187,162,44,105,99,248,120]},"announce":[],"urlList":[]}}