{"title":"Magnetic Sounds - Sleep Sound Audios [MP3]","uid":12051726,"size":174849625,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:71273b5f2608cad7610ba04a11a868c63ebe8ac4&amp;dn=Magnetic+Sounds+-+Sleep+Sound+Audios+%5BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elessedilgirl","files":6,"time":1435012283,"description":"Remember that you haven't always had insomnia. You could sleep easily when you were a child and perhaps you haven't had trouble sleeping until recently. Sleep is natural and it shouldn't be so hard.\n\nIt's our busy minds that keep us awake. We turn out the light and then we begin to think. We worry about today and plan for tomorrow. We think about our relationships, our jobs, our money, or lack of it, our health, our homes, our plans for the future and all the rest.\n\nIf we could only relax and stop thinking sleep would come. Sometimes being unable to sleep can be because we are in pain but even then relaxation would ease the pain somewhat and help us to sleep. Life is full of problems and anxieties but these are not reduced by worrying. So the first thing to do is to learn how to relax in bed.\n\nThere is something else that keeps some of us awake and that is our lifestyle and habits, what the experts call sleep hygiene. This can be fixed too, if you want to enough.\n\nThe Sleep Sound Insomnia audios, Go To Sleep and Sleep Waves are specially constructed to slow and relax your brain waves. During the daytime your brain is zipping along in beta rhythm. To sleep it needs to slow down and stop thinking about things. That is what the sleep induction audios do. You can use either Go to Sleep or Sleep Waves. If you have used one of them for a while try the other. You brain needs a change sometimes.\n\nThe Sleep Sound Audio is the only one that has spoken words on it. The words guide you into a relaxed state using hypnotic imagery while the background music has the same embedded BWE sounds as the other sleep induction audios. This track packs a double punch which is very helpful if you are still finding it hard to relax and sleep.\n\nThe relaxation audio Alpha Relax is intended to help you to overcome stress and anxiety. Meditation has been found to help people to become more relaxed and to reduce physical signs of stress such as high blood pressure and heart problems. Alpha Relax practiced daily will help to achieve this state of calm.\n\nAll the audios require you to listen in stereo. The sleep induction audios do not require headphones but of course you can use them if you like. Alpha Relax uses binaural beats and so you will need to wear headphones or ear buds to listen to it.\n\nAlpha Relax Meditation 24.49\nGo To Sleep 45.00\nSleep Sound 59.23\nSleep Waves 50.00\n\nMP3 - 128 kbps - CBR\n\nSource: WebRip","torrent":{"xt":"urn:btih:71273b5f2608cad7610ba04a11a868c63ebe8ac4","amp;dn":"Magnetic+Sounds+-+Sleep+Sound+Audios+%5BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71273b5f2608cad7610ba04a11a868c63ebe8ac4","infoHashBuffer":{"type":"Buffer","data":[113,39,59,95,38,8,202,215,97,11,160,74,17,168,104,198,62,190,138,196]},"announce":[],"urlList":[]}}