{"title":"Television Production, 14th Edition{BBS}","uid":6701067,"size":76069284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71283b6dff224360ddbd3583d0555d58c950ecfb&amp;dn=Television+Production%2C+14th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316972114,"description":"Television Production offers you a very practical guide to professional TV and video production techniques. You will find straightforward description and explanations of the equipment you will use, and discover the best ways to use it. You will also learn how to anticipate and quickly overcome typical everyday problems.\n\nYou will explore in detail all the major features of television production, learning the secrets of top-grade camerawork, persuasive lighting techniques, effective sound treatment, as well as the subtle processes of scenic design and the art of video editing.\n\nSuccessful program-making is about communication and persuasion. It is not merely a matter of knowing which buttons to press, but how to influence and persuade your audience, hold their attention, develop their interest, and arouse their emotions. This book tells you how to do all this - and much more.\n\nThe fourteenth edition has been completely revamped:\n* New: Coauthor Jim Owens brings his wealth of teaching and international broadcasting experience\n* New: In brilliant full color for the first time, hundreds of new photos and illustrations demonstrate the techniques presented in the book\n* New: Thoroughly overhauled with the latest developments in tools and technology\n* New: Focus on the latest equipment, delivery methods, and convergence of digital technology\n\n* Everything you need to know about the tools and techniques of television production * Doesn't just tell you how to use equipment, but also why and when: a big-picture approach to help you succeed on any type of shoot, regardless of the equipment * In brilliant full color for the first time, hundreds of new photos and illustrations demonstrate the techniques presented in the book\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 424 pages\n    * Publisher: Focal Press; 14 edition (July 31, 2009)\n    * Language: English\n    * ISBN-10: 0240520785\n    * ISBN-13: 978-0240520780","torrent":{"xt":"urn:btih:71283b6dff224360ddbd3583d0555d58c950ecfb","amp;dn":"Television+Production%2C+14th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71283b6dff224360ddbd3583d0555d58c950ecfb","infoHashBuffer":{"type":"Buffer","data":[113,40,59,109,255,34,67,96,221,189,53,131,208,85,93,88,201,80,236,251]},"announce":[],"urlList":[]}}