{"title":"Librivox M4B - Histories by Herodotus (300 is based on this)","uid":5521167,"size":361841643,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:714757c79aa7e38c37b5d185b1ab3ac14b5bee9a&amp;dn=Librivox+M4B+-+Histories+by+Herodotus+%28300+is+based+on+this%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VoxRatio","files":-1,"time":1272626436,"description":"The Histories of Herodotus of Halicarnassus is considered the first work of history in Western literature. Written about 440 BC, the Histories tell the story of the war between the Persian Empire and the Greek city-states in the 5th century BC. Herodotus traveled extensively around the ancient world, conducting interviews and collecting stories for his book. The rise of the Persian Empire is chronicled, and the causes for the conflict with Greece. Herodotus treats the conflict as an ideological one, frequently contrasting the absolute power of the Persian king with the democratic government of the Greeks. (Summary adapted from Wikipedia.)\n\n\n\nAn M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n","torrent":{"xt":"urn:btih:714757c79aa7e38c37b5d185b1ab3ac14b5bee9a","amp;dn":"Librivox+M4B+-+Histories+by+Herodotus+%28300+is+based+on+this%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"714757c79aa7e38c37b5d185b1ab3ac14b5bee9a","infoHashBuffer":{"type":"Buffer","data":[113,71,87,199,154,167,227,140,55,181,209,133,177,171,58,193,75,91,238,154]},"announce":[],"urlList":[]}}