{"title":"The Universe 6-(WTC-SWE)","uid":7029778,"size":2567520257,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7171313db357ea3d36213f8effa2efd0a6116a87&amp;dn=The+Universe+6-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1329191479,"description":"THE UNIVERSE 6 \nSEASON V (2011)\nHistory Channel:\n================\n\n\n\n[HDTV:]\n=======   \n\n\n                                 ==================\n                                 = THE UNIVERSE 6 =\n                                 ==================\n\n\n\n\n\n1) Catastrophes That Changed The Planets:\n\nThe planets of our solar system have experienced epic catastrophes throughout their long history, both raining down from outside and bubbling up from within. We'll voyage back in time to investigate the violent events that profoundly shaped the planets, including earth itself. We'll witness stunning revelations about what transformed Mars into a barren, hostile desert...The disaster that changed Venus from temperate to hellish...The impact that blew away Mercury's mantle, turning it into a planetary core...A colossal disturbance that rearranged the orbits of the gas giants...Titanic impacts on Jupiter...And how a lost moon may finally explain Saturn's rings. \n\n\n\n2) Nemesis The Suns Evil Twin:\n\nCould there be a monstrous, undiscovered star orbiting our own Sun? Could it be scattering killer comets throughout our Solar System like clockwork every 26 million years? New scientific surveys are probing the edges of our Solar System--a realm populated by giant worlds and mysterious planetoid--hunting for Nemesis, the Sun's purported evil twin. We may be on the verge of discovering this ultimate death star, suspected of causing every mass extinction in Earth's history. We employ everyday experiences to explain what Nemesis is and why it's been so hard to find. Experts start a wildfire on a dry California hillside, race a NASCAR around an oval track, and juggle fire, all in the effort to present how Nemesis works, and why life on Earth may depend on its discovery. \n\n\n\n3) How The Solar System Was Made:\n\nAt 4.6 billion years old, the Solar System is our solid, secure home in the Universe. But how did it come to be? In this episode we trace the system's birth from a thin cloud of dust and gas. Shocked by a nearby supernova, the pull of gravity and natural rotation spun it into a flat disc from which the Sun and planets coalesced. It all happened in the space of 700 million years, during which the planets jockeyed for position, dodging the brutal bombardment of deadly asteroids and setting into the neat, stable system that we now realize might be a rarity in the universe. \n\n\n\n4) Crash Landing On Mars:\n\nWhat might happen if the first manned mission to Mars crashes hundreds of miles from the rocket that would take them back home? Could they survive the crash, and travel across the brutal Martian surface to their home ship? We'll show what the astronauts would have to do to survive dust storms and space radiation, while extracting vital resources like water from the Martian soil itself. It's a dramatic vision of the very near future, where survival can depend on pre-industrial technology and human ingenuity. \n\n\n\n5) Worst Days On Planet Earth:\n\nEarth may seem like the most hospitable planet in the solar system. But look again. Startling new discoveries reveal the blue planet has been plagued by more chaos and destruction than scientists once imagined. Stand on the Earth billions of years ago as a primitive planet slams into it. Shiver as our entire globe is frozen over like a gigantic snowball. Feel the heat as mammoth volcanoes scorch the landscape and darken the sky. From a cosmic gamma ray burst frying away the ozone layer to an Everest-size asteroid slamming into the ocean, we'll reveal new information about how these unparalleled events drove life to the brink of total extinction. Out of this continuous devastation, how has our planet--and life--got to where it is today? Are the worst days behind us--or lurking in the distant future? \n\n\n\n6) Ufos The Real Deal:\n\nMany argue that flying saucers and other extra-terrestrial space ships continuously visit the earth. If that were true, what kinds of technologies would such alien spacecraft require? And do eyewitness reports of UFO sightings jibe with modern theories of how interstellar travel might be possible? Authors, astronomers and theoretical physicists weigh in with the blueprints for inertia-canceling devices, nuclear-powered craft, antimatter propulsion systems and even warp drives. Based on Einstein's theories and countless scientific studies, we'll find out how these visitors might bridge the vast distances between the stars. And if they could survive such hazardous journeys, are they flesh and blood or intelligent machines? \n\n\n\n7) God And The Universe:\n\nSince the dawn of civilization, humans have wondered who or what created the universe. Religion offers a spiritual answer, but do the latest discoveries in physics show evidence of a transcendent intelligence, or simply that the laws of physics by themselves could have led to the universe in which we live? This episode embarks on a mind-bending scientific search for God, asking physicists and theologians if the seemingly miraculous way the universe has been calibrated to support life is evidence of a creator...whether string theory will eventually be able to rule out the existence of God...why Stephen Hawking says the universe could have been created spontaneously...and how an advanced civilization in another universe could have conceivably created our own. \n\n\n    \n            \n\n\nNarrated by: Erik Thompson\n==========================\n\nExecutive producers: Louis C.Tarrantino &amp; Douglas J.Cohen\n=========================================================\n\n\n\n\n\n\nTitle................: The Universe 6\nYear.................: 2011\nGenre................: Documentary \nVideo Length.........: 00:43:59 (  ) 00:44:00 Each\n\n\nAudio Bitrate........: 128 kbit/s\nAudio Codec..........: MPEG Layer-3 \nLanguage.............: English        \nDisplay Aspect ratio.: 16/9\n\nVideo Codec..........: XviD \nVideo Resolution.....: 624x352 \nVIdeo Bitrate........: 1110 kbit/s ( ) 1112 kbits\n\n\nSubs.................: External English\nFile Size:...........: 349 MB ( ) 350 MB\nFPS..................: 29.976000\n\nChannel(s)...........: 2 channels\nRelease date.........: 2011\nParts................: 7 Episodes\n\n\n \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1051155/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1051155/&lt;/a&gt; \n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1051155/episodes?year=2011&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1051155/episodes?year=2011&lt;/a&gt;\n\n\n\n\n   Episodes:\n   =========\n\n1) Catastrophes That Changed The Planets\n2) Nemesis The Suns Evil Twin\n3) How The Solar System Was Made\n4) Crash Landing On Mars\n5) Worst Days On Planet Earth\n6) Ufos The Real Deal\n7) God And The Universe\n\n\n\n[HDTV:]\n=======\n\n\n\n\nNote: External subtitles included.\n==================================\n\n\n \n \nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)\n\n\n\n\nFor further information and pictures/images of all my torrents visit&quot; Suprbay Forum&quot; at \nthis link: &lt;a href=&quot; http://suprbay.org/showthread.php?t=38774&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/showthread.php?t=38774&lt;/a&gt;                 \n\n*** This information is also avaible on the &quot;nfo&quot; file that comes with all my uploads.)***   \n\n\n\n\n                           \n\n\n\nPrevious Seasons:\n=================\n\n1) http://thepiratebay.se/torrent/4755728/The_Universe_1-%28WTC-SWE%29\n\n2) http://thepiratebay.se/torrent/4759634/The_Universe_2-%28WTC-SWE%29\n\n3) http://thepiratebay.se/torrent/4750855/The_Universe_3-%28WTC-SWE%29\n\n4) http://thepiratebay.se/torrent/5505528/The_Universe_4-%28WTC-SWE%29\n\n5) http://thepiratebay.se/torrent/6190977/The_Universe_5-%28WTC-SWE%29\n\n\n\n\n\n                     ***** HIGHLY RECOMMENDED DOWNLOAD *****\n\n\n\n\n\n\n\n\nSPECIAL NOTE:\n=============\n\nAfter my account accidentally got deleted i had to restore it.However if you click \n\non DOWNLOAD THIS TORRENT link it might not work for you.Use the magnet link(s) \n\ninstead,thank you.\t\n\n\n\n","torrent":{"xt":"urn:btih:7171313db357ea3d36213f8effa2efd0a6116a87","amp;dn":"The+Universe+6-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7171313db357ea3d36213f8effa2efd0a6116a87","infoHashBuffer":{"type":"Buffer","data":[113,113,49,61,179,87,234,61,54,33,63,142,255,162,239,208,166,17,106,135]},"announce":[],"urlList":[]}}