{"title":"&quot;Bring A Chick Into The Mix And Bi It Up!&quot;","uid":13225233,"size":1619226640,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:725e6b6db8f6ef1704b8b77258b289a944e3682f&amp;dn=%26quot%3BBring+A+Chick+Into+The+Mix+And+Bi+It+Up%21%26quot%3B+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ImgSnaps","files":6,"time":1452851662,"description":"&quot;Bring A Chick Into The Mix And Bi It Up!&quot; and &quot;Best To Join Forces When It Comes To Bi!&quot;...\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/N7\r\n \nhttp://imgsnaps.com/image/Nl\r\n \nhttp://imgsnaps.com/image/Nn\r\n \nhttp://imgsnaps.com/image/No\r\n\r\nDescription:\r\nIt's a beautiful summer day hanging by the pool and two studs are getting nice and sensual with the sunscreen, and when a foxy blonde sees them in action she has to come over and get involved! Only it's not sunscreen this crew is ultimately interested in, but rather two pop-shots of jizz, and as soon as these bi freaks are nice and naked they start getting it on right there in the grass! All three of these freaks are good little dick suckers, and of course they like those holes plowed as well, with pussy and ass getting filled up in all kinds of lovely bi combinations, because they're all open for cock business and this chick especially gets off watching these hotties pound away on each other! As the threesome action plows on Thomas Friedl and his lovely lady walk up and watch them from the other side of the pool, of course getting turned on and ready to get into the action themselves... When Thomas Friedl and his lady friend see a bisex threesome going on at the other side of the pool it of course gets them horny as hell and started in their own making out and beyond. It doesn't take long before the cock is out and this chick gets banged doggy style, all while they're checking out the other nearby action, and at some point they come to their senses and realize they need to join forces! Sure enough, these bi fuckers are down to add two more to the mix, creating a beautiful five person bisex fuck-fest that leaves them all satisfied as hell! It's always best to join forces when it comes to bi action!","torrent":{"xt":"urn:btih:725e6b6db8f6ef1704b8b77258b289a944e3682f","amp;dn":"%26quot%3BBring+A+Chick+Into+The+Mix+And+Bi+It+Up%21%26quot%3B+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"725e6b6db8f6ef1704b8b77258b289a944e3682f","infoHashBuffer":{"type":"Buffer","data":[114,94,107,109,184,246,239,23,4,184,183,114,88,178,137,169,68,227,104,47]},"announce":[],"urlList":[]}}