{"title":"Late to the Ball (2016).epub Gooner","uid":14997513,"size":685165,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7346b9cd70d141c549a09ac1866b772ebea2b745&amp;dn=Late+to+the+Ball+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1466357964,"description":"Late to the Ball - Age, Learn, Fight, Love, Play, Tennis, Win (2016) epub Gooner\r\n\r\nPublisher: Scribner Book Company (17 May 2016)\r\nLanguage: English\r\nISBN-10: 1476737398\r\nISBN-13: 978-1476737393\r\n\r\nAn award-winning author shares the inspiring and entertaining account of his pursuit to become a nationally competitive tennis player at the age of sixty. \r\n\r\nBeing a man or a woman in your early sixties is different than it was a generation or two ago, at least for the more fortunate of us. We aren't old yet. But we sense it coming: Careers are winding down, kids are gone, parents are dying (friends, too), and our bodies are no longer youthful or even middle-aged. Learning to play tennis in your fifties is no small feat, but becoming a serious, competitive tennis player at the age of sixty is a whole other matter. It requires training the body to defy age, and to methodically build one s game the strokework, footwork, strategy, and mental toughness. \r\n\r\nGerry Mazorati started playing the game seriously in his mid-fifties. He had the strong desire to lead an examined physical life, to push his body into the encore of middle age. In &quot;Late to the Ball&quot; Mazorati writes vividly about the difficulties, frustrations, and the triumphs of his becoming a seriously good tennis player. He takes on his quest with complete vigor and absolute determination to see it through, providing a rich, vicarious experience involving the science of aging, his existential battle with time, and the beautiful, mysterious game of tennis. \r\n\r\n&quot;Late to the Ball&quot; is also captivating evidence that the rest of the Baby Boomer generation, now between middle age and old age, can find their own quest and do the same.&quot;","torrent":{"xt":"urn:btih:7346b9cd70d141c549a09ac1866b772ebea2b745","amp;dn":"Late+to+the+Ball+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7346b9cd70d141c549a09ac1866b772ebea2b745","infoHashBuffer":{"type":"Buffer","data":[115,70,185,205,112,209,65,197,73,160,154,193,134,107,119,46,190,162,183,69]},"announce":[],"urlList":[]}}