{"title":"A Far Piece to Canaan by Sam Halpern","uid":9622033,"size":597523,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7470ccb26a2e4be6e9188213d4663e841eb3f9c2&amp;dn=A+Far+Piece+to+Canaan+by+Sam+Halpern&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1392516695,"description":"\nA warm and nostalgic debut novel from an unexpected source: Sam Halpern, whose salty paternal wisdom made Justin Halpern's Sh*t My Dad Says a phenomenal bestseller.\n\nInspired by Sam Halpern's childhood in rural Kentucky, A Far Piece to Canaan tells the story of Samuel Zelinsky, a celebrated but troubled retired professor who reluctantly returns after his wife's death to visit a farm in the Kentucky hills where he lived as a child. The son of sharecroppers, Samuel has long since left that life behind-yet now must reconnect with long-buried memories in order to achieve peace.\n\nDelving into the events of 1945, Sam recalls Fred Mulligan, the hired hand's bright and spirited ten-year-old son. Together with two neighbor boys, Samuel and Fred visit the Blue Hole, a legendary pool on the Kentucky River where the hill people believe an evil force lurks. The boys find the body of a dog, surrounded by twisted human footprints, and later discover a cave that offers other evidence that something terrible has transpired. Fearing that they'll be punished for their trespasses, the boys initiate a series of cover-ups and lies that eventually lead to a community disaster.\n\nWhen the Zelinskys move from the farm, the two boys promise each other that if either of them ever needs help, the other will come to his aid, but after he moves to Indiana and is ridiculed because of his &quot;hillbilly&quot; background, Sam rejects his past.\n\nNow, decades later, Sam is devastated to learn from a fellow classmate about Fred's tragic life story in the years that followed-and manages to make contact with his troubled granddaughter, Lisa June. Though at first she rejects his attempts to reach out to her, through persistence and patience Samuel finally manages to establish a connection, becoming a kind of surrogate grandfather to Lisa June-and finally achieving peace through his late return to Canaan land.\n\nA tale of superstition, secrets, and heroism in the postwar South, A Far Piece to Canaan is the surprising and moving debut of a gifted storyteller\n\nGenre: Fiction/Historical","torrent":{"xt":"urn:btih:7470ccb26a2e4be6e9188213d4663e841eb3f9c2","amp;dn":"A+Far+Piece+to+Canaan+by+Sam+Halpern","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7470ccb26a2e4be6e9188213d4663e841eb3f9c2","infoHashBuffer":{"type":"Buffer","data":[116,112,204,178,106,46,75,230,233,24,130,19,212,102,62,132,30,179,249,194]},"announce":[],"urlList":[]}}