{"title":"Unlikeable: The Problem with Hillary (epub)","uid":14857481,"size":1647012,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7490eccd23e0c54923cdd24691db775993728f6b&amp;dn=Unlikeable%3A+The+Problem+with+Hillary+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SectorVector","files":1,"time":1465494563,"description":"Unlikeable is the stunning, powerful exposé of Hillary Clinton and her floundering race for the White House. With unprecedented access to longtime associates of the Clintons and the Obamas, investigative reporter Edward Klein meticulously recreates conversations and details of Hillary Clinton's behind-the-scenes plotting in Chappaqua and Whitehaven.\r\n\r\nKlein, the former editor in chief of New York Times Magazine and a contributing editor to Vanity Fair, draws a deeply troubling portrait of Hillary Rodham Clinton, a highly unlikeable presidential candidate and a woman more associated with scandal than with accomplishments, with lying than with truth, with arrogance than with compassion.\r\n\r\nAuthor Biography:\r\n\r\nEdward Klein is a well-known editor, writer and public speaker with a distinguished career in American journalism.\r\n\r\nAfter serving an apprenticeship as a copy boy for the New York Daily News, he went on to earn a master’s degree from Columbia University’s Graduate School of Journalism, which awarded him a traveling fellowship to Japan. There, he learned to speak Japanese and traveled throughout Asia as a foreign correspondent for United Press International. Upon his return to New York, he joined Newsweek, where he became foreign editor and then assistant managing editor with jurisdiction over foreign and military affairs","torrent":{"xt":"urn:btih:7490eccd23e0c54923cdd24691db775993728f6b","amp;dn":"Unlikeable%3A+The+Problem+with+Hillary+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7490eccd23e0c54923cdd24691db775993728f6b","infoHashBuffer":{"type":"Buffer","data":[116,144,236,205,35,224,197,73,35,205,210,70,145,219,119,89,147,114,143,107]},"announce":[],"urlList":[]}}