{"title":"Elementals","uid":7808777,"size":954990144,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:74c994251ee81c2ff157eca0590b7c23b772e1f2&amp;dn=Elementals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Fauzty","files":88,"time":1352472978,"description":"When a centuries-old sorcerer named Lord Saker built a machine called the Shadowspear to harness the supernatural powers of the world, he upset the natural order of the universe. In response, the four elements, unimaginably powerful spirits who together formed the foundation of existence, each chose an ordinary human who had been killed by their element, and resurrected him or her. They granted each control of that particular element, eternal youth, and the ability to heal from any wound (given sufficient time). These four were the Elementals, sent to oppose Saker.\nThe team consisted of:\n\nMorningstar, aka Jeanette Crane, a Los Angeles homicide detective who had burned to death while confronting a serial arsonist; she received various fire-related abilities, including pyrokinesis and an immunity to fire.\n\nVortex, aka Jeff Murphy, a Coast Guard pilot who was asphyxiated in a helicopter crash; he received various air-related abilities, including flight and wind-blasts.\n\nFathom, aka Becky Golden, a flighty debutante who fell off a boat and drowned; she received various water-related abilities, as well as bright green skin and webbed fingers. She was also able to convert her body entirely into sentient water and shoot high-pressure streams.\n\nMonolith, aka Tommy Czuchra, a brilliant if introverted teenaged boy who was crushed to death by a landslide; he received the ability to become an enormous super-strong stone/earth golem. Later, Tommy came to follow Saker's view that the supernatural beings were entitled to be in charge across earth, and he quit the Elementals and absorbed some of Saker's 'black' magic, to become one of his generals. Monolith was then re-embodied in a deceased insurance salesman (Donald Ridgeway), who neither wanted the power, nor ever understood fully how to use it or how to integrate with the other three Elementals.","torrent":{"xt":"urn:btih:74c994251ee81c2ff157eca0590b7c23b772e1f2","amp;dn":"Elementals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74c994251ee81c2ff157eca0590b7c23b772e1f2","infoHashBuffer":{"type":"Buffer","data":[116,201,148,37,30,232,28,47,241,87,236,160,89,11,124,35,183,114,225,242]},"announce":[],"urlList":[]}}