{"title":"Mikagura Detectives Privados [porno] [hentai]","uid":6866698,"size":855674880,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:757b01022ec9d8b34b41760afb3505abab282504&amp;dn=Mikagura+Detectives+Privados+%5Bporno%5D+%5Bhentai%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"furtaperas","files":-1,"time":1323127875,"description":"Sinopsis:\n\nEpisodio 1:\nTokito, el presidente de la agencia de detectives Mikagura, ha desaparecido de la noche a la maÃƒÂ±ana. Sus tres jÃƒÂ³venes ayudantes, Tomoe, Shigeno y Chizuru, que le tienen mucho aprecio, deciden salir en su busca. Siguiendo las indicaciones del hermano de Shigeno, Shizuto, las chicas se desplazan a Manchuria, donde parece ser que su jefe ha sido visto. Al llegar, lo que se encuentran es el cuerpo sin vida del padre Hatanaka, el reverendo del pueblo, a quien le han cortado ambos brazos. Ã‚Â¿Es una coincidencia o tiene algo que ver con el detective Tokito? Cuando mÃƒÂ¡s se acercan a la verdad, mÃƒÂ¡s inminente es el peligro Ã‚Â¿ConseguirÃƒÂ¡n encontrar a Tokito sus ayudantes?..\n\nEpisodio 2:\nEl propietario del restaurante Kotora, sospechoso de matar al padre Hatanaka, aparece tambiÃƒÂ©n asesinado. Como en el caso del sacerdote, el cuerpo tiene ambos brazos cortados. Shigeno, por su parte, se toma un descanso para recuperarse de la impresiÃƒÂ³n que le ha causado ver a Tokito tan cambiado. Gracias a los ÃƒÂ¡nimos de su hermano, logra reponerse y reemprender la investigaciÃƒÂ³n junto a sus dos compaÃƒÂ±eras. Las tres chicas descubren la implicaciÃƒÂ³n de uno de los clientes habituales del Kotora, un hombre llamado Hayasumi. Shigeno, sola, sigue a Hayasumi al restaurante, donde le encuentra enzarzado en unas promiscuas prÃƒÂ¡cticas sexuales..\n\nEpisodio 3:\nChizue es encontrada muerta, sin ropa y ensartada con un arpÃƒÂ³n. Las tres detectives sospechan de Shogo Tokiwa e interrogan a los implicados. Pero antes de poder solucionar el homicidio, Akane, la camarera del Kotora, aparece muerta exactamente del mismo modo y Gonzo es acusado de ambas muertes. No obstante, las chicas no creen que ÃƒÂ©l sea el verdadero asesino y deciden encontrar al culpable utilizando a Chizuru como cebo. Pero Chizuru es secuestrada por un joven enmascarado que va a violarla.. ","torrent":{"xt":"urn:btih:757b01022ec9d8b34b41760afb3505abab282504","amp;dn":"Mikagura+Detectives+Privados+%5Bporno%5D+%5Bhentai%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"757b01022ec9d8b34b41760afb3505abab282504","infoHashBuffer":{"type":"Buffer","data":[117,123,1,2,46,201,216,179,75,65,118,10,251,53,5,171,171,40,37,4]},"announce":[],"urlList":[]}}