{"title":"EnigmaT Set Rips { Cuts } - February 19th, 2014","uid":9632009,"size":1024956039,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7581d3253123a22207c49072d28583ffb0725f8a&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+February+19th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":126,"time":1392799434,"description":"Adventure Club - Wonder (Pegboard Nerds Remix) (Cut From Xabi Set)-enTc.mp3\nAgnelli &amp; Nelson - Everyday (Craig London 2014 Remix) (Set Rip)-enTc.mp3\nAirscape - L'Esperanza (Jordan Suckley &amp; James Rigby Remix) (ASOT 650 Rip)-enTc.mp3\nAlexandre Bergheau - Damavand (Hristian Hristov Remix) (Cut From Saux Set)-enTc.mp3\nAll Sandu - Blossom (Original Mix) (Cut From Gibson Set)-enTc.mp3\nAly &amp; Fila &amp; Giueseppe Ottaviani - Brilliant People (ID Remix) (ASOT 650 Rip)-enTc.mp3\nAly &amp; Fila - Tula (The Noble Six Remix) (ASOT 650 Rip)-enTc.mp3\nAly &amp; Fila feat Karen Yousef - Laily (ID Remix) (Photographer ASOT 650 Rip)-enTc.mp3\nAly &amp; Fila feat. Jaren - End Of The Road (Hazem Beltagui Remix) (ASOT 650 -SAMPLE-)-enTc.mp3\nAly &amp; Fila feat. Sue McLaren - Where To Now (ID Remix) (ASOT 650 Rip)-enTc.mp3\nAly &amp; Fila featuring Rafif - Mother Nature (Bryan Kearney Remix) (ASOT 650 Rip)-enTc.mp3\nAndain - Beautiful Things (Fady &amp; Mina 2014 Rework) (ASOT 650 Rip)-enTc.mp3\nAndrea Bertolini - Colorama (Jeremy Rowlett Remix) (Cut From Tempo Set)-enTc.mp3\nAndrew Rayel feat. Alexandra Badoi - Goodbye (ASOT 650 Rip)-enTc.mp3\nAndybody - Good Meet Evil, Evil Meet Good (Club Edit) (Cut From W&amp;W Set)-enTc.mp3\nArmin van Buuren &amp; Andrew Rayel - EIFORYA (ASOT 650 -SHORT- Rip)-enTc.mp3\nArmin van Buuren &amp; Andrew Rayel - EIFORYA (Intro Mix) (ASOT 650 Rip)-enTc.mp3\nArmin van Buuren - Ping Pong (ASOT 650 Rip)-enTc.mp3\nArmin van Buuren - Ping Pong (Simon Patterson Remix) (ASOT 650 Rip)-enTc.mp3\nAudien - Ellydium (ASOT 650 Rip)-enTc.mp3\nAustin Leeds - Exotic (Original Mix) (Cut From Tempo Set)-enTc.mp3\nAxis - Arrival (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nBeatsole &amp; Michael Retouch - Brilliant Sunrise (Haig &amp; Raffi Remix) (Cut From Sty Set)-enTc.mp3\nBlasterjaxx &amp; Ibranovski - Astronaut (Dropwizz Festival Bootleg) (Cut From Xabi Set)-enTc.mp3\nBlue Silence &amp; Matt Chowski - Nothing To Fear (New World Remix) (Cut From tranzLift Set)-enTc.mp3\nCapital Cities - Safe &amp; Sound (ID Remix) (New World Punx ASOT 650 Rip)-enTc.mp3\nCiro Visone - The Day After (Original Mix) (Cut From Vale Set)-enTc.mp3\nCosmic Gate - ID -February 2014-  (ASOT 650 Rip)-enTc.mp3\nCraig London - Bright Lights (Original Mix) (Set Rip)-enTc.mp3\nCraig London - The Journey (Original Mix) (Set Rip)-enTc.mp3\nCurtis Young - Past Present Future (Original Mix) (Cut From Signum Set)-enTc.mp3\nDance Floor Hustlers feat. Lois - From The Sunset (Trim The Fat Remix) (Cut From Young Free Set)-enTc.mp3\nDanny Stubbs - The Nephilim (Cut From Solarstone Set)-enTc.mp3\nDario Nunez &amp; Julian The ANgel - Sweet Chil Of Mine (2014 Mix) (ASOT 650 Rip)-enTc.mp3\nDash Berlin &amp; Rasmus Faber feat. Linus Nordan - We Dance, We Laugh, We Cry (ASOT 650 -SAMPLE-)-enTc.mp3\nDash Berlin &amp; RIGBY - Earth Meets Water (ASOT 650 Rip)-enTc.mp3\nDeep Lark feat. Pryce Oliver - Give It Away (Cut From Fon.Leman Set)-enTc.mp3\nDelerium feat. Sarah McLachlan - Silence (ID Remix) (ASOT 650 Rip)-enTc.mp3\nDGM - In My Mind (Cut From W&amp;W Set)-enTc.mp3\nDriftmoon - Luminance (ASOT 650 Intro Mix) (ASOT 650 Rip)-enTc.mp3\nDVBBS &amp; Tony Junior - Immortal (Cut From W&amp;W Set)-enTc.mp3\nEast &amp; Young - Jupiter (Original Mix) (Cut From Halliwell Set)-enTc.mp3\nEminem - Loose Yourself (Eddie Bitar Psy Rework - Intro Edit) (ASOT 650 Rip)-enTc.mp3\nFabio XB feat. Christina Novelli - Back To You (Cut From Riel Set)-enTc.mp3\nFedde Le Grand &amp; DI-RECT - Where We Belong (Henry Fong Remix) (Cut From R3Hab Set)-enTc.mp3\nFerry Tayle feat. Erica Curran - Rescue Me (Cut From Riel Set)-enTc.mp3\nFrank Dattilo - Supernatural (Sowa Remix) (Cut From tranzLift Set)-enTc.mp3\nGalantis - You (Cut From W&amp;W Set)-enTc.mp3\nGareth Emery feat. Bo Bruce - U (Bryan Kearney Remix) (ASOT 650 Rip)-enTc.mp3\nGarido &amp; Hanski Feat. Erin - Time We Fall (Falcon Dub) (Cut From Saux Set)-enTc.mp3\nHardwell feat. Matthew Koma - Dare You (Andrew Rayel Remix) (ASOT 650 Rip)-enTc.mp3\nHazem Beltagui feat. Susana - Silent For So Long (Original Mix) (Cut From Susana Set)-enTc.mp3\nHot Steppa - Fayen (Florian Rietze Remix) (Cut From Young Free Set)-enTc.mp3\nHydro Aquatic - Havoc (Original Mix) (Cut From Cold Set)-enTc.mp3\nIvan Gough &amp; Feenixpawl feat. Georgi Kay - In My Mind (Andrew Rayel Remix) (ASOT 650 Rip)-enTc.mp3\nIvan Gough &amp; Jebu - Noxu (Cut From R3Hab Set)-enTc.mp3\nJayeson Andel &amp; Andrea Wilson - Flight Gravity (Tygris Remix) (Cut From Falcon Set)-enTc.mp3\nJenaux feat. Jared Lee - Turn Your World Around (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nJoey Dale - Shockwave (Cut From W&amp;W Set)-enTc.mp3\nJohn Newall - Santa Monica (Cut From Riel Set)-enTc.mp3\nJulian Calor - Storm (Cut From W&amp;W Set)-enTc.mp3\nJulian Calor - Storm (Cut From Xabi Set)-enTc.mp3\nKaimo K &amp; Ellie Lawson - Never Dared To Start Again (Space Rockerz Remix) (Cut From Susana Set)-enTc.mp3\nKaranda - Krank (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nKaty Perry - Dark Horse feat. Juicy J (Jazz Von D Bootleg) (Cut From W&amp;W Set)-enTc.mp3\nKudesnik &amp; Prise feat. Eva Kade - Ancient Dreams (Kaito Dub Mix) (Cut From Young Free Set)-enTc.mp3\nLaidback Luke &amp; Project 46 - Collide (Marc Benjamin Remix) (Cut From R3Hab Set)-enTc.mp3\nLoobosh &amp; Laucco - Czechoslovakia (Original Mix) (Cut From tranzLift Set)-enTc.mp3\nLox D - S.H.U.M. (Weedekind Remix) (Cut From D&amp;E Set)-enTc.mp3\nLuke Bond feat. Roxanne Emery - On Fire (ID Remix) (ASOT 650 Rip)-enTc.mp3\nLush &amp; Simon vs. Oasis - City Of Wonderwalls (SHato &amp; Paul Rockseek Mashup) (Cut From Tritonal Set)-enTc.mp3\nM3R-T - I'm Back (Original Mix) (Cut From Sty Set)-enTc.mp3\nM3R-T - Vingardium (Cosmic Heaven Remix) (Cut From Sty Set)-enTc.mp3\nM3R-T - Vingardium (Original Mix) (Cut From Sty Set)-enTc.mp3\nMaison &amp; Dragen - Chinese New Year (Original Mix) (Cut From Tempo Set)-enTc.mp3\nManida - The Last Sunrise (Hypaethrame Remix) (Cut From tranzLift Set)-enTc.mp3\nMatisse &amp; Sadko - Were Not Alone (Kill The Buzz Remix) (Cut From W&amp;W Set)-enTc.mp3\nMax Braiman - ID -Feb 2014- (Cut From Falcon Set)-enTc.mp3\nMercer &amp; DJ Snake - Lunatic (Cut From Howard Set)-enTc.mp3\nMercer feat. Dj Snake - Lunatic (Cut From W&amp;W Set)-enTc.mp3\nMerk &amp; Kremont - Samurai Revolution Numb (R3hab, Nervo, Ummet Ozcan, Linkin Park) (Set Rip)-enTc.mp3\nMightyfools &amp; Niels van Gogh - Pullover (Cut From W&amp;W Set)-enTc.mp3\nMisja Helsloot - Wrecked (Peter Martijn Wijnia Remix) (Cut From Signum Set)-enTc.mp3\nNew World Sound &amp; Thomas Newson - Flute (Danny Howard Remix) (Set Rip)-enTc.mp3\nNicole Scherzinger - I'll Be Your Love (Veselin Tasev Remix) (Cut From Tasev Set)-enTc.mp3\nNine Inch Nails - The Day the World Went Away (CBM &amp; Johnny Zana Remix) (Set Rip)-enTc.mp3\nOrjan Nilsen &amp; Fingerling - W.D.I.A! (Cut From W&amp;W Set)-enTc.mp3\nPaul Oakenfold - Cafe Del Mar (Activa Remix) (Cut From Riel Set)-enTc.mp3\nPaul Webster &amp; Jordan Suckley - Help (ASOT 650 Rip)-enTc.mp3\nPhillip J - Constellations (Odonbat Remix) (Set Rip)-enTc.mp3\nPreon feat. Carly Lind - Smoke (Original Mix) (Cut From Susana Set)-enTc.mp3\nProyal feat. Ai Takekawa - The Orbit (Biotones &amp; Max Farewell Remix) (Cut From Susana Set)-enTc.mp3\nPsymes &amp; DJ HARN - On Call Nights (Ico Azid Remix) (Cut From Summerville Set)-enTc.mp3\nRafael Osmo pres. Audio Freeze - Back In Time (Cloudwalker Remix) (Cut From Gibson Set)-enTc.mp3\nRank 1 vs. Andrew Rayel - Such Is Life (Andrew Rayel Intro) (ASOT 650 Rip)-enTc.mp3\nReOrder &amp; Ian Standerwick pres. Skypatrol  - Sailing Airwaves (ASOT 650 Rip)-enTc.mp3\nRich Triphonic - Free Falling (Mike van Fabio Remix) (Cut From Vale Set)-enTc.mp3\nRobbie V feat. Robert Vadney - Lu5t (Sean Mathews Remix) (Set Rip)-enTc.mp3\nRya &amp; Manida vs M3R-T - Hopeful Days (Odonbat Remix) (Set Rip)-enTc.mp3\nSam Jones &amp; Will Rees - Fire Drill (ASOT 650 Rip)-enTc.mp3\nSamee - Endless Premonition (Original Mix) (Cut From Kirkwood Set)-enTc.mp3\nSandro Silva &amp; D.O.D - Chasing Dreams (Cut From Howard Set)-enTc.mp3\nSeneta - Solar Surfers (Original Mix) (Cut From Falcon Set)-enTc.mp3\nShahead feat. Juliet Lyons - Outside Of Time (Sou Kanai Remix) (Cut From Tasev Set)-enTc.mp3\nSimon O'Shine &amp; Adam Navel - Marathon (Adam Navel TMUP Anthem Mix) (Cut From Tasev Set)-enTc.mp3\nSkywell - Moments (Craig London Remix) (Set Rip)-enTc.mp3\nSneijder &amp; Bryan Kearney - ID (ASOT 650 Rip)-enTc.mp3\nSpencer Brown - Double Down (Cut From Howard Set)-enTc.mp3\nSteam Noize - Illusion (Original Mix) (Cut From DJ Leon Set)-enTc.mp3\nStella Project - Odessa City (John Sunlight Remix) (Cut From Saux Set)-enTc.mp3\nStephen Kirkwood - Off The Edge (Cut From Riel Set)-enTc.mp3\nSteve Brian &amp; Vlad Varel - Vegas (Original Mix) (Set Rip)-enTc.mp3\nTempo Giusto - Game Changer (Original Mix) (Cut From Tempo Set)-enTc.mp3\nThe Cloudy Day - Aurora (Original Mix) (Cut From tranzLift Set)-enTc.mp3\nThe Killers - Crossfire (Steve Brian &amp; Oudai Abdulhadi Bootleg) (Cut From Dinaire Set)-enTc.mp3\nThe Killers - Crossfire (Steve Brian &amp; Oudai Abdulhadi Bootleg) (Set Rip)-enTc.mp3\nTiesto - Red Lights (Twoloud Remix) (Cut From Xabi Set)-enTc.mp3\nTransport - Daydreams (Original Mix) (Cut From Sty Set)-enTc.mp3\nTransport - From Here To Eternity (A.L.A.M.I Remix) (Cut From Sty Set)-enTc.mp3\ntranzLift - ID (Original Mix) (Cut From tranzLift Set)-enTc.mp3\nTST vs twoloud - Drop It Like This (Cut From W&amp;W Set)-enTc.mp3\nTuneflux - Sanguine (Original Mix) (Cut From Vale Set)-enTc.mp3\nTuneflux - Sprint (Original Mix) (Cut From Vale Set)-enTc.mp3\nTygris - Red Room (Original Mix) (Cut From Falcon Set)-enTc.mp3\nVitaly Otto - Element (Original Mix) (Cut From tranzLift Set)-enTc.mp3\nZ.E.R.O. - Transcend (Original Mix) (Cut From Tritonal Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:7581d3253123a22207c49072d28583ffb0725f8a","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+February+19th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7581d3253123a22207c49072d28583ffb0725f8a","infoHashBuffer":{"type":"Buffer","data":[117,129,211,37,49,35,162,34,7,196,144,114,210,133,131,255,176,114,95,138]},"announce":[],"urlList":[]}}