{"title":"EnigmaT Set Rips { Cuts } - March 13th, 2014","uid":9754127,"size":385791391,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:77d18d93d55ea40c7bd154fc70155a4d409deb8b&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+March+13th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":49,"time":1394702880,"description":"Ad Brown - Template Essesntials 3 (-FiXeD- Set Rip)-enTc\nAlter Future - Zero (Original Mix) (Cut From Styller Set)-enTc\nAly &amp; Fila - First Sun (Akira Kayosa &amp; Hugh Tolland Mix) (Cut From Akira Set)-enTc\nAndain - Beautiful Things (Daniel Skyver Remix) (Cut From Suckley Set)-enTc\nAngry Man &amp; Future Disciple - The Smuggler From Bombay (Harmonic Rush Remix) (Cut From Suckley Set)-enTc\nArmin van Buuren - Ping Pong (Audio Jackz Bootleg) (Cut From Xabi Set)-enTc\nBluSkay &amp; KeyPlayer - Cassiopeia (Original Mix) (Cut From Angel Ace Set)-enTc\nBobina - Refuge (Cut From Feel Set)-enTc\nBVR - Phenomen (Cut From Lynam Set)-enTc\nChristish Pres. MANA - Kimochi (Simon OShine Remix) (Cut From Angel Ace Set)-enTc\nCiro Visone &amp; Alessandra Roncone - Shiver (Original Mix) (Cut From Angel Ace Set)-enTc\nCMLD - Drifting (Cut From Ruben Set)-enTc\nDaniel Kandi - Better Late Than Never (Original Mix) (Cut From Angel Ace Set)-enTc\nDelAir - Jupiter (Original Mix) (Cut From Solarstone Set)-enTc\nDelAir - Stellar Space (Original Mix) (Cut From Suzy Set)-enTc\nDyro feat. Ryder - Calling Out (Original Mix) (Cut From Ferry Set)-enTc\nFher Vizzuett - Zion (Original Mix) (Cut From Angel Ace Set)-enTc\nFrank Dattilo - Braveheart (Ikerya Project Remix) (Cut From Angel Ace Set)-enTc\nHoyaa - Northlander (Original Mix) (Cut From Angel Ace Set)-enTc\nHuge Euge feat. Victoria Shersick - Mesmerize (Original Mix) (Cut From Young Free Set)-enTc\nilan Bluestone - Waves Of L.A.  (Cut From Feel Set)-enTc\nInertial System - Outta Space (Cut From Lynam Set)-enTc\nJeremy Rowlett - Forever (Basil O'Glue Remix) (Cut From Styller Set)-enTc\nLekSin - A Way Between Two Worlds (Swilow Remix) (Cut From Arctic Moon Set)-enTc\nLeon Bolier - Project XVI (Cut From Bolier Set)-enTc\nMax Bourne - Celestial Eva (Original Mix) (Cut From 1Touch Set)-enTc\nMenno de Jong feat. Stereojackers vs. Mark Loverush &amp; Shelley Harland - Connected (Kaimo K Bangin Mix) (Set Rip)-enTc\nMillaway - Echolalia (John Sunlight Remix) (Cut From Angel Ace Set)-enTc\nMillaway - Echolalia (John Sunlight Remix) (Cut From Romel Set)-enTc\nMorten - Perfect Drive (Cut From Ruben Set)-enTc\nNaden - Cerulean (Cut From Ruben Set)-enTc\nNaden - Macaw  (Cut From Ruben Set)-enTc\nNaden - Sonder (Cut From Solarstone Set)-enTc\nNamatjira - Ethos (LoQuai Remix) (Cut From Slang Set)-enTc\nNicola Maddaloni - Limbus (A.L.A.M.I &amp; Allam Remix) (Cut From Romel Set)-enTc\nNicola Maddaloni - Limbus (Behind The Sunset Remix) (Cut From Xabi Set)-enTc\nOrphia - Tomorrow's Light (Mr. Pit Edit) (Cut From Pit Set)-enTc\nPerpetuous Dreamer - Sound of Goodbye (Deep Energy 2014 Bootleg) (Cut From Arctic Moon Set)-enTc\nRene Ablaze &amp; AxelPolo - Contact (Angel Ace Remix) (Cut From Angel Ace Set)-enTc\nRoyksopp feat. Susanne Sundfor - Running To The Sea (Mats Gulbrandsen Bootleg) (Cut From Young Free Set)-enTc\nSarah Lynn - At The End Of Every Journey (Jorn Van Deynhoven Extended Vocal Mix) (Cut From Solarstone Set)-enTc\nSebastian Weikum - Egoiste (Cut From Ruben Set)-enTc\nSergey Shabanov - Cascada (Casey Rasch Remix) (Cut From Akira Set)-enTc\nShingo Nakamura - Side Trip (Cut From Solarstone Set)-enTc\nSourcee feat. Litsa - Tick Tock (Sean Bayer Remix) (Cut From Young Free Set)-enTc\nThe Mozati - Farewell (Oluca Remix) (Cut From Slang Set)-enTc\nUCast - Ternary (Original Mix) (Cut From 1Touch Set)-enTc\nUrban Cookie Collective vs. CJ Stone - Feels like Heaven (Mikro Remix) (Cut From Pit Set)-enTc\nVicetone feat. Chloe Angelides - White Lies (Original Mix) (Cut From Ferry Set)-enTc\n","torrent":{"xt":"urn:btih:77d18d93d55ea40c7bd154fc70155a4d409deb8b","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+March+13th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77d18d93d55ea40c7bd154fc70155a4d409deb8b","infoHashBuffer":{"type":"Buffer","data":[119,209,141,147,213,94,164,12,123,209,84,252,112,21,90,77,64,157,235,139]},"announce":[],"urlList":[]}}