{"title":"Painter Essentials 3","uid":4631566,"size":530105317,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:78c5d7e13bccf2e574b9097914a0255f366cb3f1&amp;dn=Painter+Essentials+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"themadoldman","files":-1,"time":1231409944,"description":"Corel has announced the release of Painter Essentials 3 digital art software. Previously, Painter Essentials has only been available in North America bundled with hardware. It will be interesting to see what has been done to the product in this new stand-alone version. Some of the new features and enhancements in this version include photo painting palettes for turning photos into art, quick clone feature, artists' oils digital watercolor painting tools, rubber stamp and eraser tools, training videos, and increased compatibility with other software.\n\nFrom a Corel Press Release:\n\nCorel Corporation today unveiled Corel Painter Essentials 3, the complete home art studio built on the award-winning power of Corel Painter IX. The latest addition to Corel's digital imaging portfolio, Corel Painter Essentials 3 includes everything new users need to get started with digital art and create stunning paintings from their photos.\n\nIdeal for digital camera enthusiasts, art, decor and scrapbook enthusiasts, and art students and teachers, Corel Painter Essentials 3 enables users to create beautiful, handmade digital-art keepsakes that are perfect for framing, craft projects, and special gifts for friends and family.\n\nWith a new easy-to-learn interface, dynamic painting palettes that automatically paint your photos for you, and extensive training resources, Corel Painter Essentials 3 empowers users to turn their mouse or tablet stylus into a digital paintbrush and begin a new journey of creative possibilities.\n\nTurn Photos into Paintings\n\n    * New! Photo Painting Palettes - In three easy steps, the new Photo Painting Palettes, including the Underpainting, Auto-Painting, and Restoration palettes, work together to help users create a beautiful hand-painted work of art from a digital photo. The software automatically applies individual hand-painted strokes, painting the image right before the user's eyes - like magic!\n    * New! Quick Clone - The new Quick Clone feature starts the process of turning a photo into a painting with a simple mouse click.\n\nHave Fun with Digital Art\n\n    * New! Artists' Oils - Delivering a new level of realism, Artists' Oils truly behave like traditional oil paint. They blend, mix, and feel gooey - providing users with a highly life-like experience.\n    * Enhanced! Digital Watercolor - Digital Watercolor produces life-like watercolor effects that react with the canvas texture. Significantly enhanced, Digital Watercolor paint now stays wet between sessions, enabling users to start one session where the last one ended.\n    * New! Rubber Stamp tool - The Rubber Stamp tool makes it easy for users to set up point-to-point cloning. Located in the toolbox, this tool lets users set a source and destination reference point, enabling them to clone within a image file or between different areas of separate image files.\n    * New! Eraser tool - Conveniently located in the toolbox, the new Eraser tool erases any medium on the canvas.\n\nLearn to Draw and Paint Digitally\n\n    * New! Quick Guide Palette - Click on a palette, the toolbox, the Brush Selector bar, or the property bar and the Quick Guide displays relevant information about the options available and a link to more comprehensive Help. Providing context-sensitive information about the options available from workspace items, the Quick Guide palette makes it easier than ever to get started.\n    * New! Training videos by lynda.com - Corel Painter Essentials 3 includes 10 new training videos created by lynda.com, one of the world's most renowned graphics training companies, to guide users through the Corel Painter Essentials workspace, tools, features, and techniques. Users can also sign up to download 10 more free training videos.\n    * New! Animated Training Movie for Kids from GeeGuides - GeeGuides Painter Essentials 3 Lessons is a fun, Web-based interactive art education program appropriate for grades 3 through 6. It provides the tools children need to understand, interpret and enjoy art, while fostering critical thinking. In addition, GeeGuides keeps track of your child's learning growth and provides customized achievement reports. A sample GeeGuides Painter Essentials 3 Lessons training movie is included in the box. Additional movies are available for purchase through GeeGuides.\n    * * New! Welcome Screen - Getting started with digital art has never been more straightforward, thanks to the new Corel Painter Essentials 3 Welcome screen. The Welcome screen gives quick access to recently used files, tutorials, and settings. It also showcases original images from renowned Corel Painter artists, inspiring users to explore the application and create their own works of art.\n    * New! Quick Start tutorials - These short, instructive tutorials guide users through basic tasks, such as transforming a photo into a painting.\n\nWorks with Popular Software and Hardware\n\n    * New! Support for Corel Paint Shop Pro and Corel Photo Album - Customers using Windows can optimize their photos with Corel Paint Shop Pro X, create personalized handmade paintings with Corel Painter Essentials 3, and then use Corel Photo Album 6 to easily use their final painted images in creative projects, such as calendars and greeting cards, that are perfect for sharing! From photo editing and digital painting to organizing image collections and creating keepsakes and crafts, Corel's digital-imaging product family delivers a new world of possibilities and helps users get the most out of their digital camera.\n    * New! Support for Adobe Photoshop CS and Adobe Photoshop Elements - Users on Mac and Windows can now seamlessly exchange files between Corel Painter Essentials 3, Adobe Photoshop, and Adobe Photoshop Elements. Layers and layer sets (layer groups) are maintained when users open and save files in the PSD file format.\n    * New! Support for Apple iPhoto - Mac OS users, including those using Mac OS X 4 (Tiger), can easily add art to their digital image collections, thanks to support for Apple iPhoto. Users can set their iPhoto preferences to designate Corel Painter Essentials 3 as their photo-editing software. Double-clicking an iPhoto image will open the image for editing in Corel Painter Essentials 3 and saved changes are instantly updated in iPhoto.\n    * Enhanced! Support for Wacom Pen Tablets - Corel Painter Essentials 3 fully supports the most recent advancements in pen tablet technology from Wacom, including the latest Graphire, Intuos and Cintiq tablets, as well as the 6D Art Pen    WindowsÃ‚Â® 2000  Windows XP","torrent":{"xt":"urn:btih:78c5d7e13bccf2e574b9097914a0255f366cb3f1","amp;dn":"Painter+Essentials+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78c5d7e13bccf2e574b9097914a0255f366cb3f1","infoHashBuffer":{"type":"Buffer","data":[120,197,215,225,59,204,242,229,116,185,9,121,20,160,37,95,54,108,179,241]},"announce":[],"urlList":[]}}