{"title":"Luke Bryan - Do I  (2nafish)","uid":5270025,"size":176097284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:79535b109124f0dc1776730f69c97f543313881b&amp;dn=Luke+Bryan+-+Do+I++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"2nafish","files":-1,"time":1263024870,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Linear PCM, 48000 Hz, Stereo, 1536 kbps\n\n\nThis video has a no CMT logo.\n\n\n&quot;Do I&quot; is a song co-written and recorded by country music artist Luke Bryan. It is the lead-off single to his second studio album Doin' My Thing. Bryan co-wrote the song with Dave Haywood and Charles Kelley of the group Lady Antebellum, whose co-lead singer Hillary Scott is featured on background vocals.\n\n&quot;Do I&quot; debuted on the U.S. Billboard Hot Country Songs chart at #53 for the chart week of May 9, 2009. In November 2009, the song became his first Top 40 on the Billboard Hot 100. It peaked at #2 in November, where it remained for several weeks having been blocked from the Number One spot by Lady Antebellum's &quot;Need You Now.&quot;\n\nDoin' My Thing is the second studio album by American country music singer Luke Bryan. It was released on October 6, 2009 via Capitol Records Nashville. The album includes the single &quot;Do I,&quot; which has charted in the top 40 on the U.S. Billboard Hot Country Songs charts. Also included is a cover version of OneRepublic's &quot;Apologize.&quot; The album has sold 200,000 copies as of December 2009.\n\n&quot;Do I&quot; is the first single from the album. Bryan co-wrote this song with Charles Kelley and Dave Haywood of the group Lady Antebellum, whose lead singer Hillary Scott also sings background vocals on it. Also included is a cover version of OneRepublic's &quot;Apologize.&quot; Regarding the album's sound, Bryan told CMT, &quot;We wanted to make a bigger-sounding record, something that moved a little down the road from the first record. We wanted to show my growth vocally and lyrically.&quot;\n\nThomas Luther &quot;Luke&quot; Bryan (born July 17, 1976 in Leesburg, Georgia) is an American country music artist. He debuted in 2007 with the single &quot;All My Friends Say&quot;, a Top 5 single on the Billboard Hot Country Songs charts. His debut album, I'll Stay Me, was released on Capitol Records in 2007. This album also produced chart singles in &quot;We Rode in Trucks&quot; and &quot;Country Man&quot;. In addition to his own material, Bryan co-wrote Billy Currington's 2007 Number One hit &quot;Good Directions&quot; with the help of his distant cousin Skye Robinson. A fourth single, &quot;Do I&quot;, charted in early 2009 as the first single for his second album, Doin' My Thing.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:79535b109124f0dc1776730f69c97f543313881b","amp;dn":"Luke+Bryan+-+Do+I++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79535b109124f0dc1776730f69c97f543313881b","infoHashBuffer":{"type":"Buffer","data":[121,83,91,16,145,36,240,220,23,118,115,15,105,201,127,84,51,19,136,27]},"announce":[],"urlList":[]}}