{"title":"DEAD RISING 2: OFF THE RECORD - MARVEL - XBOX360 - REGION FREE {","uid":6726924,"size":6728528457,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:7953527fefb2cc1037f8406ce6457a7f3d370f64&amp;dn=DEAD+RISING+2%3A+OFF+THE+RECORD+-+MARVEL+-+XBOX360+-+REGION+FREE+%7B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"boobsman","files":71,"time":1317945677,"description":"LT1.9 REQUIRED!!!\nDO NOT PLAY THIS GAME UNLESS YOU HAVE UPDATED TO THE LATEST FIRMWARE!!!\nIF YOU ARE ASKED TO UPDATE AND YOUR NOT RUNNING LT1.9 STOP THE GAME!!!\n &lt;a href=&quot;\nhttp://www.pix2links.com/image/Oltc0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pix2links.com/image/Oltc0.jpg&lt;/a&gt;\n\nDead Rising 2: Off The Record, sees photojournalist and original hero of Dead Rising's Willamette incident, Frank West take centre stage as players experience a reimagining of the Fortune City outbreak. Forget what you know about Dead Rising 2, &quot;Frank West is back in the game!&quot;\n\nThe new, &quot;Off the Record&quot; storyline means an all new Dead Rising 2 experience. Frank will face off against more twisted enemies, build more outrageous combo weapons, follow his own unique mission structure and explore brand new areas of Fortune City to get his biggest scoop yet.\n\nFrank's come back means the return of his trusty camera, with players able to earn Prestige Points (PP) for specific photo opportunities that are graded against criteria such as horror, drama, erotica and brutality.\n\nIn addition to the new scenario and gameplay enhancements, Dead Rising 2: Off The Record offers a suite of technical updates including load time optimisations, improved network performance and a host of system upgrades to deliver a more satisfying Dead Rising experience.\n\nFrank West is back: The original Dead Rising hero returns to get the scoop on the Fortune City outbreak\n\nFortune City but not as you know it: Experience a re-interpretation of the Fortune City outbreak through the eyes and camera of photojournalist Frank West\n\nNew story and missions unique to Frank West\n\nNew environments\n\nNew enemies and more psychotic Psychos\n\nNew crazy and hilarious combo-weapons\n\nNew items and vehicles\n\nSay cheese! Capture those classic, violent, scary, hilarious Dead Rising moments, earn Prestige Points and complete all new missions with Frank's new and improved camera feature\n\nUpgraded experience: Full of technical improvements, system enhancements and feature upgrades to create a faster, smoother, more satisfying Dead Rising","torrent":{"xt":"urn:btih:7953527fefb2cc1037f8406ce6457a7f3d370f64","amp;dn":"DEAD+RISING+2%3A+OFF+THE+RECORD+-+MARVEL+-+XBOX360+-+REGION+FREE+%7B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7953527fefb2cc1037f8406ce6457a7f3d370f64","infoHashBuffer":{"type":"Buffer","data":[121,83,82,127,239,178,204,16,55,248,64,108,230,69,122,127,61,55,15,100]},"announce":[],"urlList":[]}}