{"title":"Primus - Animals Should Not Try To Act Like People DIVX MP3 PRO","uid":3389966,"size":2224120532,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:79578e2749f312fb37bac2fb0e87f55e1338deb6&amp;dn=Primus+-+Animals+Should+Not+Try+To+Act+Like+People+DIVX+MP3+PRO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"curtis_o2","files":51,"time":1128036291,"description":"Primus - Animals Should Not Try To Act Like People\n-----------------------------------------\nDVD/CD WITH ORIGINAL DRUMMER TIM ALEXANDER \nLes Claypool, Larry LaLonde and Tim Alexander are back as Primus. On October 7, Prawn Song/Interscope Records\n released &quot;Animals Should Not Try To Act Like People.&quot; This two disc package combines the long awaited career\n spanning Primus DVD, along with a CD containing 5 new songs. Listen to Pilcher's Squad now! \n\nOrders available now at www.clubbastardo.com/music.html. \n \n\nThe folks at Zoltron (in conjunction with the band) have pulled out all of the stops to create a \ncomprehensive 3+ hour DVD that will satisfy the most hardcore fans. It compiles all 12 of the Primus videos,\nincluding the rarely seen &quot;Too Many Puppies&quot; clip directed by Kevin Kerslake, the stop-motion animation \nclassic &quot;Southbound Pachyderm,&quot; and the innovative &quot;Wynona's Big Brown Beaver.&quot; \nAlso included are the award winning short animated film &quot;The Devil Went Down To Georgia&quot; and the out of \nprint 1992 home video release &quot;Cheesy Home Video.&quot; The DVD has short documentaries on the making of \n&quot;Mr. Krinkle&quot; and &quot;Wynona's&quot; as well as &quot;The Making of the Brown Album (Back In Brown),&quot; which have \nnever been seen before. \n\nLive performances on the DVD cover every single era of the band's career, from a 1989 college radio appearance, \nto Woodstock '94, to latter day shows with Brain (just to name a few). A rarities section even includes pre-Ler \nand Tim performances from the eighties with first guitarist Todd Huth, and drummers Jay Lane and Tim &quot;Curveball&quot; \nWright. \nAnd if that wasn't enough, there is still more: backstage footage, discography, a Primus photo gallery and more. \n\n&quot;It seems of late that bands are adding supplemental DVD material to their album releases to promote record sales.\n We've done the opposite. We've added a supplemental audio recording of brand new music to an extremely \ncomprehensive DVD of classic visuals. Also, we've enlisted the incredible talents of some local artists to create \na cutting edge, interactive interface,&quot; adds Claypool. \n\nPreviews of the DVD are available for viewing with the Primus Media Player, and through Rolling Stone Magazine.\n \n\nIn June, three old friends reconvened at Rancho Relaxo and recorded 5 new songs. Some of these musical ideas were \ngenerated in May in LA, when Les Claypool, Larry Lalonde and Tim Alexander (don't call him &quot;Herb&quot;) first got back \ntogether and spent 3 days jamming, testing the waters, feeling each other out and working on new jams. \nListen to audio clips of the new songs:\n\n \n\n \nhttp://www.primusville.com/frames/ftour.html\n\n\nhttp://www.primusville.com/\nhttp://www.primusville.com/home/home.html\nhttp://www.primusville.com/frames/fmutation.html\n\nOK Heres the deal. We were making a menu, like the original dvd's menu to point to these DIVX files, but it \nwasnt working well:(. We had discussed making a menu fom HTML, JAVA, And flash, but dont think you would use it, \nso we just arent gonna do it. Instead, here are the files,\nVideo ripped in DIVX home theatre quality\nAudio ripped in Nero MP3 Pro @ 128 kb/sec.\nThe original menu system was really cool, and we dont yet possess the skill to do it justice.\nEnjoy, and if you request the full size dvd with menus, we will post it, otherwise we wont. PM joe, or comment requesting,\nand they will be posted, but the original dvd is a HUGE file(7.69 GB).\nMuch Love,\nJoe Schmoe\n----AND----\nEugene Blakeley, interstellar Communications.","torrent":{"xt":"urn:btih:79578e2749f312fb37bac2fb0e87f55e1338deb6","amp;dn":"Primus+-+Animals+Should+Not+Try+To+Act+Like+People+DIVX+MP3+PRO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79578e2749f312fb37bac2fb0e87f55e1338deb6","infoHashBuffer":{"type":"Buffer","data":[121,87,142,39,73,243,18,251,55,186,194,251,14,135,245,94,19,56,222,182]},"announce":[],"urlList":[]}}