{"title":"RealPlayer Plus 15.0.6.14 + Activator[NepsterJay]","uid":7518481,"size":27857177,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:798667c50a347da91da8a9b8ed978e010d499ef6&amp;dn=RealPlayer+Plus+15.0.6.14+%2B+Activator%5BNepsterJay%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NepsterJay","files":1,"time":1344545659,"description":"RealPlayer Plus 15 - quite popular audio and video player. The player is integrated with the Web portal RealNetwork, which allows the user to be aware of all the events broadcast over the Internet. RealPlayer in the first place was created to clearly, correctly and properly play streaming audio and video, that is, the data transmitted over the Internet. For RealPlayer there is virtually no unfamiliar formats, including streaming. Plays all major media formats including QuickTime, MPEG-4, Windows Media, DVD and CD. With RealPlayer you can tune in to more than 3,200 radio stations broadcasting online. \n\nRealPlayer has a special media browser, built on the engine, known browser IE, it is convenient to perform movements while playing multimedia files. Built a good play list editor, you can use ready-made visualizations, you can put the continuous playback mode, you can create bookmarks for your favorite files, there is a good equalizer, you can record audio CDs, and other others. \n\nThe main properties of Real Player Plus: \n- Media browser engine to Internet Explorer, to navigate during playback of multimedia. \n- Editor playlists RealPlayer, which supports the function &quot;Drag and drop&quot; and play files in random order. \n- Visualizations - graphical animations or &quot;light show&quot;. \n- Continuous playback of one song. \n- Bookmarks for your favorite files and streams. \n- Control of the equalizer RealPlayer and video playback. \n- Media Library, which helps organize the files by tags. Editing tags. \n- Buffering the video stream even in pause mode. \n- Burn audio CD and CD-ROMs with the data. \n- Record audio from a CD (ripping). \n- Download video. RealPlayer can download videos from sites like YouTube and save them on your computer. \n- Support for plug-ins. \n- Ability to download music to portable devices. \n\nInformation about the program \nTitle: RealPlayer Plus \nVersion: 15.0.6.14 \nYear: 2012 \nPlatform: Windows XP/Vista/7 \nLanguage: english ","torrent":{"xt":"urn:btih:798667c50a347da91da8a9b8ed978e010d499ef6","amp;dn":"RealPlayer+Plus+15.0.6.14+%2B+Activator%5BNepsterJay%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"798667c50a347da91da8a9b8ed978e010d499ef6","infoHashBuffer":{"type":"Buffer","data":[121,134,103,197,10,52,125,169,29,168,169,184,237,151,142,1,13,73,158,246]},"announce":[],"urlList":[]}}