{"title":"MechoEcho (GOG)","uid":14648077,"size":309023722,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:79de61cc7d38583fe6bb956071b1a44db33de65a&amp;dn=MechoEcho+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":2,"time":1463608273,"description":"Install instructions:\r\n- Run &quot;setup_mechoecho_2.0.0.2.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: MECHOECHO\r\nGenre: Strategy - Puzzle - Sci-fi\r\nWorks on: Windows (7, 8, 10)\r\nLanguages: Audio and text: English\r\nFeatures: single-player\r\nReleased: May 18, 2016\r\nSize: 310 MB\r\nCompany: Resilient Games Ltd. / Resilient Games Ltd.\r\nStore page: https://www.gog.com/game/mechoecho\r\n\r\nAbout:\r\nBuild and drive robots to solve the 3D puzzles in each of the 30 levels and Sandbox. Enter MechoEcho, an ethereal cyberpunk world where all that stands between you and peril is your own ingenuity. Use blocks, engines, and an array of tools to invent and build wildly creative machines. Pilot them to overcome obstacles as you search for the ultimate solution that can save you and all of humanity!\r\nMechoEcho is a block construction game and an accurate physics simulator. You’ll transform from human to machine and back as you explore the shadowy cyberdeco setting with sheer drops, a pulsing soundtrack, and strange creatures out to destroy you.\r\nThe customized physics engine is highly accurate which makes driving fun and easy. Go from beginner to master as the carefully crafted difficulty curve takes you to the crazy hard final levels. The addictive, challenging puzzles will inspire you to dream up ever more creative machines.\r\nIn this cyberpunk fable, you awaken in a mysterious computer simulation after having witnessed the end of the world. Neither human nor machine, you carry the scars of the last days of humanity, and the mistakes you struggle to unmake.\r\nThe past and present stories of Echo and her creation unfold in pieces and memories that weave together a tale of lost hope, escape, and possibly redemption. In the end, the fate of humanity is up to you.\r\nBuild, Drive, and Solve the Puzzles – You build machines to overcome any obstacle in your way, and pilot them to safety as you solve the 3D puzzles in each level.\r\nEndless Creativity and Sandbox – There’s no one solution to any problem, construct anything you can imagine. In the Sandbox, challenge your engineering skills at building robots with no limits!\r\nMesmerizing Atmosphere – Lose yourself in the haunting electronic music, stunning art deco visuals, enigmatic characters, and compelling storyline.\r\n\r\nMinimum system requirements - Windows: 7 / 8 / 10 \r\nProcessor: Dual Core 1.5 Ghz \r\nMemory: 1 GB RAM \r\nGraphics: NVIDIA GeForce GTX 460, AMD Radeon HD 5770\r\nDirectX: Version 11 \r\nStorage: 2 GB available space \r\nMouse, Keyboard \r\n\r\nAdditional Notes: The game requires at least a DirectX 11 Graphics Card with Shader Model 4.0. \r\nIntel integrated graphics cards are not supported\r\nRecommended system requirements - Windows: 7 / 8 / 10 \r\nProcessor: Dual Core 2.0 Ghz \r\nMemory: 1 GB RAM \r\nGraphics: NVIDIA GeForce GTX 660, AMD Radeon HD 7850 \r\nDirectX: Version 11 \r\nStorage: 2 GB available space \r\nMouse, Keyboard","torrent":{"xt":"urn:btih:79de61cc7d38583fe6bb956071b1a44db33de65a","amp;dn":"MechoEcho+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79de61cc7d38583fe6bb956071b1a44db33de65a","infoHashBuffer":{"type":"Buffer","data":[121,222,97,204,125,56,88,63,230,187,149,96,113,177,164,77,179,61,230,90]},"announce":[],"urlList":[]}}