{"title":"Elvis Presley As recorded in stereo 57 vol 1 Jan 19,1957 flac","uid":9181201,"size":367659825,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7a112a78113b4bc966f2e8645ce8471d2156b558&amp;dn=Elvis+Presley+As+recorded+in+stereo+57+vol+1+Jan+19%2C1957+flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"mileyc.rox","files":7,"time":1384227362,"description":"\nIt is no secret (# 1-13)\nBlueberry hill (# 1-9)\nHave I told you lately that I love you (# 1-15)\nIt is so strange (# 1-12)\n\nJanuary 1957 was a busy month for Elvis Presley. Besides his national TV appearance on the Ed Sullivan program, he undertook over half a dozen soundtrack sessions for his second film &quot;Loving You&quot; and a couple of studio sessions proper. In almost every instance, Presley's ability to craft timeless performances shines through. If Elvis dominated 1956, he turned up the heat in 1957.\n\nThis disc presents virtually all of the studio session held at Radio Recorders in Los Angeles, California on January 19, 1957, from the dry (no reverb added to the voice or instruments), binaural (two track stereo) safety tape. On this day four tunes were recorded, three pop numbers and one gospel (basically finishing up what would be two EP's, one pop and one gospel, released in April). The Radio Recorders building is still around, sitting on Santa Monica Boulevard, and looks like a little cottage house -- it's hard to believe so much great music was made there (Elvis and otherwise). The 1997 re-release also includes seven gorgeous, previously unpublished, full-color shots taken in April, 1957.\n\nThe tapes made up part of the superb 'Stereo '57 (Essential Elvis, Vol. 2)' release from RCA/BMG about ten years ago, but here the listener gets it all, a fly-on-the-wall perspective of the recording session. The sound quality is a notch or two below the official binaural album, but it's not very noticeable. Unfortunately, the various takes aren't separated on the disc, so one has to be prepared to plough through, for example, 23 minutes of &quot;It Is No Secret&quot; to hear a favorite moment! It's a single session, over 50 takes, four tracks.\n\nThere's plenty of interesting alternates, some still not officially released, including early, more deliberate takes of &quot;Blueberry Hill&quot; (Elvis sings with a Fats-like drawl, D.J. slams down hard on the snare, stripper-style) and magnificent, otherworldly renditions of &quot;Is It So Strange&quot;, a Faron Young song that is one of Elvis' greatest-ever ballads (though hardly written about by critics). In between is a lot of laughter (especially on &quot;Is It So Strange&quot;, he can't seem to get through a take without busting up) and good feeling. During take one of &quot;Have I Told You Lately That I Love You&quot; Elvis dumps his back-of-the-guitar percussion (a la &quot;Don't Be Cruel&quot;) for handclaps on take two, then returns to guitar-as-percussion for the following take. Throughout the session black piano playing newcomer (this is one of his first Elvis sessions) Dudley Brooks shines, his rapport with Elvis as good as Scotty, Bill and D.J.'s. Here we have the quintessential, classic rock and roll band, one which all others must measure up to.\n\nLike &quot;Let Me&quot; on the awesome 1997 RCA/BMG 'Jailhouse Rock' reissue, one can focus on Elvis' voice since it's almost completely isolated on one of the two stereo tracks. It's an uncommon priviledge to feel as if you're right next to him as he sings. There are also some strange, unexpected moments, like when you hear an engineer inadvertently comment onto the recording tape about a &quot;cold chill&quot; at 10:48 of &quot;It Is No Secret&quot;, Elvis saying &quot;Aww, shit&quot; at the end of a take of &quot;Have I Told You Lately That I Love You&quot; (10:31 into the track) or a five second, Nixonian tape gap (11:26-11:33) during take ten of &quot;Is It So Strange&quot;.\n\nAt this point in his life, Elvis really enjoyed the recording process. It's quite clear that Steve Sholes is producer in name only -- Elvis calls out every arrangement, tells engineer Thorne Nogar to cut takes short (&quot;naw -- play that back, Thorny, and let us just see ...&quot;) and runs the show, as he had since the previous July in New York (to record &quot;Hound Dog&quot;, &quot;Don't Be Cruel&quot; and &quot;Any Way You Want Me&quot;). To be privy to such a magnificent artist at his best (and only 22 years old!) makes this disc absolutely essential. ","torrent":{"xt":"urn:btih:7a112a78113b4bc966f2e8645ce8471d2156b558","amp;dn":"Elvis+Presley+As+recorded+in+stereo+57+vol+1+Jan+19%2C1957+flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a112a78113b4bc966f2e8645ce8471d2156b558","infoHashBuffer":{"type":"Buffer","data":[122,17,42,120,17,59,75,201,102,242,232,100,92,232,71,29,33,86,181,88]},"announce":[],"urlList":[]}}