{"title":"Titan.Quest.Immortal.Throne-Unleashed","uid":6786319,"size":2266712572,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7a9804d8df66ceafb30c28be823f228c821951fb&amp;dn=Titan.Quest.Immortal.Throne-Unleashed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Totenkruez","files":-1,"time":1320102445,"description":"Titan Quest: Immortal Throne is the action-packed expansion to the 2006 \n   RPG hit, Titan Quest. Brian Sullivan, award-winning co-creator of Age of \n   Empires and Titan Quest, continues the epic story across the dark and \n   more sinister Underworld of Hades. In this epic quest of good versus \n   evil, players will encounter the greatest villains of Greek mythology, \n   brave the attacks of Cerberus, and hazard the banks of the River Styx.\n   \n   Along with new foes, players will find new allies. Players will \n   interpret the prophecies of the blind seer Tiresias, fight alongside \n   Agamemnon and Achilles, and use the wiles of Odysseus to defeat powerful \n   enemies.\n   \n   \n   10 Additional Character Levels - allows players to bring existing and \n   new characters to new heights, along with higher level equipment and \n   skills \n   \n   8 New Character Classes - The expansion pack features an entirely new \n   skill mastery, which combines with existing skill masteries to create \n   eight new exciting character classes. \n   \n   New Exotic Monsters and Locations - Quest through exotic locations in \n   the Mediterranean area and ultimately descend across the river Styx into \n   the heart of Hades. Defeat terrifying new monsters on your way to \n   victory! \n   \n   Artifacts - A new type of rare equipment with a new slot on the \n   character interface gives the player character a powerful bonus. \n   \n   Enchanters - A new type of NPC character that can create artifacts from \n   recipes. \n   \n   Caravans - Traveling NPCs will meet you in major cites throughout the \n   ancient world, storing your most precious goods, and allowing you to \n   transfer them between your characters \n   \n   More Unique Equipment - Uncover hundreds of powerful new unique items as \n   you quest through the Underworld of Hades.\n","torrent":{"xt":"urn:btih:7a9804d8df66ceafb30c28be823f228c821951fb","amp;dn":"Titan.Quest.Immortal.Throne-Unleashed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a9804d8df66ceafb30c28be823f228c821951fb","infoHashBuffer":{"type":"Buffer","data":[122,152,4,216,223,102,206,175,179,12,40,190,130,63,34,140,130,25,81,251]},"announce":[],"urlList":[]}}