{"title":"Beethoven - Complete Piano Sonatas - Richard Goode","uid":4560401,"size":1693730793,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7aa635e32517de7c67316bc6e561a03159e7612f&amp;dn=Beethoven+-+Complete+Piano+Sonatas+-+Richard+Goode&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eddie1969","files":21,"time":1228659479,"description":"I had been searching for a good complete set of Beethoven's piano sonatas for quite a while, and believe I have found a brilliant one in this set. It is great for those wishing to survey Beethoven's music in the most complete way possible, and for studying how the form of his sonatas changed and developed in a way only a genius like Beethoven could have achieved. \n\nRichard Goode's playing throughout is flawless, giving a very accurate and great-to-listen-to set of some of the most amazing works ever. His sound is very pleasant, and his interpretation very precise and not overdone. The sound quality is also quite excellent; with a good stereo you can make it sound like you are sitting right there watching and listening to him play. \n\nAll of his interpretations are very accurate. After reading along with the music as he played I found that his interpretive choices and his phrasing authentically reflect Beethoven's original score. \n\nTo sum it all up: this is an excellent set of Beethoven's piano sonatas. The playing is perfect, the sound quality pristine, and the interpretation very exact and fitting. This is a great set that I would recommend to any serious classical music lover.","torrent":{"xt":"urn:btih:7aa635e32517de7c67316bc6e561a03159e7612f","amp;dn":"Beethoven+-+Complete+Piano+Sonatas+-+Richard+Goode","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aa635e32517de7c67316bc6e561a03159e7612f","infoHashBuffer":{"type":"Buffer","data":[122,166,53,227,37,23,222,124,103,49,107,198,229,97,160,49,89,231,97,47]},"announce":[],"urlList":[]}}