{"title":"Wolverine &amp; Jean Grey (Fan Art)","uid":7971853,"size":1682243,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7b5fe9cc63fc390bd31c4d979c5627349c4654df&amp;dn=Wolverine+%26amp%3B+Jean+Grey+%28Fan+Art%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rackemup420","files":1,"time":1356873664,"description":"This was a picture my brother-in-law drew for me last night. I was always a fan of Wolverine, Jean's &amp; Gambits little love triangle, although Wolverine and Jean really never took it anywhere, this is what would have happened.\n\nArtist: Lun\n\nYou can check him out at:\n\nBiography (From Lun Himself)\nHello!! I'm Lun. I was born in Cameroon, Africa. I grew up there with my family, and I had awesome friends, went to school, wrestled lions ... no, scratch that last part. Anyway, I graduated from the Governmental Technical High School with a diploma in Electro-Technical engineering, which basically means that I am trained in the production, transport, and distribution of electricity (Distribution differs between residential, industrial, or others such as hospitals ...) But also in the usage and maintenance of electrical engines and automated machines. I've also been trained in Electronics.\n\nAfter graduating from high school, I bid Africa farewell and said hello to the U.S.. Here, I studied computer science with emphasis on programming. The main programming languages I learned to use are: Turbo Pascal (which is quite ancient), Visual Basic (VB.NET), Java, and C++.\nI also took web-design classes, where I learned how to use Dreamweaver to build web site, write in html, php, and XML codes, and also use SQL/mySQL databases.\n\nRight now I'm pursuing a Bachelor in Science. It's tough but I'm hanging in there.\n\nIn my spare time, I like to read, write, and draw. You can check out some of my drawings in my photo album. Some of them I did by hand, while others (like the cover for my book,) I drew on Photoshop. (Photoshop, Fireworks, Indesign, and Illustrator are some of my favorite programs--I use Illustrator especially when I'm making logos.) ","torrent":{"xt":"urn:btih:7b5fe9cc63fc390bd31c4d979c5627349c4654df","amp;dn":"Wolverine+%26amp%3B+Jean+Grey+%28Fan+Art%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b5fe9cc63fc390bd31c4d979c5627349c4654df","infoHashBuffer":{"type":"Buffer","data":[123,95,233,204,99,252,57,11,211,28,77,151,156,86,39,52,156,70,84,223]},"announce":[],"urlList":[]}}