{"title":"THE.DARK.BACKWARD.1991.XVID-CG.avi","uid":5230097,"size":733531862,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7c5ac702d5b740f9ac061753203946de7fc7653c&amp;dn=THE.DARK.BACKWARD.1991.XVID-CG.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sharpsponge","files":1,"time":1261297581,"description":"THE DARK BACKWARD (1991) DVDRIP\nStarring Judd Nelson, Rob Lowe, Lara Flynn Boyle and Bill Paxton\n\n.... This is my first torrent upload so bear with me if I have trouble seeding it right away ... I'm still trying to figure this out.\n\n\nIMDB  4.3/10 out of 1,667 votes  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0101660/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0101660/&lt;/a&gt;\n\nSynopsis: A man pursues stand-up comedy encouraged by his fellow garbage man. Though his friend, who accompanies him on accordion, continues to tell him how great he is, he actually stinks. When the &quot;comedian&quot; grows a third arm out of his back, the friend uses this twist to get him signed up with a sleazy talent agent, and it begins to look like his career is on the move, even though his girlfriend has left him.\n\n\n\nAmazon 4 out of 5 stars / 31 customer reviews\n\nSynopsis: Further riffing on the trashy settings made popular by Repo Man and Street Trash in cult cinema, The Dark Backward stars two garbage men whose attempts at celebrity land them in even more pathetic territory. Director Adam Rifkin's (Detroit Rock City) first film, The Dark Backward, makes revolting comedy out of its carnivalesque plot, in which Marty Malt (Judd Nelson), a garbage man turned second-rate comedian grows an arm out of his back, thereby guaranteeing him a space in show business for freak show inflected stand-up comedy appearances. Cohort, Gus (Bill Paxton), meanwhile, secures him a Vegas-style talent agent, Jackie Chrome (Wayne Newton), who eventually rounds up real attention from bigwig Hollywood man, Dirk Delta (Rob Lowe). The fabulously raunchy, John Waters-inspired characters are what rescue this film from utter stupidity. Marty is the consummate spectacle-sporting nerd, as is Dirk Delta, who wears buckteeth to up the sleaze factor, offering a rare glimpse of two Brat Pack studs degraded to abnormal levels. Gus, the accordion-wielding confidant, masters several key scenes in which he licks a corpse at the local dump and eats rotten chicken. Occasionally, Marty's fling, Rosalita (Lara Flynn Boyle), provides visual respite for this otherwise stupendously dirty film. Comedy of this variety is scarce, making this DVD a treasure to those who find abjection hilarious. Additionally, The Dark Backward special edition disc contains &quot;Blump's Squeezable Documentary,&quot; starring Rifkin and cast reminiscing about the making of this unusual gem.\n\nEnjoy! \n\n{sharpsponge}","torrent":{"xt":"urn:btih:7c5ac702d5b740f9ac061753203946de7fc7653c","amp;dn":"THE.DARK.BACKWARD.1991.XVID-CG.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c5ac702d5b740f9ac061753203946de7fc7653c","infoHashBuffer":{"type":"Buffer","data":[124,90,199,2,213,183,64,249,172,6,23,83,32,57,70,222,127,199,101,60]},"announce":[],"urlList":[]}}