{"title":"la ilusion viaja en tranvia - bunuel","uid":4109583,"size":256502649,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:7d190cb1df3d2a3083542f37231268175d10214d&amp;dn=la+ilusion+viaja+en+tranvia+-+bunuel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cesarth","files":1,"time":1206987353,"description":"Sinopsis:\nAl enterarse que el tranvia 133, en el cual han trabajado toda su vida, sera retirado de servicio, Caireles y Tarrajas se emborrachan y deciden robarlo. Durante la noche dan servicio a un grupo eclectico de pasajeros que incluye a un catrin, un par de beatas, un profesor con sus alumnos y unos matanceros del rastro. A la manana siguiente, Caireles y Tarrajas tratan de devolver el tranvia pero se enfrentan a la obstinacion de Papa Pinillos, un inspector jubilado que pretende delatarlos.\n\n\nComentario:\nSin lugar a dudas, la comedia fue uno de los generos que Luis Bunuel cultivo con mayor placer a lo largo de su carrera. Poseedor de un agudo sentido del humor y de una gran capacidad para la ironia, Bunuel encontro en la comedia el genero propicio para desplegar su muy particular vision del mundo, en la que el absurdo y la casualidad coexisten con la normalidad cotidiana.\n\nEn La ilusion viaja en tranvia lo inverosimil irrumpe constantemente en la vida de los personajes, sin que esto conduzca a la alteracion definitiva de sus destinos. El trayecto que sigue el tranvia robado por Caireles y Tarrajas esta lleno de incidentes divertidos e insolitos que Bunuel siempre considero naturales en el contexto mexicano:\n\n&quot;Ustedes saben que en los vehiculos publicos en Mexico es posible, o lo era en aquella epoca, encontrar gente que lleva cajones de fruta, o guajolotes vivos, en fin: las cosas mas increibles, y por eso se me ocurrio que en el tranvia viajaran los obreros del Rastro con los cuartos de res, y las viejas beatas con la imagen de un santo.&quot; \n\nA partir de una escueta linea argumental desarrollada por Mauricio de la Serna y Jose Revueltas, Bunuel desarrollo una pelicula-viaje al estilo de Subida al cielo (1951). La similitud entre ambos filmes va mas alla de su linea argumental. &quot;Es cierto que en ambas peliculas aparece Lilia Prado haciendo el mismo gesto de subirse al transporte, con un pie en el estribo y la falda a medio muslo&quot; dice Bunuel. &quot;Reconozco que aqui se trata de algo muy mio, de mi juventud y de la de cualquiera de mi generacion. Cuando las mujeres, con aquellas faldas largas, subian al tranvia, le echabamos la vista, para ver si ensenaban algo de pantorrilla. Claro, en las dos peliculas la falda es mas corta, y por fuerza Lilia muestra algo de los muslos. Son gestos que se graban.&quot;\n\nA diferencia de Subida al cielo (1951), La ilusion viaja en tranvia proyecta una sensualidad mas sutil y sugerente. Los trozos de carne que suben los carniceros al tranvia recuerdan al sueno de Pedro en Los olvidados (1950), en el que su madre le ofrece un bistec sangrante que le es arrebatado por el Jaibo. En la pastorela, Lilia Prado interpreta a una seductora Eva expulsada del paraiso por pecadora. En el tranvia, un nino ve por la ventanilla a una mujer que se arregla las medias a la vista de todos.\n\nConsidera por mucho tiempo como una pelicula menor en la filmografia de Luis Bunuel, La ilusion viaja en tranvia ha conservado su particular encanto con el paso de los anos y ha logrado superar el &quot;envejecimiento&quot; al que se ven condenadas muchas peliculas. Realizada sin grandes pretensiones artisticas, esta cinta sigue siendo hoy tan disfrutable como cuando fue estrenada.\n\n\nUna produccion de: \t\nClasa Films Mundiales \n\nGenero: \t\nComedia urbana \n\nDuracion: \t\n90 min. \n\nSonido: \t\nMonoaural \n\nDireccion: \t\nLuis Bunuel \n\nAsistente de Direccion: \t\nIgnacio Villarreal \n\nProduccion: \t\nArmando Orive Alba; productor ejecutivo: Juan Ramon Aguirre; jefe de produccion: Fidel Pizarro; productor asociado: Mauricio de la Serna \n\nGuion: \t\nMauricio de la Serna; adaptacion: Jose Revueltas, Mauricio de la Serna, Luis Alcoriza y Juan de la Cabada \n\nFotografia: \t\nRaul Martinez Solares \n\nEscenografia: \t\nEdward Fitzgerald \n\nMaquillaje: \t\nElda Loza \n\nEdicion: \t\nJorge Bustos y Luis Bunuel (sin credito) \n\nSonido: \t\nJose de Perez, Rafael Ruiz Esparza y Teodulo Bustos \n\nMusica: \t\nLuis Hernandez Breton \n\n\nReparto: \nLilia Prado \t\n.... \t\nLupita \n\nCarlos Navarro \t\n.... \t\nJuan Caireles \n\nFernando Soto &quot;Mantequilla&quot; \t\n.... \t\nTarrajas \n\nAgustin Isunza \t\n.... \t\nPapa Pinillos \n\nMiguel Manzano \t\n.... \t\ndon Manuel, gerente de la compania \n\nGuillermo Bravo Sosa \t\n.... \t\nBraulio \n\nJose Pidal \t\n.... \t\nprofesor \n\nFelipe Montoya \t\n.... \t\nmecanico \n\nJavier de la Parra \t\n.... \t\njefe de trafico \n\nPaz Villegas \t\n.... \t\ndona Mechita \n\nConchita Gentil Arcos \t\n.... \t\npasajera beata \n\nDiana Ochoa \t\n.... \t\notra pasajera beata \n\nVictor Alcocer \t\n.... \t\ntrinquetero \n\nJose Chavez Trowe \t\n.... \t\nagente de transito \n\nAgustin Salmon \t\n.... \t\nempleado \n\nManuel Noriega \t\n.... \t\ndon Julio \n\nRoberto Meyer \t\n.... \t\ndon Arcadio \n\nJose Luis Moreno \t\n.... \t\nescolar \n\nHernan Vera \t\n.... \t\nmatancero \n\nVictorio Blanco \t\n.... \t\npasajero \n\nPepe Martinez \t\n.... \t\nDuque de Otranto \n\nManuel Vergara &quot;Manver&quot; \t\n.... \t\nmatancero \n\nJose Munoz \t\n\t\n\n\nMario Valdes \t\n\t\n\n\n\n","torrent":{"xt":"urn:btih:7d190cb1df3d2a3083542f37231268175d10214d","amp;dn":"la+ilusion+viaja+en+tranvia+-+bunuel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d190cb1df3d2a3083542f37231268175d10214d","infoHashBuffer":{"type":"Buffer","data":[125,25,12,177,223,61,42,48,131,84,47,55,35,18,104,23,93,16,33,77]},"announce":[],"urlList":[]}}