{"title":"Trivia Crack (Ad free) v2.5.1","uid":13106953,"size":63399971,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:7db1855a9ca03a458023447d65c23c1dbb77ef90&amp;dn=Trivia+Crack+%28Ad+free%29+v2.5.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1451323406,"description":"\n\r\nTrivia Crack is the international smash hit game that pits friend against friend in different categories to determine who has the most trivia knowledge. Each of the six categories (Science, Entertainment, Art, Geography, Sports and History) has a corresponding character, and the game is won by being the first to obtain all six. Give Willy the Wheel a spin and let chance decide which category you get!\r\n\r\nStuck on a particular question? You still have a chance! Trivia Crack is a game of strategy. Earn coins throughout the game to get special advantages such as PowerUps and extra spins which you can use to gain the upper hand over your opponents. Or face off against them and steal their characters!\r\n\r\nIt’s no coincidence Trivia Crack is the #1 trivia game in the US and Canada. This game is truly one-of-a-kind. With over 100 thousand questions and constant updates, Trivia Crack never gets old. Upload your own user-created questions, or translate and rate those of other users and join the Trivia Crack community!\r\n\r\nFrom the moment you start playing Trivia Crack, you’ll notice the bright, sophisticated and intuitive interface. With lively animations at every step, the characters have a life of their own!\r\n\r\nTrivia Crack is currently available in English , Spanish, French, German, Italian, Portuguese, Catalan, Russian, Japanese, Dutch, Chinese, Swedish, Norwegian, Finnish, Danish, Greek, Turkish and Korean. New languages added regularly!\r\n\r\nSo what are you waiting for? Download Trivia Crack now, put your knowledge to the test and begin challenging your friends!\r\n\r\nHighlights:\r\n◉ Put your knowledge to the test\r\n◉ Combine wit and strategy\r\n◉ Dare your friends to a challenge\r\n◉ Chat live with friends and opponents\r\n◉ Share your achievements\r\n◉ Suggest, rate and translate questions\r\n\r\nWHAT'S NEW \r\n◉ Performance improvements\r\n◉ User interface improvements\r\n◉ Bug fixes \r\n\r\nThis is a FREE game but it is modded without ads\r\nRequired Android O/S : Varies with device","torrent":{"xt":"urn:btih:7db1855a9ca03a458023447d65c23c1dbb77ef90","amp;dn":"Trivia+Crack+%28Ad+free%29+v2.5.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7db1855a9ca03a458023447d65c23c1dbb77ef90","infoHashBuffer":{"type":"Buffer","data":[125,177,133,90,156,160,58,69,128,35,68,125,101,194,60,29,187,119,239,144]},"announce":[],"urlList":[]}}