{"title":"Eleni Mandell - Country For True Lovers [2003][EAC,log,cue. FLAC","uid":8258830,"size":251518460,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e19fdf33671650c8db02b61cdf77ea9848a15df&amp;dn=Eleni+Mandell+-+Country+For+True+Lovers+%5B2003%5D%5BEAC%2Clog%2Ccue.+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dickspic","files":16,"time":1363326880,"description":"Artist: Eleni Mandell\nRelease: Country For True Lovers\nDiscogs: 2909555\nReleased: 2003\nLabel: Zedtone\nCatalog#: ZED-003\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Canada\nStyle: Folk, World, &amp; Country, Rock, Alternative Rock, Country, Indie Rock, Folk, Country Rock\n\nTracklisting:\n\n01. Another Lonely Heart\n02. Don't Say You Care\n03. I've Got A Tender Heart\n04. It's Raining\n05. Kingsport Town\n06. Tell Me Twice\n07. Refrain\n08. Iowa City\n09. You're All Bad (and That's Why You've Been Invited)\n10. Don't Touch Me\n11. Home\n12. Blue Ribbon Eyes\n\nEleni Mandell takes a different approach with this album, offering up a batch of gin-soaked, traditional honky tonk numbers that bring to mind previous singers like Brenda Lee, Connie Francis, and Patsy Cline. The introductory &quot;Another Lonely Heart&quot; has the singer giving a credible performance that nails each tear-at-your-heartstrings note. Greg Leisz has an important part on the song with a great pedal steel guitar solo, but it's the mix of whispery jazz and country that Mandell excels at. &quot;Don't Say You Care&quot; falls along the same vein, with the slow and mournful melody carrying the song. &quot;Refrain&quot; is another quality performance, as Mandell does her best rendition of a tune screaming to be performed at Nashville's Ryman Auditorium. An interesting cover is Merle Haggard's &quot;I've Got a Tender Heart,&quot; which has a definitive upbeat swing. &quot;I'll get over you and make a brand new start,&quot; she sings behind a stellar cast of supporting musicians. The flow each song has can't be underestimated, giving each a timeless quality. A departure from the country mold is the blues-tinged &quot;It's Raining,&quot; a number that seems a bit out of place here. One of the album's high points is the sparse yet cozy Celtic folk feeling on &quot;Kingsport Town,&quot; a tune that predominantly resembles Cowboy Junkies. &quot;You're All Bad (And That's Why You've Been Invited!)&quot; is a tad wordy in places, but it has a punchy, bouncy Bonnie Raitt quality that works. &quot;Home&quot; consists of just vocal, acoustic guitar, and pretty backing harmonies that could be mistaken for Alison Krauss, except for the French verse. Overall, it's an album well worthy of its title.","torrent":{"xt":"urn:btih:7e19fdf33671650c8db02b61cdf77ea9848a15df","amp;dn":"Eleni+Mandell+-+Country+For+True+Lovers+%5B2003%5D%5BEAC%2Clog%2Ccue.+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e19fdf33671650c8db02b61cdf77ea9848a15df","infoHashBuffer":{"type":"Buffer","data":[126,25,253,243,54,113,101,12,141,176,43,97,205,247,126,169,132,138,21,223]},"announce":[],"urlList":[]}}