{"title":"Imperial Struggles","uid":11534090,"size":517620007,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7e4a878af9a2794963ac5c7bf56d95a6bfb4e208&amp;dn=Imperial+Struggles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hokaydo","files":-1,"time":1416608563,"description":"# Creator:Jukov (modification over mod Imperial Rivalries\n# Year: 2014\n# Pictures from the game:[url=http://img.zamunda.net/bitbucket/high%20bulg.jpg]1[/url] [url=http://img.zamunda.net/bitbucket/Iberia.jpg]2[/url] [url=http://img.zamunda.net/bitbucket/Constantinopol.jpg]3[/url] [url=http://img.zamunda.net/bitbucket/rev%20russia.jpg]4[/url] [url=http://img.zamunda.net/bitbucket/third%20reih.jpg]5[/url] [url=http://img.zamunda.net/bitbucket/Late%20bulg.jpg]6[/url]\n# Genre: Global Strategy\n# Similar Games: [url=http://thepiratebay.se/torrent/3797055/Europa_Universalis_III]Europa Universalis III[/url], Europa Universalis III:The Nomads, The Golden Age, Europa Universalis III:The Hurricane\n\n## Description: &quot;Imperial Struggles&quot; puts in your hands the absolute power over a state on your choice - from the Egypt which is hidden under the Pyramids shadow to the small nomadic tribe of Torkils. The choice is so wide that this game could be easily classified as interactive encyclopaedia. The time frame within you can exercise your Imperial power is for more then 6000 years - from 4000 BC up to 2010 AD.\n\nYour Absolute power will often collide with antagonist powers. As it is in any royal court there are always dissatisfied factions with your decisions and in &quot;Imperial Struggles&quot; the factions are 4: Clergy Faction, Peasants Faction/ Lesser Nobility Faction and Court Faction. In the beginning of each game you would be asked to chose the mode of the game - weather to play with turned on/off faction system.\n\nYou would be able to see the rise and fall of aggressive tribes and empires, the silent existence of local rulers and the skilful manoeuvres of great diplomats. Lurching in any direction would be disastrous - too large army, would drag your treasury to the abyss of bankruptcy, leading you to countless revolts, hungry peasants and discontent Clergy. On the other site the bags full of gold can't stop the Barbarian Hordes and to turn them out from your prosperous realm, contrary as much gold you have as more rivals there will rise for it. In other situations the best strategy would be to create an alliances through dynastic marriages, trade agreements and military access.\n\nNo matter what strategy you are using, this game would let you to rewrite the history in version that suits you. It all depend on you if the story would be short overture or an epic saga as Iliad!\n\nMore about game details - &quot;Imperial Struggles&quot; is long term project, based over series of mods over Europa Universalis III. The project begins as small scale mod just to evolve into more then 8 grand scale mods, one of which producing navigable rivers which are copied by the original developer of EU. The cherry of the cake in this game are the sprites (models) of the soldiers, which lets our eyes taste from the different graphic in more then 17 historical ages. The game is happening on interactive map of the World - we didn't forget not only the most distant colonies in South and North America, Africa or Australia, but also the &quot;old World&quot;. The map of this game replaces entirely the original map with special attention over Europe, Middle East and Naval provinces.\n\nThe game includes not only the classic period of Medieval and Renaissance, but also Antiquity is added - Ancient Egypt, Ancient Macedonia, Achaemenid Persia, Arabian Caliphates, the state of Saladin, the small Iberian kingdoms, Kievan Rus, The Vikings, Incas, Toltec, Tang Dynasty in China or Seljuks - these are only part of the most famous choices of our players.\n\nWe recommend this game to all of you that were in love with Age of Empires series, Cossacs or Total war series, for those who are not so narrowly interested into the battle details, as into the means of changing the fate of whole country or slice of historical period. \n \nImportant:\nThe game has several modes, generaly they are into 2 groups game with more soldiers sprites(More Sprites) or game with some of the soldiers sprites (for players with older PCs). Switching between the versions is made trough eu3.exe in the beginning of the game, once you select the exe list of options would appear:\n1.\tDefault (Less Sprites);\n2.\tEast Asian Shield (Less Sprites);\n3.\tFabric Shield (Less Sprites);\n4.\tMore Sprites East Asian;\n5.\tMore Sprites Fabric;\n6.\tMore Sprites Oriental;\n7.\tMore Sprites Rectangle;\n8.\tMore Sprites Standart;\n9.\tMore Sprites;\n10.\tOriental Shield (Less Sprites);\n11.\tRectangle Shield (Less Sprites);\n12.\tStandart Shield (Less Sprites)","torrent":{"xt":"urn:btih:7e4a878af9a2794963ac5c7bf56d95a6bfb4e208","amp;dn":"Imperial+Struggles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e4a878af9a2794963ac5c7bf56d95a6bfb4e208","infoHashBuffer":{"type":"Buffer","data":[126,74,135,138,249,162,121,73,99,172,92,123,245,109,149,166,191,180,226,8]},"announce":[],"urlList":[]}}