{"title":"Metal Evolution S01E01 Pre.Metal","uid":6900239,"size":438167706,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7f0078f624c728bd5c9236ea5c7a422a8ed62f16&amp;dn=Metal+Evolution+S01E01+Pre.Metal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dududus","files":-1,"time":1324371201,"description":"Metal Evolution presents 11 episodes based on the much-debated Metal History \\&quot;family tree\\&quot; originally shown in Headbanger\\'s Journey. This 24 sub-genre genealogical chart reveals the vast complex progeny of heavy metal--from Early Metal and Shock Rock to Thrash, from Progressive Metal to Grunge and Nu Metal. Using the chart as his road map, our host, metalhead turned anthropologist Sam Dunn, will crisscross the globe in search of the very essence of Metal, from bars and back alleys to the biggest open air festivals. \n\nMetal morning in America begins with the clank of cars and guitars and the burning of draft cards, Detroit Rock City being home to the likes of Ted Nugent &amp; The Amboy Dukes, The Frost, Iggy &amp; The Stooges and the explosive MC5. Meanwhile, from New York to San Fran, flower power is declared dead, as darker, heavier music is reflected in the apocalyptic sounds of Steppenwolf, Iron Butterfly and the raucously loud Blue Cheer. But weirdly, the picture suddenly brightens, with the gateway boogie metal of Cactus and Mountain lifting the nation toward a golden period of multi-platinum happy metal, represented by the inspired and inspiring trinity of Kiss, Ted Nugent and \\&quot;America\\'s greatest rock \\'n\\' roll band,\\&quot; Aerosmith. Once Van Halen, with ruthless efficiently but also with flair, accumulates the advantages of all of the above, the stage is set for what will become a full decade\\'s worth of dominance for the uniquely party hardy metal of America. \n &lt;a href=&quot;\nhttp://www.vh1.com/shows/metal_evolution/series.jhtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.vh1.com/shows/metal_evolution/series.jhtml&lt;/a&gt;","torrent":{"xt":"urn:btih:7f0078f624c728bd5c9236ea5c7a422a8ed62f16","amp;dn":"Metal+Evolution+S01E01+Pre.Metal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f0078f624c728bd5c9236ea5c7a422a8ed62f16","infoHashBuffer":{"type":"Buffer","data":[127,0,120,246,36,199,40,189,92,146,54,234,92,122,66,42,142,214,47,22]},"announce":[],"urlList":[]}}