{"title":"VA - Talkin Loud...Saying Something@flac","uid":4909838,"size":361597443,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7f075258ec42f24f92453a4b91bf851453f87500&amp;dn=VA+-+Talkin+Loud...Saying+Something%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":-1,"time":1243097468,"description":"This is the first release from Talkin Loud Records.\n\n\nTalkin Loud is a record label started by Gilles Peterson at Phonogram in 1990 after he left Acid Jazz Records. \nThe label name is based on Peterson's club night &quot;Talkin' Loud And Sayin' Something.&quot; . (wikipedia)\n\n\n\n\nLiner Notes\n\nTalkin Loud - The album heralds a new label and a new dance music philosophy, incorporating a fusion of different styles of music out of the clubscene of which DJ Gilles Peterson (who runs the label 'Talkin Loud') has been the guiding light. \nThe first release on 'Talkin Loud' introduces artists who will have their own releases on the label, in particular - Galliano, Young Disciples and Incognito. \nKicking off with the Young Disciples who create earthy funky grooves that just breathe feeling, aided and abetted by the rhythmic rapping of MC Mello and the Outlaw Posse. They provide an insight into the future of rap and R&amp;B. A constant thread throughout this album is a combination of the appreciation of the roots of black music with contemporary grooves. \nThis is echoed on the Steps Ahead track where the rap interjects :&quot;You gotta hear Blue Note to dig Def Jam&quot; whilst the rhythms are new jazz swing. \nJalal, an original member of the seminal 70's rappers 'The Last Poets' contributes an update of one of his classics, and his tradition of intelligent rap (Spoagraphics) is carried forward by Galliano. \nHis track 'Little Ghetto Boy' is a taster of a new style where musicians and samples meet with rapping and with further releases he is destined to broaden the boundaries and appeal of Hip Hop. \nOn the flip side of the LP the beats become faster. \nIncognito, ten years on from their first LP provide us, &quot;Jazz Funk with BPM's&quot; to appeal to all ravers and dancers. \nLet's talk about dancers for the crown prince of the boogie leg movement Jerry Barry, has created a monster groove with Ace of Clubs and their tune 'Tribal Knight'. Transphonic show us that American dance music is far from dead and is a fine representation of the innovative NY label Nu - Groove. \nIndeed innovation is certainly a word to apply to Chris Bangs, the man behind the Wild and Peaceful tracks, previously a ground breaking DJ's DJ who will undoubtedly become the producer's producer.\nTalkin Loud - inspiration from the past, feet firmly set in the present; with eyes to take minds into the future. \n\n                                                                              Prime Minister of the Vibe \n\n\n\n\n01. Young Disciples (Featuring MC Mello) - Young Disciples Theme\n02. Steps Ahead - Get It (The Rap Remix)\n03. Jalal - Mean Machine 90\n04. The Young Disciples (Featuring The Outlaw Posse) - Step Right On\n05. Galliano - Little Ghetto Boy\n06. Incognito - Gilde\n07. Ace Of Clubs - Tribal Knight\n08. Wild And Peaceful - Bassic\n09. Transphonic - Light Up, Plug In, Bug Out\n10. Wild And Peaceful - Hip-ology\n\n\nLabel: Phonogram\nReleased: 1990\n\n\nCodec: Flac\nCompression Level: 3\nQuality: High\n\n\nMy cd-rip (EAC and Flac)\nCovers Included\n\n\n\n\n\nEnjoy, Seed and Share\n","torrent":{"xt":"urn:btih:7f075258ec42f24f92453a4b91bf851453f87500","amp;dn":"VA+-+Talkin+Loud...Saying+Something%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f075258ec42f24f92453a4b91bf851453f87500","infoHashBuffer":{"type":"Buffer","data":[127,7,82,88,236,66,242,79,146,69,58,75,145,191,133,20,83,248,117,0]},"announce":[],"urlList":[]}}