{"title":"Edit torrent","uid":3876625,"size":559802942,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7f0d4812e54d506e138d0564beea004c825f2b02&amp;dn=Edit+torrent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PrO_BonO","files":1,"time":1194432797,"description":"Web Easy Professional provides all you need to create exciting Web sites that, up to this point, only the pros were able to create. With Web Easy Professional's extensive library of templates, graphics, animated GIFs, photographs, forms, objects, sounds and more... creating custom web sites with advanced features is now as simple as drag-and-drop!\n\nFeatures include:\n\nCustomize your site with selections from a library of more than 85,000 images\nWeb Easy Professional's extensive CD-ROM and online library of photos, backgrounds, clip art, animated graphics, buttons, frames and more are ready-made for easy inclusion into your Web Easy site. \n\nOptimize your website to rank high in search engines\nVCOM has partnered with WebCEO to bring you the finest tools available to help you promote, maintain and analyze your site. \n\nMotionArtist 2 makes creating Flash fast and simple \nMotionArtist 2.0 puts you on the fast track to exceptional, fast-loading flash animation. You can add visual sophistication and impact to web sites in minutes instead of hours. \n\nThe perfect tool for powerful business web sites \nFor business users, it includes built-in the tools for e-commerce, order forms, catalogs and product photos, for affiliate marketing programs and revenue-sharing and for credit card transaction services (Not available in all countries). Whether you have a home business or a fast growing company, Web Easy Professional can help you expand your business on the Internet.\n\nStyles New!\nDesign your web site with styles and gain greater control and flexibility over maintaining your web site.\n\nRSS Feed Support New!\nAdd Really Simple Syndication (RSS) feeds to your site with Web Easy's automatic RSS feed generator. \n\nSearch Engine Optimization New!\nGreater access to all aspects of your web site and generation of fully compliant HTML improves Search Engine Optimization (SEO) of your web site designs. \n\nCascading Style Sheets New!\nFull support for Cascading Style Sheets (CSS) allows you to separate the layout of your site and the content of your site. Both HTML and XHTML standards are supported using CSS. In addition, different measurement units are also supported when creating web sites with CSS. \n\nInspector Window New!\nThe new Inspector window gives you full access to all aspects of your web site. \n\nFully compliant with all internet standards New!\nFully compliant HTML code is generated that passes W3C recommendations and validation. This helps make a consistent web view across multiple web browsers. \n\nTest under different browsers New!\nEasily preview and test your web sites from Web Easy in your installed web browsers.\n\nSystem Requirements:\n\nPentium 500MHz or better Processor\n\nWindows 98/Me/2000/XP/VISTA\n\n256MB RAM","torrent":{"xt":"urn:btih:7f0d4812e54d506e138d0564beea004c825f2b02","amp;dn":"Edit+torrent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f0d4812e54d506e138d0564beea004c825f2b02","infoHashBuffer":{"type":"Buffer","data":[127,13,72,18,229,77,80,110,19,141,5,100,190,234,0,76,130,95,43,2]},"announce":[],"urlList":[]}}