{"title":"We Are Water - Wally Lamb (mobi/epub)","uid":9329937,"size":1661509,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7fd420c587a72ba3439c92978cfd56bbb49e2492&amp;dn=We+Are+Water+-+Wally+Lamb+%28mobi%2Fepub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1386708662,"description":"\t\n\nGenre: Contemporary Fiction\n\nWe Are Water is a disquieting and ultimately uplifting novel about a marriage, a family, and human resilience in the face of tragedy, from Wally Lamb, the New York Times bestselling author of The Hour I First Believed and I Know This Much Is True.\n\nAfter 27 years of marriage and three children, Anna Oh?wife, mother, outsider artist?has fallen in love with Viveca, the wealthy Manhattan art dealer who orchestrated her success. They plan to wed in the Oh family?s hometown of Three Rivers in Connecticut. But the wedding provokes some very mixed reactions and opens a Pandora?s Box of toxic secrets?dark and painful truths that have festered below the surface of the Ohs? lives.\n\nWe Are Water is a layered portrait of marriage, family, and the inexorable need for understanding and connection, told in the alternating voices of the Ohs?nonconformist, Anna; her ex-husband, Orion, a psychologist; Ariane, the do-gooder daughter, and her twin, Andrew, the rebellious only son; and free-spirited Marissa, the youngest. It is also a portrait of modern America, exploring issues of class, changing social mores, the legacy of racial violence, and the nature of creativity and art.\n\n\nWith humor and compassion, Wally Lamb brilliantly captures the essence of human experience and the ways in which we search for love and meaning in our lives.\n\nFormat - mobi/epub","torrent":{"xt":"urn:btih:7fd420c587a72ba3439c92978cfd56bbb49e2492","amp;dn":"We+Are+Water+-+Wally+Lamb+%28mobi%2Fepub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fd420c587a72ba3439c92978cfd56bbb49e2492","infoHashBuffer":{"type":"Buffer","data":[127,212,32,197,135,167,43,163,67,156,146,151,140,253,86,187,180,158,36,146]},"announce":[],"urlList":[]}}