{"title":"PRINS BERNHARD - Een politieke biografie - 1911-1986","uid":7921676,"size":3135817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:800c2f5aed5af9a94445831330550593e398c1bd&amp;dn=PRINS+BERNHARD+-+Een+politieke+biografie+-+1911-1986&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Stepherd","files":-1,"time":1355492119,"description":"WIM KLINKENBERG\nPRINS BERNHARD\nEen politieke biografie\n1911-1986\n\n\nIn september 1936 verscheen de jonge prins Bernhard zur\nLippe-Biesterfeld in ons land als verloofde van kroonprinses Juliana.\nSindsdien is het niet meer stil geweest rond de flamboyante Duitse prins\ndie in Nederland en daarbuiten ongekende activiteiten aan de dag legde:\nbevelhebber van de Nederlandse strijdkrachten, voorzitter van de\nBlLDERBERG-conferenties en 'ambassadeur van het bedrijfsleven'.\n\nWim Klinkenberg heeft de handel en wandel van prins Bernhard sinds 1956\nnauwlettend gevolgd, toen hij als eerste Nederlandse journalist de\npolitieke achtergronden van het HOFCONFLICT blootlegde - dit dank zij\nzijn nauwe relatie met een van koningin Juliana's~betangrijkste\nadviseurs. Hij onthulde tevens voor het eerst Bernhacdsjwerkkring bij de\ngeheime inlichtingen-afdeling van het nazi-concern IG FARBEN, die na de\nTweede Wereldoorlog rechtstreeks leidde tot zijn smeergeldaffaires bij\nhet multinationale bedrijfsleven.\n\nBij het eerste verschijnen van Klinkenbergs werk vielen hem overwegend\nstilte, boycot en angstige kritiek ten deel. Inmiddels worden steeds\nmeer van Klinkenbergs stellingen bevestigd: in 1985 door 'gezaghebbende\nonthullingen' over het Hofconflict en in 1986 door het openstellen van\nvele dossiers over het VERRAAD VAN ARNHEM. Deze nieuwe, onveranderde\neditie - in het nawoord geactualiseerd tot voorjaar 1986 - blijft 'een\nnaslagwerk inzake een machtig interessante periode van de geschiedenis',\ndie te belangrijk is om met de mantel der Oranje-liefde te bedekken. \nAls men de volle omvang van het drama-Bernhard wil kennen moet men het\nwerk raadplegen van Wim Klinkenberg, omdat dit een zo overweldigend\nfeitenmateriaal heeft bijeengebracht dat het al een wonder mag heten dat\nBernhard dit politiek heeft overleefd.\n\nNu ja, lang was het ook niet, want het aftreden van Juliana hield\nnatuurlijk verband met de onmogelijke positie waarin Bernhard was komen\nte verkeren.\n\n--\n\nNAWOORD 1986\nDe erflater\n\nHet verhaal - uit betrouwbare bron - is als volgt: Kort nadat dit boek\n(eind oktober 1979) was verschenen, zaten aan een chique diner een\naantal corypheeÃƒÂ«n onzer natie aan. Tot hen behoorden minister-president\nA.A.M. van Agt en de Prins der Nederlanden, toen nog echtgenoot van de -\neveneens aanwezige - koningin. 'Mijnheer van Agt,' heeft ZKH toen\nuitgeroepen, 'wanneer maar de helft waar zou zijn van wat die\nKlinkenberg over mij schrijft, zoudt u mij hier ter plaatse moeten\ndoodschieten!' Waarop Zijne Exellentie Dries antwoordde: 'Dat zou niet\nverstandig zijn, Koninklijke Hoogheid, want dan zou morgen heel\nNederland dat boek kopen.' De executie ging dus niet door.\n\nHet antwoord van Van Agt mag representatief worden genoemd voor het\ndilemma waarmee de natie door dit boek werd geconfronteerd: het dilemma\nvan thans vijftig jaren aanwezigheid en handelen van Bernhard zur\nLippe-Biesterfeld in en namens het Koninkrijk der Nederlanden. Plus de\ndaaraan voorafgegane jaren die in de hoogste mate de entree van Bernhard\nin september 1936 in Nederlands openbaarheid hebben bepaald.\n\nDe feiten, gebeurtenissen, raadsels die wij in de voorafgaande\nbladzijden hebben beschreven, worden door niemand in hun kern - en\ndoorgaans evenmin in hun aanpalende verbanden - betwist of bestreden,\nzij worden genegeerd. In ons 'Nawoord 1979' zijn we tot de conclusie\ngekomen, dat 'systematisch de rol van deze &quot;in Nederlandse nationaliteit\nverpakte Duitser&quot; - zoals een briefschrijver hem in De Volkskrant van\n12.9.79 noemde ('een typische mof'; zo zou oud-minister Vredeling hem in\nhet kerstnummer 1985 van HP karakteriseren) - zal dienen te worden\nonderzocht'. Door middel van een parlementaire enquÃƒÂªte-bij-wet,\n'waarmee tevens de onvergeeflijke lacune van de parlementaire enquÃƒÂªte\n1940-1945 zou worden goedgemaakt, die Bernhard zur Lippe geheel buiten\nschot en zelfs buiten verhoor-onder-ede heeft gelaten'.\n\n\n--\n\nGe OCR-ed en omgezet in pdf. ","torrent":{"xt":"urn:btih:800c2f5aed5af9a94445831330550593e398c1bd","amp;dn":"PRINS+BERNHARD+-+Een+politieke+biografie+-+1911-1986","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"800c2f5aed5af9a94445831330550593e398c1bd","infoHashBuffer":{"type":"Buffer","data":[128,12,47,90,237,90,249,169,68,69,131,19,48,85,5,147,227,152,193,189]},"announce":[],"urlList":[]}}