{"title":"Cannonball Adderley - In San Francisco (1959) [Jazz][mp3 320][sc","uid":5703438,"size":145520701,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:804bd32b8537cf8048002939c508b172324bfb84&amp;dn=Cannonball+Adderley+-+In+San+Francisco+%281959%29+%5BJazz%5D%5Bmp3+320%5D%5Bsc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":11,"time":1279590735,"description":"The Cannonball Adderley Quintet In San Francisco\nOriginal: 1959\nAudio CD: July 1, 1991 \nFormat: Live, Original recording reissued \nLabel: Ojc \nQuality: mp3 cbr 320 kbps\n\nI purchased this album when it was an LP, in the late 1950's. I also had the opportunity to hear and see this Quintet at the Jazz Workshop in San Francisco, California. This group in person was amazing. The tone was set with &quot;This Here&quot; and rock the house with &quot;Spontaneous Combustion&quot; The solos by each member of the Quintet were fantastic. It was an opportunity to see Bobby Timmons who did the arrangements for &quot;This Here&quot; or as Cannonball stated he &quot;corrupted&quot; it to be &quot;Dis Hear.&quot; What I liked about the LP and now the CD is that each song was not edited, the songs were allowed to the full length as was performed live. The unity of this group did bring down the house as, now the CD is doing the same in my home. It was amazing how the group would play in three quatrer time with such precision that it make a person jump-up and dance. Bobby Timmons solo on &quot;Spontaneous Combustion,&quot; had a bit of &quot;church gospel and R&amp;B&quot; in it. Julian &quot;Cannonball&quot; Adderley and brother &quot;Nat&quot; Adderley complemented each other while playing together or on solo. The Quintet was welded togather in all six of the selections and are great for the ears. \n&quot;Cannonball&quot; had an incredibly rhythmic solos, &quot;Nat&quot; juilant playing accented by drummer Louis Hayes and bass player Sam Jones on most of the numbers, really moved those in attendance inside and those outside of the Jazz Workshop.\n\nAll jazz lovers will miss &quot;Cannonball&quot; and his brother &quot;Nat.&quot; In the meantime we are given a super CD of the groups appearence in San Francisco's jazz Worksop. ~ Algernon J Jackson\n\nIn the late 50s and early 60s Cannonball enjoyed unparallelled popularity, marked by the commercially successful Riverside releases of first his quintet and later his sextet (Yusef Lateef was the 3rd horn). The sessions were frequently recorded live, included spoken introductions by the ebullient Cannonball, featured mostly &quot;accessible&quot; tunes, and showcased at least one crowd-pleaser (This Here, Sack of Woe, Jive Samba, Mercy Mercy) that was also released as a hit single.\nThese sessions are memorable less for the individual solos than the fire of the ensemble, anchored and propelled by perhaps the best walking bass player in the business, Sam Jones. When I return to these recordings, I can't help but lament the absence of such ensembles on the scene today as well as be reminded of the relatively tough times Cannonball would encounter in the late 60s and early 70s, when he had trouble booking the group. (I remember him having to &quot;audition&quot; for ignorant Student Activities Directors shopping for next year's campus entertainment.)\n\n&quot;Live in San Francisco&quot; is an exemplary session, certainly the equal of any of the other recordings by Cannonball with his own group. If a choice is to be made, I would personally favor the recordings with Victor Feldman on piano, rather than Joe Zawinul or Bobby Timmons, the pianist on this particular session. Regardless, with the renewed interest in &quot;acoustic&quot; straightahead jazz, any of the recordings should be required listening for the ensemble sound alone. ~ Samuel Chell\n\nPersonnel:\nCannonball Adderley (alto saxophone)\nNat Adderley (cornet)\nBobby Timmons (piano)\nSam Jones (bass)\nLouis Hayes (drums)\n\nCannonball Adderley - In San Francisco Tracks:\n01  This Here 12:22\n02  Spontaneous Combustion 11:49\n03  Hi-Fly 11:03\n04  You Got It! 5:05\n05  Bohemia After Dark 8:01\n06  Straight, No Chaser 11:38","torrent":{"xt":"urn:btih:804bd32b8537cf8048002939c508b172324bfb84","amp;dn":"Cannonball+Adderley+-+In+San+Francisco+%281959%29+%5BJazz%5D%5Bmp3+320%5D%5Bsc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"804bd32b8537cf8048002939c508b172324bfb84","infoHashBuffer":{"type":"Buffer","data":[128,75,211,43,133,55,207,128,72,0,41,57,197,8,177,114,50,75,251,132]},"announce":[],"urlList":[]}}