{"title":"Write Yourself(Creative Writing and Personal Development) [black","uid":8417552,"size":3418921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81efe39a3c592d52764ad1d05a98e7fffb4543e2&amp;dn=Write+Yourself%28Creative+Writing+and+Personal+Development%29+%5Bblack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"black-14","files":-1,"time":1367087458,"description":"Write Yourself is a complete introduction to facilitating creative writing for therapy or personal development, both with individuals and groups. Clear and practical, and with a strong theoretical base, it is also an essential handbook for individuals embarking on their own personal writing journeys. Topics covered include the nature, values and principles of therapeutic creative writing, how to begin - illuminated with a wealth of examples from the author's extensive and varied experience - and how to write with specific client groups, including children, the very sick, those with mental health or substance misuse problems, as well as those receiving psychotherapy or counselling, and for professional development. Also included are detailed instructions for running a writing group or a longer or residential writing programme, as well as 175 exercises for readers to use in their own personal writing practice, or with their groups or clients. This book will be an invaluable resource for creative arts therapists, professionals working in the caring professionals, and for everyone interested in the therapeutic potential of creative writing.","torrent":{"xt":"urn:btih:81efe39a3c592d52764ad1d05a98e7fffb4543e2","amp;dn":"Write+Yourself%28Creative+Writing+and+Personal+Development%29+%5Bblack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81efe39a3c592d52764ad1d05a98e7fffb4543e2","infoHashBuffer":{"type":"Buffer","data":[129,239,227,154,60,89,45,82,118,74,209,208,90,152,231,255,251,69,67,226]},"announce":[],"urlList":[]}}