{"title":"National Geographic - Noruega: El PaÃƒÂ­s de los Grandes Fiordos","uid":6023176,"size":457702650,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:820e7aaed356d31af841c3001252a6b93cca029a&amp;dn=National+Geographic+-+Noruega%3A+El+Pa%C3%83%C2%ADs+de+los+Grandes+Fiordos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1291865483,"description":"National Geographic - Noruega: El PaÃƒÂ­s de los Grandes Fiordos\n\nNoruega, el paÃƒÂ­s de los grandes fiordos, es un viaje por el extremo mÃƒÂ¡s septentrional del continente europeo. Un territorio cincelado por la naturaleza que se abre al mar en profundos fiordos y sorprende con sus paisajes lacustres y sus extensas tundras. Un paÃƒÂ­s de ciudades modernas y vitales, cuyas casas de madera suelen pintarse de vivos colores.\n\nEste video es una invitaciÃƒÂ³n a recorrer esta tierra de naturaleza privilegiada y conocer al mismo tiempo la historia de uno de los paÃƒÂ­ses con el nivel de vida mÃƒÂ¡s alto del mundo.\n\nEl documental sugiere varios recorridos a travÃƒÂ©s de algunos de los lugares mÃƒÂ¡s impresionantes de Europa. El\nprimero parte de Oslo, la capital, y se dirige hacia Sognefjord -el fiordo de los sueÃƒÂ±os- para visitar dos de sus brazos mÃƒÂ¡s estrechos y espectaculares. Bergen, la ciudad mÃƒÂ¡s bella de Noruega, es el punto de partida para otra de las propuestas, esta vez un crucero en catamarÃƒÂ¡n por la recortada costa escandinava hasta la poblaciÃƒÂ³n de Haugesund y la isla de Karmoy. La ruta prosigue hasta Avaldsnes, ciudad vikinga, en la que se sitÃƒÂºa el origen de Noruega, visita Skudeneshavn, uno de los centros vacacionales mÃƒÂ¡s importantes del paÃƒÂ­s y culmina en Stavanger. Esta antigua ciudad petrolera es hoy una de las urbes mÃƒÂ¡s dinÃƒÂ¡micas de la zona y la base perfecta para recorrer el LyseÃƒÂ­jord, el fiordo del fin del mundo.","torrent":{"xt":"urn:btih:820e7aaed356d31af841c3001252a6b93cca029a","amp;dn":"National+Geographic+-+Noruega%3A+El+Pa%C3%83%C2%ADs+de+los+Grandes+Fiordos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"820e7aaed356d31af841c3001252a6b93cca029a","infoHashBuffer":{"type":"Buffer","data":[130,14,122,174,211,86,211,26,248,65,195,0,18,82,166,185,60,202,2,154]},"announce":[],"urlList":[]}}