{"title":"Jane Goodall - Through a Window: My Thirty Years with the Chimpa","uid":4865553,"size":3565047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8285f79d9ee24db8f6770561c6da27d382c9fe25&amp;dn=Jane+Goodall+-+Through+a+Window%3A+My+Thirty+Years+with+the+Chimpa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iornix","files":369,"time":1240495601,"description":"Through a Window: My Thirty Years with the Chimpanzees of Gombe\n\nTHROUGH A WINDOW is the dramatic saga of thirty years in the life of a community, of birth and death, sex and love, power and war. It reads like a novel, but it is one of the most important scientific works ever published. The community is Gombe, on the shores of Lake Tangganyika, where the principal residents are chimpanzees and one extraordinary woman who is their student, protector, and historian. In her classic In the Shadow of Man, Jane Goodall wrote of her first ten years at Gombe. In Through a Window she brings the story up to the present, painting a much more complete and vivid portrait of our closest relative. We see the community split in two and a brutal war break out. We watch young Figan's relentless rise to power and old Mike's crushing defeat. We learn how one mother rears her children to succeed and another dooms them to failure. We witness horrifying murders, touching moments of affection, joyous births, and wrenching deaths. In short, we see every emotion known to humans stripped to its essence. In the mirror of chimpanzee life, we see ourselves reflected. Perhaps the best book ever written about animal behavior, Through a Window is also essential reading for anyone seeking a better grasp of human behavior.","torrent":{"xt":"urn:btih:8285f79d9ee24db8f6770561c6da27d382c9fe25","amp;dn":"Jane+Goodall+-+Through+a+Window%3A+My+Thirty+Years+with+the+Chimpa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8285f79d9ee24db8f6770561c6da27d382c9fe25","infoHashBuffer":{"type":"Buffer","data":[130,133,247,157,158,226,77,184,246,119,5,97,198,218,39,211,130,201,254,37]},"announce":[],"urlList":[]}}