{"title":"Daddy's Home 2","uid":13998097,"size":844635669,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:83209c109bfff824cb1ae68d263a34b2b359c9a0&amp;dn=Daddy%27s+Home+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":10,"time":1458758750,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=5051024980\r\n \nhttp://imagedisco.net/?g=9701201496\r\n\r\n\r\n\r\nDescription:\r\n\r\nAva Taylor\r\n\r\nAva is outside on the patio having a cigarette when Steven St. Croix suggests she stop smoking. Ava joins him in the den and she's wearing some fantastic cutoff jean shorts. She says she wants to be with an older man and drops her jacket revealing a toned mid-driff. She leans over to make out with him Steven very slowly sucks on her tits Ava drops to her knees and takes him into her mouth. She bobs her head up and down on his meat and her hand follows her mouth down to the base. She does some nice deep throating and gags herself on his meat. Ava gets boned in reverse, cowgirl, mish, spoon and doggie. Ava is very good in this scene and Steven explodes all over her face.\r\n\r\nKeisha Grey\r\n\r\nEvan Stone is on th ephone in the kitchen when Keisha saunters in wearing a tight half-shirt and tiny white shorts. Damn, she looks fine! Keisha calls him 'daddy' after what they did the night before. Evan never wants her to speak of the night again. Later, his wife calls him and Keisha starts kissing his neck. Evan gives in and they start making out. He sucks on her tits and worships the fuck out of those babies! He goes down on her then feeds her his cock. Keisha gags on his rod and gets her face fucked. He fucks her in mish, doggie and spoon. Keisha titty fucks him and Evan busts a nut all over her breasts.\r\n\r\nNicki Huntsman\r\n\r\nNicki is still sleeping at 4 in the afternoon and Christian wakes her up. Nicki rolls over and she's not wearing any panties and Christian can only stare at her. She plays with his cock with her foot and Christian dives into her pussy. Nicki furiously sucks his cock and takes him down to the base. She gets boned in mish, cowgirl, reverse, spoon and doggie. Christian gives Nicki a thick load on her face.\r\n\r\nMarina Angel\r\n\r\nAnthony Rosano comes home and Marina jumps into his arms. She just made the college cheer teen and is all excited. She does some stretching and sexy moves in front of him and Anthony is impressed. Marina gets on the counter in front of him and almost gets into a pile driver position right in front of him. Her pussy is at face level and, after an argument with his wife, he dives into her muff. Marina gives him head and sucks on his balls. She gets her face fucked and takes most of his shaft down her throat. She gets drilled in doggie, mish, cowgirl, reverse and doggie. Marina is very good in this scene and she takes his load all over her face","torrent":{"xt":"urn:btih:83209c109bfff824cb1ae68d263a34b2b359c9a0","amp;dn":"Daddy%27s+Home+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83209c109bfff824cb1ae68d263a34b2b359c9a0","infoHashBuffer":{"type":"Buffer","data":[131,32,156,16,155,255,248,36,203,26,230,141,38,58,52,178,179,89,201,160]},"announce":[],"urlList":[]}}