{"title":"The Alien Truth - The Thiaoouba Prophecy (1).pdf","uid":7577105,"size":887725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:834055aa88958f854ce6be8e4b479fc79cd53a15&amp;dn=The+Alien+Truth+-+The+Thiaoouba+Prophecy+%281%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thereisonlylove","files":-1,"time":1346141996,"description":"Thiaoouba Prophecy - Michel Desmarquet\n\nWHY are we Alive? WHY are we Conscious?\nWhat is The Purpose of the Universe and our OWN role in it?\nWHY is it not enough to believe?\nWhat happened to advanced civilizations and continents (Mu, Atlantis..) ?\nAre we also to face a global catastrophe ? WHEN? What? Why?\nWhy NOBODY REMEMBERS what was the purpose of the Great Pyramid and how to build it?\nWhat happens after death and before we are conceived? WHY?\nWho said that there is a conflict between Creation and Evolution?\nWhy was invention of a WHEEL a great step backwards for humanity?\nWhat are the greatest dangers for Man and humanity on Earth?\nWhat can we do? Dream or to Act? Can we change the SYSTEM peacefully?\nHow much truth is in the Bible? What are lessons from history?\nHow did Man appear on Earth?\n\nAnd SO WHAT ????\n\nIf you are truly interested to learn the answer to at least one of the above question - you will be absolutely fascinated by this book. Key information and details it contains cannot be found in any other book on Earth. Coherence and precision of information surprises scientists on all continents.\n\nThis book clarifies practically ALL myths, doctrines and mysteries on Earth and reveals clear logic, beauty and majesty of the Universe, in which EVERYONE OF US has important role to play.\n\nThere are no theories in this book. No wishful thinking or products of imagination of the author. This is an exact report of the Reality of the Universe.\n\nThere will be people who will not understand this book at all, even though it is written by a simple man, using a simple language, with examples comprehensible even by kids. There will be also others, who won't even TOUCH this book. Leave them in peace. Maybe they are not yet evolved enough, maybe they don't want to learn how much they don't know. There is no point in encouraging a kindergarten kid to study psychology or physics - a kid is simply not yet ready for it.\n\nNo matter how much we insist on defending our current beliefs, doctrines and traditions, nothing can change the TRUTH and the order established in the Universe. Rivers will always flow from their sources towards the ocean, even if a religion, sect or billions of people want to believe the opposite.\n","torrent":{"xt":"urn:btih:834055aa88958f854ce6be8e4b479fc79cd53a15","amp;dn":"The+Alien+Truth+-+The+Thiaoouba+Prophecy+%281%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"834055aa88958f854ce6be8e4b479fc79cd53a15","infoHashBuffer":{"type":"Buffer","data":[131,64,85,170,136,149,143,133,76,230,190,142,75,71,159,199,156,213,58,21]},"announce":[],"urlList":[]}}