{"title":"Black Velvet (US) (1992)","uid":14011919,"size":205303828,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:83b25f12145b93fe5fd2bb7ca07fcd560ba7e9aa&amp;dn=Black+Velvet+%28US%29+%281992%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1458837792,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=1438682955\r\n \nhttp://imagedisco.net/?g=6450632103\r\n\r\nIf you love the dark, exotic beauty of Dominique, you'll be by black velvet. Director Bob Vosse has worked with the sultry beauty in fulfilling erotic fantasies that even she had not yet explored. Pleasure yet felt, sensuality yet uncovered. You'll find it all here, in Black Velvet. Dominique's most daring work, and definitely with a twist.\r\n\r\n\r\nPeter North is the token piece of white bread in this thousand-times-told tale of the doings at a dirty mag. This time, it's &quot;Black Juice.&quot; The sextet of sex scenes are complimented by the exciting-and excited-cast, including an appearance by the sultry Mauvais De Noire. Photographer Sean Michaels gets all sorts of great shots of Dominique, aka &quot;Black Velvet.&quot; The &quot;Screaming One&quot; voraciously humps his sizable hose and is also onhand for a tongue-lasher with De Noire (nice contrast of ebony starlets past end present here), plus able acts with Julian St. Jox (as Janet Jacme watches/diddles) and Peter North, for a total of four separate encounters. The towering Ron Hightower is more than man enough to handle the demands of hefty-hootered Venus Guillen, a robust lady with the prettiest face this side of Cleopatra. Guillen takes the mighty Hightower between her tits, to the tune of dirty talk and bossa nova music. Later, Guillen has enough left for Michaels, who has a grand old time trying to decide who his cover girl will be. Needless to say, there's plenty of &quot;Juice&quot; to go around","torrent":{"xt":"urn:btih:83b25f12145b93fe5fd2bb7ca07fcd560ba7e9aa","amp;dn":"Black+Velvet+%28US%29+%281992%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83b25f12145b93fe5fd2bb7ca07fcd560ba7e9aa","infoHashBuffer":{"type":"Buffer","data":[131,178,95,18,20,91,147,254,95,210,187,124,160,127,205,86,11,167,233,170]},"announce":[],"urlList":[]}}