{"title":"Adobe Creative Cloud Design Tools All in One For Dummies.pdf","uid":8920585,"size":56549646,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83c6b28b65bb77e36b6e5c089b486ef70e40118d&amp;dn=Adobe+Creative+Cloud+Design+Tools+All+in+One+For+Dummies.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"babausis","files":-1,"time":1379244333,"description":"Your all-in-one guide to Adobe's new Creative Cloud\n\nPacked with more than a thousand pages of content, Adobe Creative Cloud All-in-One For Dummies is exactly what you need to get your head in the Creative Cloud. Written by designers for designers, this book is filled with useful information and expert instruction that spans eight minibooks to help you get started with Adobe Creative Cloud, InDesign CC, Illustrator CC, Photoshop CC, Acrobat XI, Dreamweaver CC, Flash Professional CC, and Fireworks CC. You'll learn the latest graphic design and web development tools, tricks, and techniques; watch your productivity explode; and unleash your creative genius with this valuable resource.\n\n- Helps print, web, and mobile media professionals get the very most out of the latest features and techniques available in Adobe Creative Cloud\n\n- Provides beginners with design basics while providing the depth of coverage sought by more experienced design professionals\n\n- Covers the key features and tools in seven of Adobe's most popular Creative Cloud applications (InDesign, Illustrator, Photoshop, Acrobat, Dreamweaver, Flash Professional, and Fireworks) plus a minibook dedicated to Creative Cloud basics\n\nFrom 3D images and vivid illustrations to dynamic web pages and interactive effects, this comprehensive guide shows you how to do it all!","torrent":{"xt":"urn:btih:83c6b28b65bb77e36b6e5c089b486ef70e40118d","amp;dn":"Adobe+Creative+Cloud+Design+Tools+All+in+One+For+Dummies.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83c6b28b65bb77e36b6e5c089b486ef70e40118d","infoHashBuffer":{"type":"Buffer","data":[131,198,178,139,101,187,119,227,107,110,92,8,155,72,110,247,14,64,17,141]},"announce":[],"urlList":[]}}