{"title":"Vincent Price Present . . . The Price of Fear  (BBC)","uid":8506385,"size":571447715,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:83d499effb28adb66dd010ed8d897818b1246b1a&amp;dn=Vincent+Price+Present+.+.+.+The+Price+of+Fear++%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Robin1966","files":22,"time":1369436687,"description":"Overview\nFor the 1970's late-night horror show, The Price of Fear, the BBC dramatized the most chilling stories they could find, drawing on talented new writers as well as the established master of terror who narrated tale, re-written as though Price actually experienced each chilling adventure himself.  The show was enormously successful in the UK and abroad, and three series were made - 1973, 1975 and 1982.\n\nEpisode Guide\n\n\n1. William and Mary by Roald Dahl.  (9/4/73 &amp; 9/8/73).  POOR QUALITY 64k\nWhen William dies, his brain and one of his eyes are kept alive in a basin.  At first, his widow Mary is shocked, that her tyrannical husband will watch her forever, but then she begins to like the idea in the end: his eye will have to see her doing everything which he hated during his lifetime, and he won't be able to do anything about it.\n\n2. Come As You Are by William Ingram  (2/7/73 &amp; 4/06/74\nHorror film legend Vincent Price gets a chilling invitation to a special costume party.  With Morris Perry.\n\n3. Specialty of the House by Stanley Ellin  (3/7/73 &amp; 13/4/74)\nPrince of terror Vincent Price recounts a culinary tale which leaves a bitter taste. With Francis de Wolfe and Hugh Burden.  \n\n4. The Man Who Hated Scenes  (29/9/73)\nA meek millionaire's chilling tale of taking subtle revenge on his cheating wife. Stars Vincent Price and Peter Cushing.\n\n5. Guy Fawke's Night by Richard Davies (17/11/73)\nHorror legend Vincent Price remembers a bonfire party when a bullying father disappears.\n\n6. The Ninth Removal from a story by R Chetwynd-Hayes.  (19/11/73 &amp; 20/4/74)\nHorror legend Vincent Price's unnerving tale of a secretary's murderous revenge.  With Freda Jackson and Richard Pearson.\n\n7. Soul Music by William Ingram.  (1/7/73)\nHorror legend Vincent Price tells the chilling tale of a violinist with very special hands. With Coral Browne and John Graham\n\n8. An Eye for An Eye by William Ingram (4/7/75)\nEven horror legend Vincent Price can't face the meal that's placed before him.  With Christopher Bidmead and Anne Jameson.\n\n9. The Waxwork by AM Burrage  (18/7/73)\nHorror legend Vincent Price tells the mortifying tale of a man who spends the night amongst wax dummies.  With Peter Barkworth.\n\n10. Lot 132 by Elizabeth Morgan (25/7/73)\nHorror legend Vincent Price tells the artistically horrifying tale of a painting.  With Douglas Blackwell and Alexander John.\n\n11. Fish by Rene Basilico (8/8/73)\nMovie legend Vincent Price takes the bait and tells a tale of horror from Down Under. Shark and chips anyone? With Bill Kerr.\n\n12. Blind Man's Bluff by William Ingram (4/8/75)\nHorror legend Vincent Price's chilling tale of an eerie passenger who joins him on a train heading west.  Stars Freddie Jones.\n\n13. Cat's Cradle from The Squaw by Bram Stoker  (9/15/73)\nVincent Price relates an explicitly horrific tale of a boorish film director and a vengeful feline.  Starring Kenneth J Warren.\n\n14. Meeting in Athens (22/9/73 &amp; 20/12/73)\nVincent Price recalls his encounter with a couple in Greece, desperate to stay for three days more.  Starring Kate Coleridge.\n\n15. Remains to be Seen (1/9/73 and 17/12/73)\nVincent Price spins a yarn of two emasculated husbands, and a plot to escape their domesticated lives.  Starring Clive Swift.\n\n16. The Family Album by William Ingram (8/2/83 &amp; 13/6/83)\nVincent Price's tale of faceless commuter Arthur, who proves to be a formidable adversary as danger strikes.  With Liz Fraser.\n\n17. Not Wanted on Voyage by William Ingram  (26/4/83 &amp; 27/6/83)\nVincent Price's tale of the despotic Henrietta Forsythe's sway over her secretary and new husband.  With Margaret Courtenay.\n\n18. Goody Two Shoes by William Ingram  (27/4/83 &amp; 30/5/83)\nHorror legend Vincent Price's sobering tale of Anne and David's move to Devon, and an unwelcome lodger. With Michael Jayston.\n\n19. To My Dear, Dear Saladin by William Ingram  (27/4/83 &amp; 6/6/83)\nHorror legend Vincent Price introduces a tale of a cat and its unusual inheritance. Stars Annette Crosbie and Edward Woodward.  \n\n20. Out of the Mouths by William Ingram  (11/5/83 &amp; 20/6/83)\nVincent Price's tale of the unforeseen danger of a scientist trying out advanced theories on his newborn son.  With Hywel Bennet.\n\n21. Is There Anybody There?  by William Ingram  (25/5/83 &amp; 4/7/83)\nHorror legend Vincent Price's tale of a phoney clairvoyant and her client, who's after a preview of eternity.  Stars Dilys Laye.\n\n22. Never Gamble With A Loser (No Info).  MISSING\n\n-----------------------------------------------------------------File Information-------------------------------------------------------------\nFirst broadcast: BBC R4; approximate dates as indicated in the episode guide\nThis broadcast: BBC R4X; Nov/Dec 2012 and Apr/May 2013\nType: MPEG 1.0 Layer 3 - 128 kbps mp3 - 44 khz - Joint Stereo.  Except episode 1: 64 kbps 24 khz - Joint Stereo\nDuration: 21 x 27 to 30 minute episodes\nCaptured with Radio Downloader, edited with mp3DirectCut\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:83d499effb28adb66dd010ed8d897818b1246b1a","amp;dn":"Vincent+Price+Present+.+.+.+The+Price+of+Fear++%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83d499effb28adb66dd010ed8d897818b1246b1a","infoHashBuffer":{"type":"Buffer","data":[131,212,153,239,251,40,173,182,109,208,16,237,141,137,120,24,177,36,107,26]},"announce":[],"urlList":[]}}