{"title":"Honest Masks by Barbra Novac (1).epub","uid":9195281,"size":264652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:846d4b6fe56fade3fe9b4bf8701cb444efdb45c3&amp;dn=Honest+Masks+by+Barbra+Novac+%281%29.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1384478690,"description":" Chloe Halliday has held the artistic life at bay for as long as she can remember. She's kept her real life quiet and her sex life to cyber space, fearing any real connection and the potential disruption it could bring to her life. Max and James have been lovers for years. They live on a commune for geniuses and hold parties, taking many lovers and indulging the senses at every opportunity. But Max is haunted by trouble from his past and James aches to find the woman who can complete them, enjoying their lifestyle in love and freedom. Soon Max meets Chloe online and instantly connects with her in the deepest way. James meets Chloe in real life, and begins a whirlwind romance with her, seducing her into a world of creative desire. Chloe wants both men, but doesn't know how to broach the subject with each of them. The men haven't told Chloe they know each other, and somehow they have to tell her they want her to join their life. However, there is a deep secret that unites Max and Chloe that neither knows about that could separate them forever.\nGenre: Erotica, Romance","torrent":{"xt":"urn:btih:846d4b6fe56fade3fe9b4bf8701cb444efdb45c3","amp;dn":"Honest+Masks+by+Barbra+Novac+%281%29.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"846d4b6fe56fade3fe9b4bf8701cb444efdb45c3","infoHashBuffer":{"type":"Buffer","data":[132,109,75,111,229,111,173,227,254,155,75,248,112,28,180,68,239,219,69,195]},"announce":[],"urlList":[]}}