{"title":"Forks Over Knives (2011) James Cameron, Transform Earth","uid":10093842,"size":746676306,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:86bb599bc0f33f01721e639b4ff948b60227f968&amp;dn=Forks+Over+Knives+%282011%29+James+Cameron%2C+Transform+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"UnviolentPeacemaker","files":3,"time":1399250451,"description":" &lt;a href=&quot;http://www.forksoverknives.com/celebrity-talk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.forksoverknives.com/celebrity-talk/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://http://www.imdb.com/title/tt1567233/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://http://www.imdb.com/title/tt1567233/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Forks_over_Knives&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Forks_over_Knives&lt;/a&gt;\n\n&quot;A Film That Can Save Your Life.&quot; --Roger Ebert, Chicago Sun Times\n\n&quot;Convincing, Radical and Politically Volatile.&quot; --John Anderson, Variety\n\n&quot;Great Movie.&quot; --Mark Bittman, New York Times Columnist\n\n&quot;A Great Film.&quot; --Sanjay Gupta, MD, CNN chief medical correspondent\nProduct Description\n\nWhat has happened to us? Despite the most advanced medical technology in the world, we are sicker than ever by nearly every measure.\n\nTwo out of every three of us are overweight. Cases of diabetes are exploding, especially amongst our younger population. About half of us are taking at least one prescription drug. Major medical operations have become routine, helping to drive health care costs to astronomical levels. Heart disease, cancer and stroke are the country's three leading causes of death, even though billions are spent each year to &quot;battle&quot; these very conditions. Millions suffer from a host of other degenerative diseases.\n\nCould it be there's a single solution to all of these problems? A solution so comprehensive but so utterly straightforward, that it's mind-boggling that more of us haven't taken it seriously?\n\nFORKS OVER KNIVES\n\nexamines the profound claim that most, if not all, of the so-called &quot;diseases of affluence&quot; that afflict us can be controlled, or even reversed, by rejecting our present menu of animal-based and processed foods. The major storyline in the film traces the personal journeys of a pair of pioneering yet under-appreciated researchers, Dr. T. Colin Campbell and Dr. Caldwell Esselstyn.\n\nDr. Campbell, a nutritional scientist at Cornell University, was concerned in the late 1960's with producing &quot;high quality&quot; animal protein to bring to the poor and malnourished areas of the third world. While in the Philippines, he made a life-changing discovery: the country's wealthier children, who were consuming relatively high amounts of animal-based foods, were much more likely to get liver cancer. Dr. Esselstyn, a top surgeon and head of the Breast Cancer Task Force at the world-renowned Cleveland Clinic, found that many of the diseases he routinely treated were virtually unknown in parts of the world where animal-based foods were rarely consumed.\n\nThese discoveries inspired Campbell and Esselstyn, who didn't know each other yet, to conduct several groundbreaking studies. One of them took place in China and is still among the most comprehensive health-related investigations ever undertaken. Their research led them to a startling conclusion: degenerative diseases like heart disease, type 2 diabetes, and even several forms of cancer, could almost always be prevented - and in many cases reversed - by adopting a whole foods, plant-based diet. Despite the profound implications of their findings, their work has remained relatively unknown to the public. The filmmakers travel with Drs. Campbell and Esselstyn on their separate but similar paths, from their childhood farms where they both produced &quot;nature's perfect food&quot;; to China and Cleveland, where they explored ideas that challenged the established thinking and shook their own core beliefs.\n\nThe idea of food as medicine is put to the test. Throughout the film, cameras follow &quot;reality patients&quot; who have chronic conditions from heart disease to diabetes. Doctors teach these patients how to adopt a whole foods plant-based diet as the primary approach to treat their ailments - while the challenges and triumphs of their journeys are revealed.\n\nFORKS OVER KNIVES utilizes state of the art 3-D graphics and rare archival footage. The film features leading experts on health, examines the question &quot;why we don't know&quot;, and tackles the issue of diet and disease in a way that will have people talking for years.\n\nFORKS OVER KNIVES was filmed all over the U.S., in Canada and China.","torrent":{"xt":"urn:btih:86bb599bc0f33f01721e639b4ff948b60227f968","amp;dn":"Forks+Over+Knives+%282011%29+James+Cameron%2C+Transform+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86bb599bc0f33f01721e639b4ff948b60227f968","infoHashBuffer":{"type":"Buffer","data":[134,187,89,155,192,243,63,1,114,30,99,155,79,249,72,182,2,39,249,104]},"announce":[],"urlList":[]}}