{"title":"Nathaniel Kahn: My father, my architect","uid":4831759,"size":35839608,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:888ffcf18984d037f9b76e73118bfce07a0ab3b0&amp;dn=Nathaniel+Kahn%3A+My+father%2C+my+architect&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1239160218,"description":"Nathaniel Kahn shares clips from his documentary &quot;My Architect,&quot; about his quest to understand his father, the legendary architect Louis Kahn. It's a film with meaning to anyone who seeks to understand the relationship between art and love.\n\nThe architect Louis Kahn was known for formally brilliant modern buildings, but his personal life was utterly baroque: married with one child, he had two other children by two other women. His only son, Nathaniel, met him rarely; Louis died when Nathaniel was only 11. Nathaniel grew up to become a playwright and documentary filmmaker -- he worked on such award-winning films as 1996's My Father's Garden and Canary of the Ocean. \n\nHis 2002 film My Architect traveled the world to uncover the mysteries of his father, looking for clues in Louis Kahn's body of work, in his work relationships and his personal ones. It's a film with meaning to anyone who seeks to understand the relationship between art and love. After My Architect, Kahn directed the Oscar- and Emmy-nominated 2004 documentary Two Hands, about the pianist Leon Fleischer, and produced a mockumental look at the director M. Night Shyamalan.","torrent":{"xt":"urn:btih:888ffcf18984d037f9b76e73118bfce07a0ab3b0","amp;dn":"Nathaniel+Kahn%3A+My+father%2C+my+architect","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"888ffcf18984d037f9b76e73118bfce07a0ab3b0","infoHashBuffer":{"type":"Buffer","data":[136,143,252,241,137,132,208,55,249,183,110,115,17,139,252,224,122,10,179,176]},"announce":[],"urlList":[]}}