{"title":"Hot Wheels Battle Force 5 Season Two","uid":8152590,"size":5684604957,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:89188ea95183945266eb098e9a16440763c833a7&amp;dn=Hot+Wheels+Battle+Force+5+Season+Two&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Shadow_Storm","files":28,"time":1361086392,"description":"One day driving out in the Salt Flats, expert driver Vert Wheeler comes across a dimension called a Battle Zone, where he meets a life form called a Sentient named Sage. Together, they assemble a racing team equipped with state-of-the-art weaponized vehicles to compete against the robotic Sark and the beast-like Vandals in the Battle Zones for the devices that control the zones called Battle Keys to determine the fate of Earth.\n\nBattle Force 5 lives on the planet Earth at Vert's garage/race circuit at a town called Handler's Corners. When Tornado-like portals called Storm Shocks appear, they provide access to dimensions in the Multiverse called Battle Zones. All Battle Zones have a Battle Key that allows access to the home world of the ones who accessed the Zone through Storm Shocks. This obligates Battle Force 5 to secure the Keys before the Vandals or the Sark in prevention of them taking over Earth.\n\nThe Battle Zones were created by the Sentients. There are two types of Sentients: Blue and Red. The two types lived on two separate Homeworlds as rivals, until the blue homeworld was taken over by the Vandals. Throughout the story, Battle Force 5 encounter situations that make them access the Vandal, Sark, and Sentient homeworlds.","torrent":{"xt":"urn:btih:89188ea95183945266eb098e9a16440763c833a7","amp;dn":"Hot+Wheels+Battle+Force+5+Season+Two","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89188ea95183945266eb098e9a16440763c833a7","infoHashBuffer":{"type":"Buffer","data":[137,24,142,169,81,131,148,82,102,235,9,142,154,22,68,7,99,200,51,167]},"announce":[],"urlList":[]}}