{"title":"PC - Crime Life Gang Wars [DVDRIP] [3CDs]","uid":3426831,"size":1887670027,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8a6fd8aac595ee4eb9fcf2a385d31a487b6b65a0&amp;dn=PC+-+Crime+Life+Gang+Wars+%5BDVDRIP%5D+%5B3CDs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"changoboy","files":133,"time":1136170946,"description":"Welcome to the cruel streets of Grand Central City, an urban       \njungle, steeped in Violence. Where ruthless gangs vie for power,   \nand the police struggle to contain them. The Outlawz, led by &quot;Big  \nDog&quot;, used to rule this city but were overrun in a power struggle  \nby Justiss and the Headhunterz during the famous Gang Wars that    \noccured some years earlier. The sears of these wars are still      \nfresh.                                                             \n                                                                     \nCrime Life is a hard-hitting action game in which a young hopeful  \nsigns up to protect his homies from rival gangs in Grand Central   \nCity.                                                              \n                                                                    \nFight fire with fire; hurt crime with crime. When even the cops    \nassigned to protect you are corrupt, the only way forward is to    \ntake the law into your own hands.                                  \n                                                                   \nTre, a typical inner-city kid from the wrong side of town, has   \njust come of age in Grand Central City. Its Tres time to make a  \ndifference the only way he knows how, and the only way there is    \nhow, by serving the local gang.                                    \n                                                                      \nOf course being in a gang is never easy, but in recent years gang  \nlife in Grand City Central has become even harder. Full-scale      \nstreet battles have only recently gone back underground, with the  \nbalance of power shifting from Big Dogs Outlawz to ambitious    \nnewcomers Grand Central Justiss led by Kingpin. In order to make \na difference, Tre must know how to work all the old rivalries and  \nform new bonds of trust to act in his favour.                      \n                                                                       \nThe ultimate aim of Crime Life: Gang Wars is to make Tre a gang    \nleader so he can lead his own homies into battle. If Tre can prove \nhimself tough enough for the job, taking on tagging, general       \nvandalism and theft as part of his  daily duties he can move on to \nbigger business and really start to turn things around. The action \nis primarily fighting, but in between there are cool cinematic cut \nscenes to fill in the story, with some dramatic turning points    \nthrown in to catch you by surprise.                                \n                                                                       \nFeatures:                                                          \n                                                                     \nRise up to the top of your gang and lead/order your crew into    \nfights                                                           \nControl and influence your gang during missions.                 \nStrong moral storyline. Character focused narrative by a Film/TV \nScript writer                                                    \nOver 25 story mode missions and a vast array of free play        \nmissions.                                                        \nSandbox play allows the player to freely interact with the game  \nworld. Undertake various criminal activities during free play    \nUnique reputation scoring system                                 \nEnter fight championships to develop your skills and make moves  \non the streets. Learn/Unlock moves in the fight championship     \nGreat audio effects including a Hip-Hop soundtrack and an        \nimmersive game world ambience.                                   \nHip theme based on modern day urban gang culture                 \nGives a taste of the best gangster movies                        \nMixes action and strategy with a detailed storyline","torrent":{"xt":"urn:btih:8a6fd8aac595ee4eb9fcf2a385d31a487b6b65a0","amp;dn":"PC+-+Crime+Life+Gang+Wars+%5BDVDRIP%5D+%5B3CDs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a6fd8aac595ee4eb9fcf2a385d31a487b6b65a0","infoHashBuffer":{"type":"Buffer","data":[138,111,216,170,197,149,238,78,185,252,242,163,133,211,26,72,123,107,101,160]},"announce":[],"urlList":[]}}