{"title":"Zombieville USA v- 1.0.2 by LawnMowerKing","uid":6562830,"size":12333413,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:8b5038b15e15ab73eb5459d7313706809343ef3c&amp;dn=Zombieville+USA+v-+1.0.2+by+LawnMowerKing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LawnMowerKing","files":1,"time":1311560164,"description":"Version: 1.0.2\nDescription\nZombieville USA - one of the biggest hits for the iPhone, now on Android devices! Experience the definitive mobile zombie experience, which has set records and won the hearts of millions of players.\nFor the latest on what we\\'re up to, you can follow MikaMobile on Twitter! \nWelcome to Zombieville USA! \nWhen your town is overrun by the walking dead, there\\'s only one thing left to do - go through their pockets and look for loose change! As the lone survivor of a zombie apocalypse, it\\'s up to you to battle legions of the undead in a never ending fight for survival! How long can you hold out? Scrounge for cash and ammunition, and buy up to 18 different weapons as your inevitable doom closes in around you... \nZombieville USA combines the timeless appeal of classic arcade games with lively stylized animation.\nFEATURES: \n- Defend yourself with 18 different weapons, from shotguns to chainsaws, even rockets, katanas and flamethrowers! \n- Deceptively simple gameplay, with more depth than meets the eye. Manage your cash and ammo carefully, or become zombie chow! \n- Hop into vehicles to splatter zombie bits all over the pavement!\n- Uncover other survivors hiding in houses, who will aid the player in their hopeless struggle against the undead.\nFan of our games?  Don\\'t forget to check out our other hit game, Battleheart, available now on Android!","torrent":{"xt":"urn:btih:8b5038b15e15ab73eb5459d7313706809343ef3c","amp;dn":"Zombieville+USA+v-+1.0.2+by+LawnMowerKing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b5038b15e15ab73eb5459d7313706809343ef3c","infoHashBuffer":{"type":"Buffer","data":[139,80,56,177,94,21,171,115,235,84,89,215,49,55,6,128,147,67,239,60]},"announce":[],"urlList":[]}}