{"title":"HST - Life After People (Season 1) [HDRIP 720p]","uid":5532689,"size":14486835888,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8b5a674e85a3cd801ff32b2c967b2d2e3c16baba&amp;dn=HST+-+Life+After+People+%28Season+1%29+%5BHDRIP+720p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Milleman","files":-1,"time":1272932251,"description":"History Channel - Life After People (Season 1)\n\nYear: 2009\nCountry: United States\nGenre: fiction, documentary\nDuration: 10x ~ 45 minutes\nTranslation: Professional (1-6 Kravets, 7-10 - ORT)\n\nDirected by: Frank Kosa, Colin Campbell, Laura Verklan\nProducer: Jeremy Chilvers, Vincent Lopez, James Grant Goldin\nScreenplay: Sam Dolan, Colin Campbell, James Grant Goldin\nActors: Struan Rodger, John Anderson, David Breen, Ron Chesser\n\nDescription: The filmmakers, along with scientists - biologists, ecologists, geologists, engineers - are trying to find the answer to the question what will happen to our planet, animals and plants, if people suddenly disappear. How long will the monuments and artifacts created by humans stand? What is left of our industrial world? What is destroyed first? In seeking answers to these questions experts are turning to past experience, exploring the ruins of ancient civilizations and modern cities destroyed by natural disasters and technological disasters.\n\nAfter 6 months of the suburbs will begin to settle coyotes and lynx, usually aloof cities, and the rats and mice that swallowed up all edible supplies, leave them. After 25 years of sea water would flood the London and Amsterdam. After 40 years, almost all wooden buildings or burn down or rot or be destroyed by termites. After 75 years, most of the 600 million cars will become a heap of metal. After 100 years would affect the bridges due to corrosion of bearing structures. After 200 years will not even skyscrapers. After 500 years, will turn into ashes modern means of information storage: hard drives, DVD, Film &amp; Paper. Through 1000 years on Earth will be virtually no evidence of human civilization. Least of all affected buildings and structures, made of massive stones and thick concrete, for example, the Egyptian pyramids, the Great Wall of China and the Hoover Dam. However, after 10000 years, and they disappear.\nLife on Earth does not stop after the disappearance of people. Simply, it will be different.\n\nEpisodes:\n\n01: The Bodies Left Behind\n02: Outbreak\n03: The Capital Threat\n04: Heavy Metal\n05: The Invaders\n06: Entombed\n07: Odds Against Tomorrow\n08: Ultimate Wipeout\n09: The Road to Nowhere\n10: Waters of Death\n\nQuality: HDTVRip\nFormat: MKV\nVideo codec: x264\nAudio Codec: AC3, mp3\nVideo: MPEG4 Video (H264) 1280x720 23.98fps 3200-4300 kb/s\nAudio1: English: AC3 2.0, 384 kb/s \nAudio2: Russian: mp3/AC3 2.0, 128-384 kb/s\n\nHelp seeding, plz!\n","torrent":{"xt":"urn:btih:8b5a674e85a3cd801ff32b2c967b2d2e3c16baba","amp;dn":"HST+-+Life+After+People+%28Season+1%29+%5BHDRIP+720p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b5a674e85a3cd801ff32b2c967b2d2e3c16baba","infoHashBuffer":{"type":"Buffer","data":[139,90,103,78,133,163,205,128,31,243,43,44,150,123,45,46,60,22,186,186]},"announce":[],"urlList":[]}}