{"title":"Colish - Medieval Foundations of the Western Intellectual Tradit","uid":8498190,"size":5882455,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b6a5b7cfbe8e8af852ebc48ef798526ecea54fe&amp;dn=Colish+-+Medieval+Foundations+of+the+Western+Intellectual+Tradit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1369196111,"description":"Marcia L. Colish - Medieval Foundations of the Western Intellectual Tradition, 400-1400 (Yale Univ. Press, 1998). 388 pages + plates.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nA chronological account of the intellectual life and the development of ideas in Western Europe from the early medieval period to the present day.\n\n\nExamining the course of Western intellectual history between 400-1400 this text is arranged in two parts. The first surveys the comparative modes of thought and varying success of Byzantine, Latin-Christian and Muslim cultures, and the second takes the reader from the 11th century revival of learning to the high Middle Ages and beyond, the period in which the vibrancy of Western intellectual culture enabled it to stamp its imprint well beyond the frontiers of Christendom. Marcia Colish argues that the foundations of the Western intellectual tradition were laid in the Middle Ages and not, as is commonly held, in the Judeo-Christian or classical periods. She contends that Western medieval thinkers produced a set of tolerances, tastes, concerns and sensibilities that made the Middle Ages unlike other chapters of the Western intellectual experience. She provides descriptions of the vernacular and oral culture of each country in Europe; explores the nature of medieval culture and its transmission; profiles seminal thinkers, such as Augustine, Anslem, Gregory the Great, Aquinas and Ockham; studies heresy from Manichaeism to Huss and Wycliffe; and investigates the influence of Arab and Jewish writing on scholasticism and the resurrection of Greek studies. Colish concludes with an assessment of the modes of medieval thought that ended with the period and those that remained as bases for later ages of European intellectual history.","torrent":{"xt":"urn:btih:8b6a5b7cfbe8e8af852ebc48ef798526ecea54fe","amp;dn":"Colish+-+Medieval+Foundations+of+the+Western+Intellectual+Tradit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b6a5b7cfbe8e8af852ebc48ef798526ecea54fe","infoHashBuffer":{"type":"Buffer","data":[139,106,91,124,251,232,232,175,133,46,188,72,239,121,133,38,236,234,84,254]},"announce":[],"urlList":[]}}