{"title":"The Medieval Islamic Civilization - C. 11 (Science, Technology3)","uid":12111113,"size":260213216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b6f187d723e2266ae19b6e4710bff3c53eb9445&amp;dn=The+Medieval+Islamic+Civilization+-+C.+11+%28Science%2C+Technology3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moman73","files":27,"time":1436575636,"description":"The Medieval Islamic Civilization - Collection 11 (Science, Technology 3):\n\nWe have 27 titles here:\n\n-  Al-Khalili - Pathfinders; the Golden Age of Arabic Science (2010)\n\n-  Allan - Nishapur; Metalwork of the Early Islamic Period (1982)\n\n-  Deming - Science and Technology in World History; Vol. 2, Early Christianity, the Rise of Islam and the Middle Ages (2010)\n\n-  Dunn - The Adventures of Ibn Battuta; a Muslim Traveler of the 14th Century (2012)\n\n-  Gabriel - Man and Wound in the Ancient World; a History of Military Medicine from Sumer to the Fall of Constantinople (2012)\n\n-  Glick et al (Eds.) - Medieval Science, Technology, and Medicine; an Encyclopedia (2005)\n\n-  Grabhoff - The History of Ptolemy's Star Catalogue (1990)\n\n-  Hirschler -  Medieval Arabic Historiography; Authors as Actors (2006)\n\n-  Hughes (Ed.) - Fibonacci's De Practica Geometrie (2008)\n\n-  Hussain - The History and Impact of the Muslim Hospital, vol. III (2014)\n\n-  Kheirandish - The Arabic Version of Euclid's Optics, Vol. I (1999)\n\n-  King - In Synchrony with the Heavens; Studies in Astronomical Timekeeping and Instrumentation in Medieval Islamic Civilization (2004)\n\n-  Kroger - Nishapur Glass of the Early Islamic Period (1995)\n\n-  Leiser &amp; Al-Khaledy - Questions and Answers for Physicians, A Medieval Arabic Study Manual by Abd Al-Aziz Al-Sulami (2004)\n\n-  Lewicka - Food and Foodways of Medieval Cairenes; Aspects of Life in an Islamic Metropolis of the Eastern Mediterranean (2011)\n\n-  Miles - The Islamic Coins (1962)\n\n-  Ragep - Nasir al-Din al-Tusi's Memoir on Astronomy, Vol. 1 (1993)\n\n-  Rashed - The Development of Arabic Mathematics; Between Arithmetic and Algebra (1994)\n\n-  Rashed (Ed.) - Encyclopedia of the History of Arabic Science, Vol. 3 (1996)\n\n-  Rashed (Ed.) - Encyclopedia of the History of Arabic Science; Vol. 2, Mathematics and the Physical Sciences (1996)\n\n-  Shehada - Mamluks and Animals; Veterinary Medicine in Medieval Islam (2013)\n\n-  Talbert &amp; Unger (Eds.) - Cartography in Antiquity and the Middle Ages; Fresh Perspectives, New Methods (2008)\n\n-  Toomer (Ed.) - Apollonius Conics, Books V to VII; the Arabic Translation of the Lost Greek Original in the Version of the Banu Musa (1990)\n\n-  Toomer (Ed.) - Diocles on Burning Mirrors; the Arabic Translation of the Lost Greek Original (1976)\n\n-  Turner - Science in Medieval Islam; an Illustrated Introduction (1995)\n\n-  Waines - Food Culture and Health in Pre-Modern Islamic Societies (2011)\n\n-  Waines - The Odyssey of Ibn Battuta; Uncommon Tales of a Medieval Adventurer (2010)","torrent":{"xt":"urn:btih:8b6f187d723e2266ae19b6e4710bff3c53eb9445","amp;dn":"The+Medieval+Islamic+Civilization+-+C.+11+%28Science%2C+Technology3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b6f187d723e2266ae19b6e4710bff3c53eb9445","infoHashBuffer":{"type":"Buffer","data":[139,111,24,125,114,62,34,102,174,25,182,228,113,11,255,60,83,235,148,69]},"announce":[],"urlList":[]}}