{"title":"Terminator - The Sarah Connor Chronicles S01E07 - The Demon Hand","uid":4199180,"size":367016354,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8be6ca7cbf75c2ce65060afdfdaef6703bf9e6f2&amp;dn=Terminator+-+The+Sarah+Connor+Chronicles+S01E07+-+The+Demon+Hand&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Chimera2005","files":1,"time":1211403278,"description":"The episode begins with Cameron stepping off a motorcycle, disguised as a police officer. She breaks into a power plant, finds a primary turbine, and then shoves her fist into it, destroying the turbine, and Los Angeles loses power. She then rides the motorcycle to the Central Los Angeles Police Department and walks through undetected. She punches open the door to evidence storage. Cameron finds an evidence box, and Agent Ellison?s is the last name on the list. She looks through the box and finds nothing.\n\nSarah walks through a crypt and stops at the headstone of Andy Goode, comparing his cremation to the incineration of the T-888 in a voiceover.\n\nDerek now lies in bed, still recovering from his battle with the T-888 at the jail (in &quot;Queen&amp;#039;s Gambit&quot;). Sarah tells him that the T-888 has been successfully destroyed and that she hasn?t located Dmitri Shipkov, Andy?s chess partner. Derek suggests assigning Cameron to it. Cameron comes home and tells Sarah the FBI has the missing T-888 hand. Sarah orders Cameron to find Dmitri, and in order to do so, Cameron enrolls in a ballet class taught by Dmitri?s sister, Maria. (Summer Glau, the actress who portrays Cameron, is a classically trained ballerina.) At the end of the first lesson a Russian man (apparently a gangster) shows up demanding money he is owed, while Cameron listens in on the conversation since she can speak Russian.\n\nMeanwhile, Sarah calls the FBI, disguising herself as an evidence clerk. Sarah hears the man ask Ellison where the hand is, and he claims to not have it. At home, Ellison watches footage of Sarah during her stay at Pescadero. Sarah?s words on the tape click in Ellison?s head. Ellison opens his freezer and reveals the T-888?s hand in a bag. Ellison visits Pescadero and is shown Sarah&amp;#039;s cell by a doctor. Ellison asks the doctor if there are any people who worked in the hospital that he can talk to. The doctor tells him of only one person, a Doctor Silberman who is living in the mountains, and that nobody has been in contact with him. Later, Sarah breaks into Ellison?s house looking for the T-888 hand. As she is searching through the place, she finds that Ellison has been examining videos of her stay at Pescadero. Sarah grabs one and leaves.\n\nJohn finds Derek cleaning their arsenal of weapons on the floor of Sarah?s room. Derek asks about Charlie, and John says he can be trusted. As they start a conversation Derek gets angry that John trusts Cameron. Seconds later, Sarah comes home and wants John to find an address. Derek tells Sarah that Cameron needs to leave for John?s safety. In the other room, John finds Sarah?s tape from Pescadero. He takes it into his room and slides it into his VCR, and then puts on headphones. Nothing is heard, but within moments he has tears in his eyes. Then Cameron tells Sarah she?s following up on Dmitri and The Turk, and Sarah tells Derek that Ellison has the hand. She thinks Ellison might know what?s going on. John hands Dr. Silberman?s address to Sarah and hurries out the door to school. She then notices that the tape in her bag is missing. She finds it in John?s VCR. She pushes it in and watches. On the video, inside Pescadero, a DCFS agent puts a document before Sarah. The papers waive all parental rights to John. Sarah signs. At the breakfast table, Cameron and Derek stare at each other. Cameron eats a piece of pancake, then pushes the plate away. Derek says she might have fooled the Connors, but she isn?t fooling him.\n\nEllison finds Dr. Silberman working in his yard. Silberman invites Ellison in for tea. The two sit and talk about Sarah and what she said inside Pescadero. Suddenly, Ellison gets dizzy and falls to the floor. When he awakens, he finds that Silberman has tied him to a chair. Silberman explains that he believes Ellison is from the future and may be a Terminator. Silberman finds a small knife and forces it deep into Ellison?s leg. Ellison screams in pain, proving to Silberman that Ellison is in fact not a Terminator. Silberman crudely tourniquets Ellison?s wound. Silberman speaks like a mad man about the apocalypse, and recalls when the T-101 (from Terminator 2: Judgement Day) came to Pescadero to save Sarah. Ellison listens closely and asks him more questions about the day Sarah escaped. Ellison tells Silberman that he came for his help, and that he, Ellison, could prove that Sarah wasn?t crazy. Silberman opens the trunk of Ellison?s car and finds the T-888?s hand inside a cooler. Silberman knows the hand must be destroyed, and then he drugs Ellison. Silberman douses his home with gasoline, and Ellison is trapped inside. Silberman leaves the house, taking the T-888 hand with him. Sarah intercepts Silberman, punches him in the face, and takes the hand. The house begins to explode and Sarah hears a scream from inside the house. Later, as rain pours on Silberman, Ellison, now freed, kicks him away and demands the hand. Silberman says Sarah took it and begins laughing like a maniac. Later, Agent Ellison watches as guards lock Silberman into a cell in Pescadero. He screams like a mad man about the apocalypse and the machines, but his cries fade out in the background as Ellison walks away from the cell.\n\nWhen Cameron returns to the ballet studio, she watches Maria Shipkov dance from the doorway. She engages Maria in conversation and asks about her brother. The Russian gangster from before walks in. Cameron steps in, and kicks the man to the ground. Cameron tells an astonished Maria that she?s looking for Dmitri, and that she can help him. Maria takes Cameron to Dmitri?s hotel room. Cameron asks Dmitri what happened to The Turk. When he refuses to answer, Cameron offers him a diamond. He takes the diamond and says that a man came and offered him cash for The Turk. Dmitri sabotaged The Turk by programming it to throw the chess match so that the man could take the machine. Dmitri gives Cameron a piece of paper that supposedly says who has the Turk, or at least who took it. Cameron takes the paper from Dmitri, then leaves. She passes two armed men on the way out (supposedly the gangster&amp;#039;s henchmen.) They kick open Dmitri&amp;#039;s door and Cameron walks out of the hotel with the sound of gunfire and screams coming from Dmitri&amp;#039;s hotel room.\n\nJohn hands Derek some clean shirts and tells Derek that he bounced from home to home while Sarah was in Pescadero. Derek tells John that being locked behind four walls can change how a person thinks.\n\nSarah asks Cameron about The Turk, and about Shipkov. Cameron gives Sarah the paper Dmitri gave her, and tells her that Shipkov and his sister are both dead. Sarah asks Cameron if she killed them, but Cameron tells Sarah that she is not the one who killed them. Sarah continues into John?s room and tells him that she was going to destroy the tape and that she didn?t want him to see it. She asks him if he noticed the date on the tape. John says it was the date Sarah gave up being his mother. Sarah replies that it was the date she broke out of Pescadero. Sometime later, Sarah places the hand in thermite, and destroys it. In the backyard, Derek is enjoying a moment of peace until Sarah arrives. She confirms to Derek that Kyle is indeed dead and promises to take him to where he is buried.\n\nDr. Silberman&amp;#039;s words have begun to haunt Ellison, as the agent knows that even though the doctor is mentally ill, he has confirmed the arrival of the future apocalypse led by the machines. Later, Ellison is seen sitting in a Bible reading group, seeking solace with the knowledge he now has.\n\nIt is revealed, in a flashback, that Sarah rescued Ellison from Dr. Silberman&amp;#039;s burning house.\n\nDerek, confused, watches Cameron practicing ballet before a mirror. Chopin&amp;#039;s Nocturne in C-sharp minor (1830) is playing. It is ambiguous whether the music is diegetic or non-diegetic. It is also the same music heard when Derek entered the basement in the previous episode. As Cameron dances, Sarah narrates the closing scene. She says that machines &quot;cannot appreciate beauty, they cannot create art. If they ever learn these things, they won&amp;#039;t have to destroy us. They&amp;#039;ll be us.&quot; In the final frame, we see Derek with a look of disbelief and tears in his eyes as the episode fades out.","torrent":{"xt":"urn:btih:8be6ca7cbf75c2ce65060afdfdaef6703bf9e6f2","amp;dn":"Terminator+-+The+Sarah+Connor+Chronicles+S01E07+-+The+Demon+Hand","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8be6ca7cbf75c2ce65060afdfdaef6703bf9e6f2","infoHashBuffer":{"type":"Buffer","data":[139,230,202,124,191,117,194,206,101,6,10,253,253,174,246,112,59,249,230,242]},"announce":[],"urlList":[]}}