{"title":"Derek And The Dominos - Layla And Other Assorted Love Songs","uid":11900937,"size":111469523,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8c85b822880d0b9a7ffbdb0cd0d691894bbef8db&amp;dn=Derek+And+The+Dominos+-+Layla+And+Other+Assorted+Love+Songs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Noshock","files":16,"time":1431313482,"description":"Derek &amp; The Dominos were the almost fictional group recruited by Eric Clapton which came together during the sessions for George Harrison's All Things Must Pass album in 1970. The band released only this one studio album in December 1970, which has been re-evaluated since its release and is now regarded as one of Clapton's finest recordings and is often considered to be the defining achievement of Clapton's career. The album melded an astounding collection of musical styles - Blues, Folk, R&amp;B and Rock - into one timeless package. It consistently appears in listings of the best rock albums ever recorded, and was finally inducted into the Grammy Hall of Fame in 2000 and continuous to be noticed by critics. This deluxe edition features six exciting performances from what was to be Derek And The Dominos' second album plus all four audio performances from Derek And The Domino's sole, historic television appearance on The Johnny Cash Show, November 9, 1970. Also features two tracks produced by Phil Spector in early summer 1970 and the outtake &quot;Mean Old World&quot;","torrent":{"xt":"urn:btih:8c85b822880d0b9a7ffbdb0cd0d691894bbef8db","amp;dn":"Derek+And+The+Dominos+-+Layla+And+Other+Assorted+Love+Songs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c85b822880d0b9a7ffbdb0cd0d691894bbef8db","infoHashBuffer":{"type":"Buffer","data":[140,133,184,34,136,13,11,154,127,251,219,12,208,214,145,137,75,190,248,219]},"announce":[],"urlList":[]}}