{"title":"Democracy Now - 27 jan 2012","uid":6990606,"size":458595031,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8f00b8441fc65dc8ccde388b07317a9286711f78&amp;dn=Democracy+Now+-+27+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1327688731,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 27, 2012\n\n- GOP Candidates Spar Over Immigration, Wall Street in Florida Debate\n- Obama Touts Gas Drilling in Vegas\n- Pentagon Boosts Overall Spending Despite Short-Term Cuts\n- Iraq: 22 Killed in Baghdad Bombing\n- Iraq Mulls Legal Action Over Haditha Massacre\n- U.S. Threatens to Stop Egyptian Military Aid Over Stranded Americans\n- Syria: 30 Killed in &quot;Terrifying Massacre&quot;\n- Former Guatemalan Dictator Faces Trial\n- WSF Meets on &quot;Capitalist Crisis, Social and Environmental Justice&quot;\n- Rejecting GOP, Senate Hikes Debt Limit\n- Walker Aides Face New Charges\n- FBI Seeks App to Monitor Social Media; Twitter Can Block Tweets by Country\n\n\nSpecial reports\n\n- Despite Salary Caps, Treasury Approved Lucrative Exec Payouts at Dozens of Bailed-Out Firms\n\nNew York Daily News columnist and Democracy Now! co-host Juan Gonzalez reports the Treasury Department has approved payouts exceeding $5 million for 49 executives at firms that most benefited from the Wall Street bailout. The executives' pay came despite the $500,000 salary cap established under the Troubled Asset Relief Program (TARP).\n\n\n- NYPD Commissioner Ray Kelly Urged to Resign After Police Conceal Role in Anti-Muslim Documentary\n\nRepresentatives from the New York City Muslim community, together with local ethnic and interfaith groups, gathered at City Hall Thursday calling for the resignation of New York City Police Department Commissioner Raymond Kelly and police spokesperson Paul Browne after it was revealed an anti-Muslim film, &quot;The Third Jihad,&quot; was screened to nearly 1,500 officers during training. After initial denials, the NYPD admitted the officers were shown the film in training and that Kelly gave the filmmakers a 90-minute interview. Kelly has now apologized. The controversy comes at a time when relations between the police and the Muslim community are already strained due to recent revelations that the police department has operated a secret surveillance program targeting Muslim neighborhoods. We speak with Arab-American activist Linda Sarsour, who was honored last month at the White House as a &quot;Champion of Change.&quot;\n\n\n- Gingrich's Extremist Anti-Palestinian Stance Follows Millions From Casino Magnate Sheldon Adelson\n\nMany analysts say Newt Gingrich's recent rise in the Republican contest would have been impossible without the backing of one man - multi-billionaire casino mogul Sheldon Adelson. Adelson and his wife have donated $10 million to the pro-Gingrich super PAC, &quot;Winning Our Future,&quot; which has run a series of ads attacking Gingrich's opponent Mitt Romney. Gingrich has openly admitted Adelson's support came down to a single issue: Israel. Gingrich has adopted the most extremist anti-Palestinian stance of the Republican presidential field, calling the Palestinians themselves an &quot;invented&quot; people. We speak with Gal Beckerman of the Jewish Daily Forward and Linda Sarsour of the Arab American Association of New York.\n\n\n- GOPers Claim Softened Immigration Stance in Bid to Win Florida Latino Vote, But Key Issues Ignored\n\nBoth Mitt Romney and Newt Gingrich have been trying to court Florida's Latino voters ahead of next week's primary. Romney has launched Spanish-language ads highlighting Gingrich's remarks in a 2007 speech in which he suggested Spanish was a &quot;language of the ghetto.&quot; Meanwhile Gingrich has released an ad accusing Romney of being the most anti-immigrant candidate in the Republican field. We're joined by Marcos Restrepo, a reporter with the Florida Independent. &quot;The rhetoric that's been coming out about immigrants only worried about immigration - that it's the only issue that really hits home with Latino and Latino voters - that's not true,&quot; Restrepo says. &quot;I live here in South Florida and we are having a hard time with issues such as jobs, unemployment, education and housing.&quot; Restrepo says the candidates should also address the DREAM Act and the free trade agreements with Central and South American nations.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:8f00b8441fc65dc8ccde388b07317a9286711f78","amp;dn":"Democracy+Now+-+27+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f00b8441fc65dc8ccde388b07317a9286711f78","infoHashBuffer":{"type":"Buffer","data":[143,0,184,68,31,198,93,200,204,222,56,139,7,49,122,146,134,113,31,120]},"announce":[],"urlList":[]}}