{"title":"Thomas Sowell-Economic Facts and Fallacies","uid":4944652,"size":562856540,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8fade1567d6334c67e54028af5cf0dbf5e9f0f41&amp;dn=Thomas+Sowell-Economic+Facts+and+Fallacies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jwhitt62","files":16,"time":1244596928,"description":"Economic Facts and Falacies is designed for people who want to understand economic issues without getting bogged down in economic jargon, graphs, or political rhetoric. Writing in a lively manner that does not require any prior knowledge of economics, Thomas Sowell exposes some of the most popular fallacies about economic issues, including many that are widely disseminated in the media and by politicians: fallacies about urban problems, income differences, male-female economic differences, academia, race, and Third World countries. All of these fallacies have a certain plausibility that gives them their staying power, which makes it even more important to carefully examine their flaws. Sowell holds these beliefs under the microscope and draws conclusions that are sure to inspire rigorous debate.\n\nThomas Sowell has taught economics at Cornell, UCLA, Amherst, and other academic institutions, and his Basic Economics has been translated into six languages. The honors he has received include the National Humanities Medal, the Bradley Foundation Prize, and honorary degrees from various academic institutions. He is currently a scholar-in-residence at Stanford University's Hoover Institution.","torrent":{"xt":"urn:btih:8fade1567d6334c67e54028af5cf0dbf5e9f0f41","amp;dn":"Thomas+Sowell-Economic+Facts+and+Fallacies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fade1567d6334c67e54028af5cf0dbf5e9f0f41","infoHashBuffer":{"type":"Buffer","data":[143,173,225,86,125,99,52,198,126,84,2,138,245,207,13,191,94,159,15,65]},"announce":[],"urlList":[]}}