{"title":"Adrian Younge Presents the Delfonics [FLAC]","uid":8269839,"size":233050948,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:91b04479a67582e835e873dd0d2e92a908cff695&amp;dn=Adrian+Younge+Presents+the+Delfonics+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1363590830,"description":"Adrian Younge conceived &quot;Turn Down the Sound,&quot; one of the highlights from Venice Dawn's Something About April, as an imagined RZA-produced '60s Delfonics cut. Shortly after the release of that cinematic, psychedelic soul masterpiece, a fan put Younge in touch with the Delfonics' William Hart. The meeting led to this, the best Delfonics album since 1970. It follows four decades of sporadic new recordings, scads of dodgy re-recordings, and multiple performing versions of the group. Hart is the lone Delfonic here, but he has been a driving creative force and lead voice since its inception. The lyrics for eight of the songs were written by him alone. The remainder was composed with Younge, who arranged and produced and handled the majority of the instrumentation -- including but not limited to the bass, drums, electric guitar, electric sitar, vibraphones, glockenspiel, timpani, cello, Fender Rhodes, and his own Mellotron-like Selene -- with some support from Venice Dawn. That includes the softly sighing Saudia Mills (the cover star) and the gutsy yet refined Loren Oden (who shares the lead on &quot;To Be Your One&quot;) in background vocalist roles. Those who know Something About April won't be taken aback by the halting sound and high quality of this set. While neither as dark nor as wild, Adrian Younge Presents the Delfonics still has some of that spookiness, evoking late-'60s sweet soul -- and, on &quot;I Can't Cry No More,&quot; mid-'50s doo wop -- with a European film composer's knack for soul-inspired suspense and an emphasis on deeply resonant drum breaks ripe for sampling. Considering that Hart is approaching his 70th year, it's remarkable that his falsetto remains so powerful and penetratingly bittersweet. The lyrics are expressed with a degree of relatable passion and dejection that is rare among singers less than half Hart's age. Beside Younge, he has reinvented the Delfonics in a way that can reach across generations. Word to City of Carson bail bondsman Max Cherry.","torrent":{"xt":"urn:btih:91b04479a67582e835e873dd0d2e92a908cff695","amp;dn":"Adrian+Younge+Presents+the+Delfonics+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91b04479a67582e835e873dd0d2e92a908cff695","infoHashBuffer":{"type":"Buffer","data":[145,176,68,121,166,117,130,232,53,232,115,221,13,46,146,169,8,207,246,149]},"announce":[],"urlList":[]}}