{"title":"The Roulettes - Stakes And Chips (UK Beat 1963-1966)","uid":5642514,"size":101775384,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:91d198651c076d362023a1d0c55138aa0165c0a8&amp;dn=The+Roulettes+-+Stakes+And+Chips+%28UK+Beat+1963-1966%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":25,"time":1277165189,"description":"The Roulettes - Stakes And Chips (UK Beat 1963-1966)\nCD (1992) To MP3 256 Kbit/s\nIncluded: CD Covers &amp; Info\n\nBiography\tby Bruce Eder\nAn underrated British quartet made up of John Rogan (bass), Russ Ballard (lead guitar), Peter Thorpe (rhythm guitar), and Bob Henrit (drums), the Roulettes featured future Argent alumnus Russ Ballard on lead guitar. They were originally formed as a backing band for vocalist Adam Faith, who enjoyed a massively successful light rock &amp; roll career in the early '60s in England. Beginning in 1963 with the start of the rock &amp; roll explosion coming out of Liverpool, the group was somewhat reorganized, and their and Faith's work together became much more assertive; the result was Faith's last big hit, &quot;The First Time,&quot; in August of 1963.\n\nThe group began recording on their own for EMI in late 1963 and revealed themselves as an above-average group, fully competitive on a musical level with acts like the Searchers and the Hollies. Their records, though fewer in number, display many of the same virtues found on the better-known work of the Beatles and the Searchers, including soaring harmonies behind strong lead vocals, crisp guitar playing, and a good ear for memorable hooks. Ballard and Henrit also appeared on &quot;Concrete and Clay,&quot; a major hit for the acoustic rock outfit Unit Four Plus Two, but the Roulettes' own records stubbornly failed to make the charts. By 1965, they'd split with Adam Faith, but the concentration on their own careers didn't change the inexplicably lackluster performance of their records.\n\nThe group soldiered on through 1967 without any chart success, playing shows on the European continent, where any good British rock band could still earn a decent living. Finally, Ballard and Henrit joined Unit Four Plus Two, while Thorpe and Rogan left the music business. Following the breakup of Unit Four Plus Two in 1968, Ballard and Henrit hooked up with Rod Argent and Chris White, late of the Zombies, and formed Argent, a quartet that, for a brief time in the early 1970s, enjoyed some of the chart success that had eluded the Roulettes throughout their history. \n\nReview\tby Bruce Eder\nThe definitive Roulettes collection, 22 songs covering the group's entire recorded history, with more highlights than one would expect to find. &quot;Bad Time,&quot; &quot;I'll Remember Tonight&quot; (which is more familiar to Americans in its cover version by the Mugwumps), &quot;Stubborn Kind of Fellow,&quot; and &quot;I Hope He Breaks Your Heart&quot; are priceless, and most of the rest isn't far behind. The sound is excellent, and the notes are entertaining and wonderfully detailed. \n\nTracklist:\n01. Bad Time  (Andrews) - 1965\n02. What You Gonna Do?  (Ballard, Henrit) - 1965\n03. Settle Down  (Settle) - 1965\n04. Taste Of Honey  (Marlow, Scott) - 1965\n05. Find Out The Truth  (Rogan, Thorpe) - 1965\n06. I'll Remember Tonight  (Andrews) - 1965\n07. You Don't Love Me  (Andrews) - 1965\n08. Stubborn Kind Of Fellow  (Gaye, Stevenson) - 1965\n09. I Hope He Breaks Your Heart \t(Sedaka) - 1965\n10. I Can't Think Of Anyone Else  (Rogan, Thorpe) - 1965\n11. Shake  (Cooke) - 1965\n12. Soon You'll Be Leaving Me  (Andrews) - 1965\n13. Me Body  (Ballard) - 1965\n14. This Little Girl  (Cosby, Holland, Stevenson) - 1965\n15. Can You Go?  (Andrews) - 1964\n16. Tell Tale Tit  (Adams, Barnes) - 1963\n17. The Long Cigarette  (Moeller, Parker) - 1965\n18. Junk  (Roulettes) - 1965\n19. Jackpot  (Roulettes) - 1966\n20. Yesterday, Today And Tomorrow  (Roulettes) - 1966\n21. Tracks Of My Tears  (Moore, Robinson, Tarplin) - 1965\n22. I Can't Stop  (Lindsey) - 1966\n\nMembers\nBrian Parker - guitar (born 1940, Cheshunt, Hertfordshire)\nJohn Rogers - bass guitar (until May 1963 when he was killed in a car crash) Hertfordshire\nJohn 'Mod' Rogan - bass guitar 1963 - 1967 (born 3 February 1944, Hartlepool, County Durham)\nPeter Thorpe - rhythm guitar (born 25 May 1944, Wimbledon, South London)\nBob Henrit - Drums (born Robert John Henrit, 2 May 1944, Broxbourne, Hertfordshire)\nRuss Ballard - lead guitar (born Russell Glyn Ballard, 31 October 1945, Waltham Cross, Hertfordshire)\n\nSee my other Torrents: &lt;a href=&quot; http://thepiratebay.se/user/Iron_Horse/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/Iron_Horse/&lt;/a&gt;","torrent":{"xt":"urn:btih:91d198651c076d362023a1d0c55138aa0165c0a8","amp;dn":"The+Roulettes+-+Stakes+And+Chips+%28UK+Beat+1963-1966%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91d198651c076d362023a1d0c55138aa0165c0a8","infoHashBuffer":{"type":"Buffer","data":[145,209,152,101,28,7,109,54,32,35,161,208,197,81,56,170,1,101,192,168]},"announce":[],"urlList":[]}}