{"title":"The Creeper + Appearances","uid":4884498,"size":3233581129,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:92d0349bf02f2d6e1a983b3a307dc9d45a652a83&amp;dn=The+Creeper+%2B+Appearances&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1241573875,"description":"&quot;The world has more than its share of troublemakers, tormentors and terrorists! And perhaps not quite enough forces of courage, strength and justice to combat them. But now - a new force against evil is about to make its presence felt. A unique power, embodied in a remarkable character, and dedicated to the defeat of the destroyers. A man thrust accidentally into a dynamic destiny - and who accepts the explosive challenge. For it is he who will defy those destroyers, and make them Beware the Creeper! HAHAHAHAHAHAHAHAHAHAHAHAHA!!!&quot;\n\nThe Creeper has had a number of different origins over the years but originally Jack Ryder, an outspoken television newscaster, became the Creeper when he was powered with a serum given to him by Doctor Vincent Yatz, a scientist being hunted by the mob. The serum gave him enhanced strength and agility, and a second mechanical device allowed him to phase his costume in and out from his surroundings, so he could become the Creeper almost at will. Ryder chose a cackling and maniacal facade to frighten criminals.\n\nThe Creeper was created by Steve Ditko with scripter Don Segall and first appeared in Showcase #73 (April 1968) and then went on to star in his own six-issue series, Beware The Creeper.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:92d0349bf02f2d6e1a983b3a307dc9d45a652a83","amp;dn":"The+Creeper+%2B+Appearances","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d0349bf02f2d6e1a983b3a307dc9d45a652a83","infoHashBuffer":{"type":"Buffer","data":[146,208,52,155,240,47,45,110,26,152,59,58,48,125,201,212,90,101,42,131]},"announce":[],"urlList":[]}}