{"title":"Van Halen - Loss of Control [promo] (vhs).VOB","uid":10983179,"size":147451904,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:93e0d94c77911791d5670a66f9b3eb5513d6a96e&amp;dn=Van+Halen+-+Loss+of+Control+%5Bpromo%5D+%28vhs%29.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1409885431,"description":"Van Halen - Loss of Control [promo] (vhs).VOB\n\n\nHQ rare promo music video from a promo vhs tape with HQ audio (sounds too good to be from a vhs tape). &quot;Loss of Control&quot; is a song from Women and Children First, the third studio album by American hard rock band Van Halen, released on March 26, 1980 on Warner Bros. Records. Produced by Ted Templeman, it was the first to feature compositions written solely by the band, and is described by critic Stephen Thomas Erlewine as &quot;[the] record where the group started to get heavier, both sonically and, to a lesser extent, thematically.&quot;\n\nThe album is somewhat different from their first two albums in the way that it features more studio overdubs, and less emphasis on backing vocals. &quot;Could This Be Magic?&quot;, conversely, contains the only female backing vocal ever recorded for a Van Halen song; Nicolette Larson sings during some of the choruses. The rain sound in the background is not an effect. It was raining outside, and they decided to record the sound in stereo using two Neuman KM84 microphones, and added it to the track.\n\nKerrang! magazine listed the album at #30 among the &quot;100 Greatest Heavy Metal Albums of All Time&quot;.\n\nIn the band's licensed game, Guitar Hero: Van Halen, four of the nine tracks of this album are available for play: &quot;And the Cradle Will Rock...,&quot; &quot;Everybody Wants Some!!,&quot; &quot;Romeo Delight,&quot; and &quot;Loss of Control.&quot;\n\n\nVan Halen is an American rock band formed in Pasadena, California, in 1972. From 1974 until 1985, the band comprised guitarist Eddie Van Halen, vocalist David Lee Roth, drummer Alex Van Halen and bassist Michael Anthony.\n\nBy the early 1980s they were one of the most successful rock acts of the time. 1984 was their most successful album. The lead single, &quot;Jump&quot;, became an international hit and their only single to reach number one on the Billboard Hot 100. The following singles, &quot;Panama&quot; and &quot;I'll Wait&quot;, both hit number 13 on the US charts. The album went on to sell over 12 million copies in the US alone.\n\nVan Halen achieved worldwide fame for their many popular songs and larger-than-life stage performances; unfortunately, they also became known for the drama surrounding the departures of former members. Controversy surrounded the band following the exits of Roth, Hagar,and Anthony; this controversy often included numerous conflicting press statements between the former members and the band. In 2007, Van Halen was inducted into the Rock and Roll Hall of Fame. VH1 ranked them 7th on their list of the top 100 hard rock artists of all time.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Women_and_Children_First&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Women_and_Children_First&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/daaMgaagD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/daaMgaagD&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps    \n   Duration: 00:03:08\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.6\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:93e0d94c77911791d5670a66f9b3eb5513d6a96e","amp;dn":"Van+Halen+-+Loss+of+Control+%5Bpromo%5D+%28vhs%29.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93e0d94c77911791d5670a66f9b3eb5513d6a96e","infoHashBuffer":{"type":"Buffer","data":[147,224,217,76,119,145,23,145,213,103,10,102,249,179,235,85,19,214,169,110]},"announce":[],"urlList":[]}}