{"title":"Cannon Busters (00 - 01 + Extra) (2004 - 2005)","uid":11407113,"size":19174240,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:95f4eb271cfaf46656c658387dcba9b178211e27&amp;dn=Cannon+Busters+%2800+-+01+%2B+Extra%29+%282004+-+2005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nemesis43","files":3,"time":1415488333,"description":"Cannon Busters (00 - 01 + Extra) (2004 - 2005)\n\n\nIn this first action-packed issue of the new bi-monthly mini series, we start off on Gear Bolt, a vast land composed entirely of a monstrous, constantly rotating clock gear. In the progressive, hi-tech Kingdom of Botica, it's the anniversary of the &quot;New Deal,&quot; a peace treaty unifying the only 5 kingdoms of Gear Bolt, and everyone who is anyone is in attendance! We meet Samberry, a royal assistance droid who secretly shares a close bond with the son of King Bulger, and heir to the Botica throne, Prince Toji. The celebration is brought to a shattering halt when the Kingdom suddenly comes under attack by a mysterious sorcerer known only as LOCK and his minions, who are in search of a mysterious &quot;device&quot; that he claims the King is hiding. The attack leaves Sam separated from the prince, alone on the outskirts of the kingdom for the first time ever. In a place where magic is extinct, will there be a force to challenge LOCK? Will Sam survive and find her way back to Prince Toji? The epic saga of a robot's quest back home starts here in this first spectacular, action-packed issue!\nThe Epic saga - totalling one issue - not so epic really!!","torrent":{"xt":"urn:btih:95f4eb271cfaf46656c658387dcba9b178211e27","amp;dn":"Cannon+Busters+%2800+-+01+%2B+Extra%29+%282004+-+2005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f4eb271cfaf46656c658387dcba9b178211e27","infoHashBuffer":{"type":"Buffer","data":[149,244,235,39,28,250,244,102,86,198,88,56,125,203,169,177,120,33,30,39]},"announce":[],"urlList":[]}}