{"title":"I Moved Your Cheese - epub","uid":9421835,"size":1774913,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97385fa7f3a4a485c20fbb9524009eb56abc5f6b&amp;dn=I+Moved+Your+Cheese+-+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1388603453,"description":"I Moved Your Cheese: For Those Who Refuse to Live as Mice in Someone Else's Maze\n\nOverview:\n\nIf you were a mouse trapped in a maze and someone kept moving the cheese, what would you do?\n\nOver a decade ago the bestselling business fable Who Moved My Cheese? offered its answer to this question: accept that change is inevitable and beyond your control, don?t waste your time wondering why things are the way they are, keep your head down and start looking for the cheese.\n\nBut success in the areas of innovation, entrepreneurship, creativity, leadership, and business growth?as well as personal growth?depends on the ability to push the boundaries, reshape the environment, and play by a different set of rules: our own. With that in mind, Harvard Business School professor Deepak Malhotra offers a radically different answer to this question.?Malhotra tells an inspiring story about three unique and adventurous mice?Max, Big, and Zed?who refuse to accept their reality as given. As we watch their lives unfold and intersect, we discover that instead of just blindly chasing after the cheese, each of us has the ability to escape the maze or even reconfigure it to our liking.....\n\nGenre :  Business\n","torrent":{"xt":"urn:btih:97385fa7f3a4a485c20fbb9524009eb56abc5f6b","amp;dn":"I+Moved+Your+Cheese+-+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97385fa7f3a4a485c20fbb9524009eb56abc5f6b","infoHashBuffer":{"type":"Buffer","data":[151,56,95,167,243,164,164,133,194,15,187,149,36,0,158,181,106,188,95,107]},"announce":[],"urlList":[]}}