{"title":"The Headmaster's Wager by Vincent Lam","uid":8355341,"size":2490532,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9751752a84b9707e2ad0a0cb4c2274e4f15227f2&amp;dn=The+Headmaster%27s+Wager+by+Vincent+Lam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NewSky000","files":2,"time":1365477694,"description":"Title: The Headmaster's Wager\n\nAuthor: Vince Lam\n\nBook(s): 1\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Historical Fiction, Contemporary, Warfare\n\nSummary:\n\nFrom Giller Prize winner, internationally acclaimed, and bestselling author Vincent Lam comes a superbly crafted, highly suspenseful, and deeply affecting novel set against the turmoil of the Vietnam War.\n \nPercival Chen is the headmaster of the most respected English school in Saigon. He is also a bon vivant, a compulsive gambler and an incorrigible womanizer. He is well accustomed to bribing a forever-changing list of government officials in order to maintain the elite status of the Chen Academy. He is fiercely proud of his Chinese heritage, and quick to spot the business opportunities rife in a divided country. He devotedly ignores all news of the fighting that swirls around him, choosing instead to read the faces of his opponents at high-stakes mahjong tables. But when his only son gets in trouble with the Vietnamese authorities, Percival faces the limits of his connections and wealth and is forced to send him away. In the loneliness that follows, Percival finds solace in Jacqueline, a beautiful woman of mixed French and Vietnamese heritage, and Laing Jai, a son born to them on the eve of the Tet offensive. Percival's new-found happiness is precarious, and as the complexities of war encroach further and further into his world, he must confront the tragedy of all he has refused to see.\n \nBlessed with intriguingly flawed characters moving through a richly drawn historical and physical landscape, The Headmaster's Wager is a riveting story of love, betrayal and sacrifice. - Goodreads Summary\n\nNote: For an older audience, and contains many mature themes and such that may not be of suit to every reader. Reader discretion is advised. Recommendable for those who enjoy books about warfare and betrayal.\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\nMetadata: Yes\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:9751752a84b9707e2ad0a0cb4c2274e4f15227f2","amp;dn":"The+Headmaster%27s+Wager+by+Vincent+Lam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9751752a84b9707e2ad0a0cb4c2274e4f15227f2","infoHashBuffer":{"type":"Buffer","data":[151,81,117,42,132,185,112,126,42,208,160,203,76,34,116,228,241,82,39,242]},"announce":[],"urlList":[]}}