{"title":"Are You Afraid of the Dark - The Tale of Orpheo's Curse","uid":4176913,"size":595270791,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:97cf0e8e544399056078b065f96c7f68d78bde12&amp;dn=Are+You+Afraid+of+the+Dark+-+The+Tale+of+Orpheo%5C%27s+Curse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"marinlover","files":5,"time":1210185242,"description":"This is an old game starring you as a potential member of &quot;The Midnight Society&quot; from the old and popular Nickelodeon show &quot;Are You Afraid of the Dark?&quot; The premise of the game is that you are telling a story about the haunted Orpheo&amp;#039;s Palace, a stage in which magic tricks performed on stage are doomed to always go wrong. Players take on the role of Terry and her brother Alex and solve the mysteries of the haunted studio while avoiding obstacles and traps set up to trap your characters in the palace forever. \n\nThis game is apparently very rare, as I have never found a torrent of it before my own. I owned the game when I was young and never beat it, so I really wanted to get an old copy somewhere. When I finally did, I felt the need to share it with the rest of the world. The game has a lot of nostalgic value for folks of my generation (people born in the mid-to-late 80&amp;#039;s) and plays like Myst and other games of that sort, in which you point and click to move around as opposed to a full-3D environment. If you&amp;#039;re looking for awesome graphics, this game is NOT for you. The storyline itself is what this game is about. The game manual is included on the disk for more information.\n\nThis is a DOS game that will not run in Windows XP or Vista without emulation via a free program, DOSBOX (installer included). Minor configuration may be necessary, but my configuration seems to work perfectly on most Vista systems. I haven&amp;#039;t tried with XP, however the configuration should remain the same regardless of OS. I was unable to make the game run under WINE in Ubuntu Linux, however DOSBox is available in Linux as well and configuration should also be the same, as far as I can tell.\n\nAlso, please read &quot;README.txt&quot; after downloading torrent in order to set up properly. I will not be available to answer questions as I am a college student, so you&amp;#039;re on your own. Setup is easy, and experienced PC users should have no trouble with making this old, but rare game work.\n\nNOTE:\nDo not enable fullscreen in .conf file! Some configurations will tell you to do this, however it made the game nearly unplayable for me, as the graphics were distorted and I was unable to leave fullscreen mode once DOSBox has loaded. Enable fullscreen after loading game in DOSBox by pressing &quot;Alt+Enter&quot;.","torrent":{"xt":"urn:btih:97cf0e8e544399056078b065f96c7f68d78bde12","amp;dn":"Are+You+Afraid+of+the+Dark+-+The+Tale+of+Orpheo%5C%27s+Curse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97cf0e8e544399056078b065f96c7f68d78bde12","infoHashBuffer":{"type":"Buffer","data":[151,207,14,142,84,67,153,5,96,120,176,101,249,108,127,104,215,139,222,18]},"announce":[],"urlList":[]}}