{"title":"Wes Montgomery - Willow Weep For Me (1965) [Jazz][mp3 320][schon","uid":5702411,"size":106004861,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:97ee55c5258a01e027f9d930f67fc7170de6b5a8&amp;dn=Wes+Montgomery+-+Willow+Weep+For+Me+%281965%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":12,"time":1279556024,"description":"Wes Montgomery - Willow Weep For Me \nOriginal: 1965\nAudio CD: April 23, 2002\nFormat: Original recording remastered \nLabel: Umvd Labels \nQuality: mp3 320 kbps\n\nPrincipally recorded live at the Half Note, New York, New York in June 1965. Includes liner notes by Richard Lamb.\n\nShortly after Wes Montgomery's shockingly early death, Verve rummaged around in the vaults and came up with some additional tapes from the live Smokin' at the Half Note sessions with the Kind of Blue rhythm section, Wynton Kelly, Paul Chambers, and Jimmy Cobb. And then after-the-fact producer Esmond Edwards did a controversial thing -- he commissioned Claus Ogerman, the arranger on Tequila, to overdub wind and brass arrangements on four tracks: the title tune, &quot;Portrait of Jennie,&quot; &quot;Oh! You Crazy Moon,&quot; and &quot;Misty.&quot; The critics promptly pounced on Verve, NARAS responded by giving the album a Grammy, and the whole issue became moot when subsequent reissues of the four tracks erased the new backing charts. Yet on the whole, Ogerman did a good job; his arrangements are subtle and, in the case of the title track, swinging, with the flutes adding effective responses within Montgomery's statements of the theme. &quot;Impressions,&quot; oddly enough, was left alone -- perhaps due to its lightning tempo -- and this classic solo has since been reissued many times as the prime example of Montgomery in his Verve period. &quot;Surrey with the Fringe on Top&quot; and an alternate take of &quot;Four on Six&quot; (with a bad edit cutting off Kelly's solo in mid-flight) are also free of orchestrations. In any case, what you will hear, bathed in winds or not, is prime, mature Wes Montgomery stretching out in full, with unbelievable confidence in his ear and technique at all times, experimenting now and then with mild electronic effects devices. The sound is oddly dim and shallow on the LP, which is surprising since the Smokln' album sounded so good. ~ Richard S. Ginell\n\nWes Montgomery's thumbed octave strumming adds original surprises to the good range of upbeat and downbeat selections found on this ablum. Hard to find in stores, grab it while you can in any form you can find it - import or domestic. I've sampled a few other Montgomery albums (my other favorite being The Incredible Jazz Guitar of Wes Montgomery) but this has the best mood. The last three tunes are devine! His lilting, slow vibrato phrasing in tunes like &quot;Oh! You Crazy Moon&quot; and &quot;Misty&quot; make this a winning selection for those who like a little blue in their jazz. And the impeccable up-tempo &quot;Four on Six&quot; may just be one of the best works of this early jazz master. ~ Keith Simonsen\n\nPersonnel:\nWes Montgomery (guitar)\nWynton Kelly (piano)\nPaul Chambers (bass)\nJimmy Cobb (drums)\n\nWes Montgomery - Willow Weep For Me Tracks:\n01  Willow Weep For Me\n02  Impressions\n03  Portrait Of Jennie\n04  Surrey With The Fringe On Top\n05  Oh! You Crazy Moon\n06  Four On Six\n07  Misty","torrent":{"xt":"urn:btih:97ee55c5258a01e027f9d930f67fc7170de6b5a8","amp;dn":"Wes+Montgomery+-+Willow+Weep+For+Me+%281965%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97ee55c5258a01e027f9d930f67fc7170de6b5a8","infoHashBuffer":{"type":"Buffer","data":[151,238,85,197,37,138,1,224,39,249,217,48,246,127,199,23,13,230,181,168]},"announce":[],"urlList":[]}}