{"title":"How Would You Move Mount Fuji? Microsoft's Cult of the Puzzle","uid":8009234,"size":4872991,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9804f2df4e2a5e648167305e6a0fd3ccc4e03524&amp;dn=How+Would+You+Move+Mount+Fuji%3F+Microsoft%27s+Cult+of+the+Puzzle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1357960523,"description":"William Poundstone, &quot;How Would You Move Mount Fuji? Microsoft's Cult of the Puzzle - How the World's Smartest Company Selects the Most Creative Thinkers&quot;\n2004 | ISBN: 0316778494, 0316919160 | EPUB, MOBI, PDF | 288 pages | 4,6 MB\n\nFor years, Microsoft and other high-tech companies have been posing riddles and logic puzzles like these in their notoriously grueling job interviews. Now &quot;puzzle interviews&quot; have become a hot new trend in hiring. From Wall Street to Silicon Valley, employers are using tough and tricky questions to gauge job candidates' intelligence, imagination, and problem-solving ability -- qualities needed to survive in today's hypercompetitive global marketplace. For the first time, William Poundstone reveals the toughest questions used at Microsoft and other Fortune 500 companies -- and supplies the answers. He traces the rise and controversial fall of employer-mandated IQ tests, the peculiar obsessions of Bill Gates (who plays jigsaw puzzles as a competitive sport), the sadistic mind games of Wall Street (which reportedly led one job seeker to smash a forty-third-story window), and the bizarre excesses of today's hiring managers (who may start off your interview with a box of Legos or a game of virtual Russian roulette). How Would You Move Mount Fuji? is an indispensable book for anyone in business. Managers seeking the most talented employees will learn to incorporate puzzle interviews in their search for the top candidates. Job seekers will discover how to tackle even the most brain-busting questions, and gain the advantage that could win the job of a lifetime. And anyone who has ever dreamed of going up against the best minds in business may discover that these puzzles are simply a lot of fun. Why are beer cans tapered on the end, anyway?","torrent":{"xt":"urn:btih:9804f2df4e2a5e648167305e6a0fd3ccc4e03524","amp;dn":"How+Would+You+Move+Mount+Fuji%3F+Microsoft%27s+Cult+of+the+Puzzle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9804f2df4e2a5e648167305e6a0fd3ccc4e03524","infoHashBuffer":{"type":"Buffer","data":[152,4,242,223,78,42,94,100,129,103,48,94,106,15,211,204,196,224,53,36]},"announce":[],"urlList":[]}}