{"title":"NMR Spectroscopy - Basic Principles, Concepts and Applications i","uid":14707726,"size":12364868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98274e58750b658394bfa461ed8a9db4c96d93fa&amp;dn=NMR+Spectroscopy+-+Basic+Principles%2C+Concepts+and+Applications+i&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464380740,"description":"NMR Spectroscopy - Basic Principles, Concepts and Applications in Chemistry - Harald Gunther (Wiley-VCH, 2013).pdf\r\n\r\nISBN 978-3-527-33004-1\r\n\r\nNuclear magnetic resonance (NMR) spectroscopy is one of the most powerful and widely used techniques in chemical research for investigating structures and dynamics of molecules. Advanced methods can even be utilized for structure determinations of biopolymers, for example proteins or nucleic acids. NMR is also used in medicine for magnetic resonance imaging (MRI). The method is based on spectral lines of different atomic nuclei that are excited when a strong magnetic field and a radiofrequency transmitter are applied. The method is very sensitive to the features of molecular structure because also the neighboring atoms influence the signals from individual nuclei and this is\r\nimportant for determining the 3D-structure of molecules.\r\n\r\nThis new edition of the popular classic has a clear style and a highly practical, mostly non-mathematical approach. Many examples are taken from organic and organometallic chemistry, making this book an invaluable guide to undergraduate and graduate students of organic chemistry, biochemistry, spectroscopy or physical chemistry, and to researchers using this well-established and extremely important technique. Problems and solutions are included","torrent":{"xt":"urn:btih:98274e58750b658394bfa461ed8a9db4c96d93fa","amp;dn":"NMR+Spectroscopy+-+Basic+Principles%2C+Concepts+and+Applications+i","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98274e58750b658394bfa461ed8a9db4c96d93fa","infoHashBuffer":{"type":"Buffer","data":[152,39,78,88,117,11,101,131,148,191,164,97,237,138,157,180,201,109,147,250]},"announce":[],"urlList":[]}}