{"title":"Triumph  des Willens / Triumph of the Will","uid":3725065,"size":1818480316,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9894133298e7431c38d4b066d1b71da2af9ef43c&amp;dn=Triumph++des+Willens+%2F+Triumph+of+the+Will&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"k0nsl","files":1,"time":1182893302,"description":"~ re-seed ~\n\nMuch can (and has) been said with regard to the films directed by Leni Riefenstahl which were commissioned by Adolf Hitler and the National Socialist (&quot;Nazi&quot;) Party, however, only minimal attention will be given to these films here on this site. While the essential facts and outlines of these three particular films will be provided as a handy reference for students and other researchers, detailed information relating to the NSDAP films abounds (particularly with regard to Triumph des Willens) on the internet, in print, as well as on video, and these films are also now readily available for viewing and study both on VHS and DVD.\n\nWhile Leni&amp;#039;s Rising Star wishes neither to gloss over nor minimize the impact of these films in any way, in a similar regard it is also not the purpose of this site to celebrate them. Their relevance to Leni Riefenstahl&amp;#039;s life and to world history is undeniable, and thus the information provided here is given as a matter of course ? perhaps even what some might regard as a matter of accountability ? however, the purpose of this site is to instead call attention to the rest of Leni Riefenstahl&amp;#039;s career on the silver screen (in particular her early films ? and hence how the name of this site arose), to help bring a better understanding of what Leni Riefenstahl, as an actress and film maker, and, indeed, as a person, was about, where her heart truly lay, what it was that she truly lived for, and what it was that she longed for. And perhaps, through that, a deeper understanding of even the NSDAP films might also be achieved.\n &lt;a href=&quot;\nhttp://www.riefenstahl.org/director/1935/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.riefenstahl.org/director/1935/&lt;/a&gt;","torrent":{"xt":"urn:btih:9894133298e7431c38d4b066d1b71da2af9ef43c","amp;dn":"Triumph++des+Willens+%2F+Triumph+of+the+Will","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9894133298e7431c38d4b066d1b71da2af9ef43c","infoHashBuffer":{"type":"Buffer","data":[152,148,19,50,152,231,67,28,56,212,176,102,209,183,29,162,175,158,244,60]},"announce":[],"urlList":[]}}