{"title":"J.D. Robb - Eve Dallas 19 - Imitation in Death-viny","uid":6426384,"size":1515143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98f75f5331594ae5283031c2aea54acd567fe1e3&amp;dn=J.D.+Robb+-+Eve+Dallas+19+-+Imitation+in+Death-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306492026,"description":"J.D. Robb - Eve Dallas 19 - Imitation in Death-viny\n\nPolice Lieutenant Eve Dallas encounters one of her most difficult cases in this latest offering from J. D. Robb, alter ego of bestselling author Nora Roberts. With the very first victim, Eve realizes that the killer stalking the streets of New York City isn't a run-of-the-mill serial murderer. The copycat executions are imitating the methods and victim choices of an ominous list of notorious serial killers, beginning with Jack the Ripper. And when the killer leaves a distinctive note at the crime scene, it's clear that he's targeting Eve personally--a fact that worries Roarke, Eve's shrewd husband.\n\nAssisted by her aide, Peabody, Eve compiles a list of suspects that includes several high-profile possibilities. Their very prominence, however, complicates the investigation, for they have the power and influence to make the search difficult. All of the suspects are reluctant to cooperate but one of them is playing with Eve like a cat with a mouse by tempting her with crime scene notes and challenging her to find him. Can Eve stop him before he slaughters again? Or will his next victim be Eve herself?\n\nAuthor Robb, a.k.a. Roberts, doesn't miss a beat in this police procedural thriller. The futuristic setting is rich with imaginative details; the cast of supporting characters offers an intriguing variety, while Eve and Roarke's relationship is layered with emotional intimacy and spiced with sex. Whether you're a faithful follower or new to the series, you won't be disappointed in the edge-of-the-seat suspense in Imitation In Death. Don't miss this one.","torrent":{"xt":"urn:btih:98f75f5331594ae5283031c2aea54acd567fe1e3","amp;dn":"J.D.+Robb+-+Eve+Dallas+19+-+Imitation+in+Death-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98f75f5331594ae5283031c2aea54acd567fe1e3","infoHashBuffer":{"type":"Buffer","data":[152,247,95,83,49,89,74,229,40,48,49,194,174,165,74,205,86,127,225,227]},"announce":[],"urlList":[]}}