{"title":"Folder Protect v1.9.4 Including Patch [iahq76]","uid":7555339,"size":3870901,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:992c713d878f9055b6d623fac5cdafe343bcfe33&amp;dn=Folder+Protect+v1.9.4+Including+Patch+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":3,"time":1345594684,"description":"Folder ProtectÂ® v1.9.4\n \n\nPowerful Data Protection For Your Data And Information!\n\n \nBest-of-Breed protection for all your files and folders. Block Access, Hide Files, Anti-Delete, &amp; Write-Protect your sensitive files.\n \nOverview\n \nPower protection for your Data-in Use!\n \nFolder Protect is a powerful concept in Data Security. Using Windows Kernel level protection that even works in Safe Mode ensuring complete security of password protected folders, Folder Protect enables you to password protect your folders, files, drives , installed programs, and popular extensions, and lets you set variable access rights. Folder Protect goes beyond normal file locking and encryption by letting you customize your security between making files inaccessible, hidden, delete-proof, or write-protected, with options to set either one of these parameters in conjunction with the other. You can lock, hide, block access, prevent data from being deleted or modified, and mask popular media and document extensions with a single-click. The program can work in complete stealth mode and you can choose an idle time when the data gets protected automatically.\n\n \nKey Benefits\n -Best-of-Breed Data Security Features: Folder Protect password-protects your important folders, files, drives, and programs. Folder Protect offers 'Data in Use' security and lets you protect your files by equipping you with a comprehensive set of Data-in-Use protection tools including Write-protect, Delete-protect, Access-protect, and Hide your data. Additional security features include Safe Mode locking, Stealth Mode, Hotkeys, and Auto-protection.\n -Block Access To Files: Folder Protect can easily block access to files, folders, drives and programs you choose. Make your files accessible without giving away any additional rights to it's contents.\n -Hide Files from Everyone... Except You: Tired of those prying eyes? Simply password-protect folders, files, pictures &amp; videos using Folder Protect's No Visible feature and hide them from all snoopers.\n -Maximum Data Protection: Folder Protect's write protection is quite unique and first of its kind because it lets other users access the files but still doesn't allow them to make changes to them.\n -Delete-Proof Your Files: Folder Protect allows you to Delete-proof your important files. With a single-click password-protection, you can rest assured that your files are protected even from being accidently deleted.\n \nSupported OS:\n \nWindows 7 / Vista / XP (32 / 64-bit)\n \nInstallation Instructions:\n \n1. Install Program.\n2. Run Patch to register application.\n3. Done, Enjoy.\n ","torrent":{"xt":"urn:btih:992c713d878f9055b6d623fac5cdafe343bcfe33","amp;dn":"Folder+Protect+v1.9.4+Including+Patch+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"992c713d878f9055b6d623fac5cdafe343bcfe33","infoHashBuffer":{"type":"Buffer","data":[153,44,113,61,135,143,144,85,182,214,35,250,197,205,175,227,67,188,254,51]},"announce":[],"urlList":[]}}