{"title":"Sons of Tucson - Season 1","uid":6059273,"size":2385546966,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:992f0a53481b1aa0e739cb9de6ebe0412f13e1e2&amp;dn=Sons+of+Tucson+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kolyapakhomov","files":13,"time":1293044655,"description":"Sons of Tucson is a family comedy about three brothers who hire a charming, wayward schemer to stand in as their father when their real one goes to prison. What begins as a business relationship evolves into something more complex and compelling: a family unlike any we've ever seen. The three brothers find their dad-for-hire, Ron Snuffkin (Tyler Labine), at the local sporting good store. Ron will be forced to draw on a wide array of skills and a vast bag of tricks as he steps into the patriarch role to take care of the boys of the Gunderson family. Robby Gunderson, 8, is a loose cannon who doesn't respond well to authority; Gary Gunderson, 11, is a bright and street-savvy leader who is every bit the con man his father is; and Brandon Gunderson, 13, is a gentle free spirit who simply goes along for the ride. Maggie Morales (Natalie Martinez), Robby's second-grade teacher and the object of Ron's affection, might just be the only stable figure in the lives of this quirky quartet. While Sons of Tucson is grounded in the day-to-day challenges of a single-parent home, nothing in the Gunderson household is quite what it seems. An ongoing chess match between Ron and the boys will keep both parties on their toes, as neither side can afford to give up too much power or independence.\n\n1. Pilot\n2. The Break In\n3. The Golden Ticket\n4. Family Album\n5. Chicken Pox\n6. The Debate Trip\n7. Father's Day\n8. Gina\n9. Dog Days of Tucson\n10. Kisses and Beads\n11. Glenn's Birthday\n12. Sally Teel\n13. Ron Quits\n\nEnjoy ","torrent":{"xt":"urn:btih:992f0a53481b1aa0e739cb9de6ebe0412f13e1e2","amp;dn":"Sons+of+Tucson+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"992f0a53481b1aa0e739cb9de6ebe0412f13e1e2","infoHashBuffer":{"type":"Buffer","data":[153,47,10,83,72,27,26,160,231,57,203,157,230,235,224,65,47,19,225,226]},"announce":[],"urlList":[]}}