{"title":"Metallica - Master Of Puppets (1986) WMA320","uid":6065929,"size":141318381,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:99988fd8aa90462d99fb9d3d302107043e70b582&amp;dn=Metallica+-+Master+Of+Puppets+%281986%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1293355432,"description":"THIS is one of the finest albums every produced, not just in the genre of thrash metal. Metallica rocked with their first two albums, but this is the album that I listen to most out of all of them. There is not a single dull moment on this masterpiece of puppetry. All the songs are played with lightning fast precision, and glorious heavy metal power. And yet, 1) The songs clock in mostly between 5-12 minutes long, and 2) Amidst the mayhem of wailing guitars and pounding drums is the sound of melody and classically influenced arrangments and composition. This is largely in part to bassist Cliff Burton, the most classically trained member of the band. Sadly this would be his final album, but if he had to give a final farewell before his sudden and unfortunate death, this album screams with a power that engraves into the listeners' minds, &quot;Cliff was here!&quot; \n-&quot;Battery&quot;: great acoustic intro leading into a maniacal barage of Hetfield's harsh vocals and Ulrich's pounding drums that literally batter their way through your ears.\n\n-&quot;Master of Puppets&quot;: a classic in the truest sense of the word. Like &quot;Battery,&quot; this song is fast, hard, and it beckons with energy the question of who is truly the puppet and who is the puppeteer.\n\n-&quot;The Thing that Should Not Be&quot;: again, a great acoustic intro that leads into a hardcore thrash rhythm.\n\n-&quot;Welcome Home (Sanitarium)&quot;: the lyrics are the real gem here, telling the story of a mental patient from inside the patient's mind. The music is great, but the lyrics can haunt you if you're not careful.\n\n-&quot;Disposable Heroes&quot;: while I may like their later song &quot;One&quot; better in terms of the lyrical device of the soldier's point of view, I still give this one credit since it came first, and let's face it...everything on this album kicks serious arse, including this one.\n\n-&quot;Leper Messiah&quot;: I could say again that this song is fierce in its brutal greatness, but I've been saying that about every other song, so...let's just say this is still yet another great song on this great album.\n\n-&quot;Orion&quot;: great instrumental, with a militaristic march that echoes the gradeur of Wagner, but without being oppressive. This is something for the Metal Militia to use as a warcry.\n\n-&quot;Damage Inc.&quot;: the intro to this song is absolutely incredible. It is my favorite part of the song, and thus that makes it my favorite song on the album. As a closer...it is amazing, and it has to be one of the best songs Metallica ever recorded.\n\nTop-notch production, speed-licks only Hammett and Hetfield could dish out to give Eddie Van Halen a run for his money, and let's face it...like I said, it is a sad, but glorious and powerful farewell to Cliff Burton. He left us too soon. Behold his legacy! DANCE PUPPETS! DANCE! \n\nby Ilker Yucel &quot;Kryptych&quot;\n\nTRACKLIST:\n\n01 - Battery.wma                                  \n02 - Master Of Puppets.wma                        \n03 - The Thing That Should Not Be.wma             \n04 - Welcome Home (Sanitarium).wma                \n05 - Disposable Heroes.wma                        \n06 - Leper Messiah.wma                            \n07 - Orion.wma                                    \n08 - Damage Inc..wma  \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:99988fd8aa90462d99fb9d3d302107043e70b582","amp;dn":"Metallica+-+Master+Of+Puppets+%281986%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99988fd8aa90462d99fb9d3d302107043e70b582","infoHashBuffer":{"type":"Buffer","data":[153,152,143,216,170,144,70,45,153,251,157,61,48,33,7,4,62,112,181,130]},"announce":[],"urlList":[]}}