{"title":"Zeno.Clash.2.Update.v1.02-RELOADED","uid":8502800,"size":2097629373,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:99a575b25f8fd1925aee18b7807a644657a3a5c7&amp;dn=Zeno.Clash.2.Update.v1.02-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mr.Stifmeister","files":-1,"time":1369342047,"description":"\n                                      nERv\n\n\n                    Zeno Clash 2 Update v1.02 (c) ATLUS\n\n      05/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n            - :.......... DISC(S) .. GAME.TYPE ........: Action, Indie\n\n\nNote:\n~~~~~\nCheck the included text file for a list of what's been patched.\nAll previous updates included.\n\n\nGhat's story is far from over: Zeno Clash 2 picks up where the deliciously\nbrazen first game left off.  After 4 years of waiting, the sequel to the\nsurreal first-person brawler brings more variety in combat and levels, and\neven more bizarre storytelling into the beguiling world of Zenozoik.  Join\nforces with your former foe Rimat and battle against scores of angry\ndenizens, preventing their dastardly machinations from being realized.\n\nZeno Clash 2 welcomes new players to the Zeno Clash universe with a new game\nthat will bring them into the universe and fill them in on the backstory.\nReturning players will delight in the connections between the new settings\nand the first adventure. All players will thoroughly enjoy playing a\nfirst-person brawler that provides a rarity in modern gaming: a truly unique\nexperience.\n\nZeno Clash 2 has beefed up its combat engine with precision punch targeting,\nblocking, and high-impact hits that only make the bone-crunching,\nface-rattling fistcuffs more satisfying. The new &quot;Lock-on&quot; function gives\nplayers a wider range of control for dishing out the damage. New RPG\nmechanics will allow Ghat and Rimat to punch harder, defend better, and\nrecruit more powerful allies to aid in their quest. Zeno Clash 2 now\nharnesses the full power of the Unreal III engine to bring the bizarre and\nbeautiful world of Zenozoik to life. ACE Team's boundless imagination brings\ngamers into a universe of surreal foes, fantastic locations, and truly unique\nvisuals that is unlike anything else you will ever play. With the newly added\ndrop-in/drop-out co-op play, Zeno Clash 2 invites you AND a friend to dive\nonce more into the fray!\n\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\n   your game install directory &lt;install&gt;BinariesWin32\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!\n","torrent":{"xt":"urn:btih:99a575b25f8fd1925aee18b7807a644657a3a5c7","amp;dn":"Zeno.Clash.2.Update.v1.02-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99a575b25f8fd1925aee18b7807a644657a3a5c7","infoHashBuffer":{"type":"Buffer","data":[153,165,117,178,95,143,209,146,90,238,24,183,128,122,100,70,87,163,165,199]},"announce":[],"urlList":[]}}