{"title":"[FSX] - VFR Generation X Vol.8 - Scotland: South Part 1of2 [RIP]","uid":7885583,"size":30454654976,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:99f6665b6dd194da16a76ed32394215d494b41c2&amp;dn=%5BFSX%5D+-+VFR+Generation+X+Vol.8+-+Scotland%3A+South+Part+1of2+%5BRIP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rieper45","files":4,"time":1354609657,"description":"VFR Photographic Scenery Generation X for FSX replaces the defaultscenery in FSX with real aerial photography and terrain data, providing youwith a highly realistic, accurate &amp; detailed immersive world. Usingreal aerial photography for scenery means that the views you see from yourvirtual cockpit are literally transformed into the real thing - you see exactlywhat the pilots of the survey aircraft saw when they acquired the aerialphotography. VFR Photographic Scenery Scotland for FSX gives youunsurpassed photographic detail at a high resolution of  0.6/m pixel detail with terrain mesh at 5mwhich replaces your default scenery.\nVFR Generation X: V8 - Scotland South is the 3rd volume in a series of five ultra-high definition photographic sceneries, that will ultimately cover the whole of mainland Scotland and outlying islands. This title covers almost 45,000 sq.Km.  As a result this one title alone requires 54Gb of hard drove space coming on 7 DVD's. What is perhaps the most important aspect of this volume  is the quality of the original photographs from GetMapping. Working with some of the best imagery ever produced Horizon have managed to capture the essence of flying in one of the most stunning areas of the UK. \n\nUnparalleled Terrain detail:\nWith a 5m terrain mesh data from Getmapping's latest aerial surveys, VFR Generation X gives users minute topographic detail that shows every lump and bump - all fully correlated to provide the perfect fit with the aerial photography, adding dramatically to the immersion that this synthetic environment provides.\n\nUltra High-Definition Photographic Scenery:\nWith this volume you can expect ultra-high definition resolution for the entire area.The resolution has been set  0.60cm throughout. The end result is smooth frame rates with exacting detail for your VFR flights.\n\nSpectacular Water Effects:\nThe water bodies have been designed to retain the natural water colours shown by the aerial photography as far as possible, again adding to the scenery's immersion. In addition, they will provide a moving, reflective surface that will allow float aircraft operations, and will even let you see through to sub-surface features like sand bars and underwater channels.\n\nCompatibility with ScotFlight\nTo ensure compatibility with other content for Scotland , Horizon has been coordinating efforts with the talented scenery designers from ScotFlight , who have made all of the airfields and airports  for the same area in stunning 3D with blends for this scenery for a seamless transition.\n\nEnhanced Performance:\nSmooth frame rates with crisp, sharp photographic scenery - VFR Generation X has been specifically designed to optimise performance and reduce the effects of blurry scenery textures, even on lower spec. systems.\n---------------------------------------------------------------------------------\n\n\nNot my own realese. Just found it in another site. For shure there is a lot of people looking for this on TPB.\n","torrent":{"xt":"urn:btih:99f6665b6dd194da16a76ed32394215d494b41c2","amp;dn":"%5BFSX%5D+-+VFR+Generation+X+Vol.8+-+Scotland%3A+South+Part+1of2+%5BRIP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f6665b6dd194da16a76ed32394215d494b41c2","infoHashBuffer":{"type":"Buffer","data":[153,246,102,91,109,209,148,218,22,167,110,211,35,148,33,93,73,75,65,194]},"announce":[],"urlList":[]}}