{"title":"Terminator - The Sarah Connor Chronicles S01E09 - What He Beheld","uid":4199185,"size":366851138,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9a12284184d18011d35f45d9618583fa4f1f79a6&amp;dn=Terminator+-+The+Sarah+Connor+Chronicles+S01E09+-+What+He+Beheld&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Chimera2005","files":1,"time":1211403452,"description":"The episode begins with a flashforward to April 21, 2011. A younger Derek Reese is teaching his brother, Kyle how to play baseball. They are interrupted when they hear nuclear missiles in the sky, signaling the beginning of Judgment Day.\n\nThe episode revolves around Sarah and Derek trying to track down the man who stole The Turk from Andy Goode and purchase it from him. After contacting him, Enrique&amp;#039;s nephew is visited by a man called Sarkissian, who is looking for information on Sarah Connor and reveals to him that his uncle was an FBI informant. Enrique&amp;#039;s nephew denies this. Sarkissian steals a sword and violently slaughters the men guarding him. Sarkissian eventually tracks down Sarah, and reveals to her that he does not intend to sell the Turk, and demands $2-million dollars as opposed to the original $500,000 price in return for his promise not to reveal Sarah Connor to the FBI, informing her that he has men watching Cameron and John, who are on a school field trip. At a science museum, Cameron asks John why he looks upset; he responds that tomorrow is his birthday and that he believes his mom has forgotten it. He then has to explain what a birthday is to Cameron and why they are important; she then asks if she has a birthday. John says that she might actually have a &quot;built day.&quot; Cameron notices someone following them and manages to sneak away from the group before attacking and killing the man, stuffing him inside the trunk of his car. Before leaving, John&amp;#039;s friend Morris approaches Cameron and asks her to the prom; John tells her to say &quot;yes&quot; and she does. John and Cameron head back home and show the corpse to Sarah and Derek; the dead man&amp;#039;s cell phone rings and Cameron uses her voice impersonation ability to answer it. On the other end is the man whom Sarah and Derek met earlier. He says to bring the kids (John and Cameron) over to where he is. The four manage to find Sarkissian&amp;#039;s location and Sarah confronts him when he takes John hostage, but Derek manages to shoot the man through the head after getting the drop on him. Sarkissian&amp;#039;s office shows no sign of The Turk. They do, however, retrieve the hard drive of Sarkissian&amp;#039;s computer, which contains important data.\n\nAgent Ellison resumes the hunt for Sarah Connor, except that he&amp;#039;s more interested in getting information from her about Skynet and its Terminators instead of arresting her. Ellison visits Dixon, who is not sure that he can trust Ellison and so doesn&amp;#039;t reveal Sarah&amp;#039;s whereabouts. However, Dixon mentions another FBI agent who is also trying to find Sarah, Agent Robert Kester. Ellison is baffled about this, because to his knowledge, no one else in the agency is aware that Sarah is alive. He checks FBI records and eventually uncovers enough information to persuade others that not only is Kester not an FBI agent, but is in fact the murderer they&amp;#039;ve been looking for: a man posing as unemployed actor George Lazlo, from the earlier episodes. Ellison secretly realized that the murderer is not human and is one of the cyborgs he&amp;#039;s trying to find. He&amp;#039;s also disturbed by the Terminator&amp;#039;s murderous nature, when Agent Simpson shares his fear after he describes it, calling the killer a monster. Ellison and Agent Greta Simpson assemble a SWAT team to arrest him.\n\nCharley Dixon visits the Connors&amp;#039; home and tells Sarah that Ellison made contact with him and may have realized the truth of her story. Charley suggests Ellison can protect her, which Sarah adamantly denies. She argues that Dixon should take his wife and get away from her family for his own safety.\n\nDerek surprises John by taking him out for ice cream on his birthday. As the two eat their treats in the park, they observe two kids playing baseball. The smaller one is at bat and misses the ball which rolls to John&amp;#039;s feet. He picks it up and hands it over to the boy and after a minute he runs back to his brother, who has &quot;REESE&quot; written on the back of his shirt. The little boy starts pitching again and Derek mentions that &quot;Your father always had a good arm,&quot; then confesses that he knew John was his nephew because of the resemblance as Derek says that every time he looks at John he sees Kyle, and that Sarah was the type of woman Kyle liked. Derek then says, &quot;Happy birthday&quot; to John, who is moved to tears at finally being able to see his father.\n\nAgent Ellison&amp;#039;s team locates &quot;Kester&quot; in George Lazlo&amp;#039;s home. In the battle that follows, set to Johnny Cash&amp;#039;s apocalyptic song &quot;The Man Comes Around&quot;, the entire SWAT team is killed including agent Greta Simpson, leaving Ellison the only survivor of the attack. Cromartie (who is shown with multiple gunshot wounds clearly showing off his metal endoskeleton) mysteriously decides not to shoot Ellison. Dixon arrives at the scene seconds after Cromartie leaves, and is shocked at the sight of dead bodies lying at every turn. As Dixon arrives on the scene, he and Ellison knowingly lock eyes, as Dixon is the only other person there who understands what really happened.\n\nSarah visits John, who does not tell her that Derek knows that he is John&amp;#039;s uncle. Sarah tells John that she didn&amp;#039;t forget about his birthday and Cameron is going to get a cake, and that they&amp;#039;re going to have a big dinner. Just then John, who has been hacking into Sarkissian&amp;#039;s hard drive, finds a picture of a different man identified as Sarkissian, implying that the man Derek shot and killed was somebody else. Meanwhile, as Cameron gets into the car, she notices the real Sarkissian walking away from the house. Just as she turns the ignition the car explodes, leaving Cameron&amp;#039;s fate unknown.","torrent":{"xt":"urn:btih:9a12284184d18011d35f45d9618583fa4f1f79a6","amp;dn":"Terminator+-+The+Sarah+Connor+Chronicles+S01E09+-+What+He+Beheld","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a12284184d18011d35f45d9618583fa4f1f79a6","infoHashBuffer":{"type":"Buffer","data":[154,18,40,65,132,209,128,17,211,95,69,217,97,133,131,250,79,31,121,166]},"announce":[],"urlList":[]}}