{"title":"Grant Hart - Intolerance [1989][EAC,log,cue. FLAC]","uid":8135435,"size":267635301,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9a4ded55ebf11e17909b9dae48b575deb8e89b65&amp;dn=Grant+Hart+-+Intolerance+%5B1989%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":12,"time":1360701959,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Grant Hart\nRelease: Intolerance\nDiscogs: 633870\nReleased: 1989\nLabel: SST Records\nCatalog#: SST 215 / SST CD 215\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Rock, Alternative Rock\n\nTracklisting:\n\n01. All Of My Senses (5:51)\n02. Now That You Know Me (3:54)\n03. Fanfare In D Major (Come, Come) (3:45)\n04. The Main (4:04)\n05. Twenty-Five Forty-One (4:44)\n06. Roller-Rink (4:23)\n07. You're The Victim (3:10)\n08. Anything (3:28)\n09. She Can See The Angels Coming (3:42)\n10. Reprise (1:43)\n\nGrant Hart is of course best known as the drummer / co-leader of super-influental 80's punk power trio Husker Du. When the band broke up in early 1988, Bob Mould launched a rather successful solo career (MTV airplay, major label contract) while Hart labored on in indie obscurity. (Bassist Greg Norton had a band called Grey Area for awhile, but they never released any recordings and apparently he works as a chef these days.)\n\nGrant's first post-Husker outting was recorded for SST, the legendary American punk label that Husker Du had recorded for from 1983 until their jump to the majors in 1986, but the label was beginning to fall on hard times by that point and the &quot;grunge&quot; thing was still two or three years away. After this record (on which he apparently played ALL the instruments) he formed a proper band called Nova Mob who released a couple of decent indie-rock records that failed to have much impact. It's a shame, because Grant Hart was an equal to Bob Mould in terms of singing and songwriting and as co-producer of all the classic Husker albums he was unarguably a very influential figure on the whole 80's indie scene and especially the early 90's when that scene was commercialized into a full-blown fad.\n\nIn an understandable reaction to 9 years of relentless touring playing full-blast maximum rocknroll, both Hart and Mould turned down the volume for their debut outtings and produced records that stay as far away as possible from the whiplash guitar assault they had become known for. Mould's &quot;Workbook&quot; is pretty well known, as mentioned earlier it was well-publicized and promoted and probably sold more copies than both of Husker's major label LP's combined. However the relatively obscure &quot;Intolerance&quot; is actually the better record if you ask me, Hart's tunes and singing always struck me as more soulful and warm-hearted than Bob's bitter soul-baring approach. But what they had in common (and what made Husker Du such a great great band) is that as songwriters both had an unusually confessional and emotional approach for so-called &quot;PUNK ROCK&quot; which as a genre has tended to be &quot;outre-nihilist&quot; and rather macho.\n\nAnd so &quot;Intolerance&quot; begins not with buzzing electric guitars or the spastic pitter patter of Grant's drum kit but with icy keyboards evoking something between &quot;Positively 4th Street&quot; and New Order. The croaking just-fell-outta-bed lead vocal insists &quot;I'm using all of my senses, I am&quot; while in the background a chorus of Grants chants &quot;Pullin' a plow, pullin' a plow and I don't know how!&quot; What does it mean? Honestly I have no idea what most of his songs are about on any conscious level, but even though the lyrics to his tunes are of such a personal nature the raw feeling translates well enough (another Dylan comparison might be apt here, yaa and they're both from Minnesota dere hey!) Indeed this particular album is one of the most intensely personal, intimate, &quot;interior&quot; records I can think of -- one definitely gets the sense that he made this record all by himself, alone intentionally, as a sort of therapy (and he did have a lot of personal issues to work out at this time -- he was trying to kick heroin and also believed he was HIV+, though later it turned out to be a false test result.)\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:9a4ded55ebf11e17909b9dae48b575deb8e89b65","amp;dn":"Grant+Hart+-+Intolerance+%5B1989%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a4ded55ebf11e17909b9dae48b575deb8e89b65","infoHashBuffer":{"type":"Buffer","data":[154,77,237,85,235,241,30,23,144,155,157,174,72,181,117,222,184,232,155,101]},"announce":[],"urlList":[]}}