{"title":"Final Descent (1997).avi","uid":10181393,"size":840272690,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9c00fc722c646da324d739ab936481c7470b6b12&amp;dn=Final+Descent+%281997%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"claudiatannahill","files":1,"time":1400531581,"description":"Final Descent 1997 \n\n\nPlease remain calm. I'm your pilot, Captain Glen 'Lucky' Singer (Robert Urich), and I have that nickname for a reason.\nNow relax, sit back, and enjoy your flight. ...Oops, we're on fire. Stand by.\n\n-------------------------------------\n\nVideo/audio:\nThis is taken from a DVD-R of a TV-VHS rip, so there are the usual issues--including occasional A/V dropouts, noise, ghosting, and some glitches early on, where a few frames are dropped or another broadcast flickers in. It's not DVD quality but still quite watchable\nThe movie itself:\nWelcome aboard Quest Airlines Flight 19 from Seattle to Dallas. This beautiful aircraft is a brand-new Gallant 720;\nshe cost sixty million dollars, and at that price, nothing breaks.\n...Well, almost nothing.\nLucky may be a typical male TV character--emotionally-withdrawn, neurotically obstinate, and occasionally whiny--but Robert Urich (Spenser For Hire, Vega$, S.W.A.T., The Ice Pirates, Invitation To Hell, Killdozer, Endangered Species) is much more charming and down-to-earth than ninety percent of Hollywood's steroid-clown action heroes (even when doing completely dumb shit like kicking the tires on a passenger jet as part of the pre-flight inspection), and he and Annette O'Toole (Superman III) are as adorable a movie couple as you're going to find. Even Lucky's managerial antagonist, inflight supervisor, and romantic rival (John de Lancie--&quot;Q&quot; from Star Trek: The Next Generation and Discord from My Little Pony: Friendship is Magic) is likable. And he's NEVER likable.\nThe cabin is loaded with disaster-movie stereotypes--the pregnant woman, the elderly couple, the obnoxious children, the smarmy yuppie exec, and the prerequisite crying infant--BUT Final Descent very wisely squashes their roles to little more than placeholders, focusing instead on a few key passengers who have something to offer besides pathos (although God knows they bring their share of that).The plane itself is a typical fictional Hollywood aircraft (named after one of the producers) with more room inside than the narrowbody exterior suggests, and while many story elements are highly improbable, I have been assured by assorted online sources that they are all theoretically possible. (Although I doubt passengers would be able to hear external cannon-fire coming from behind their jet. They certainly wouldn't hear the rotors!)\nAnd as silly as things can get, Final Descent is fun and an undeniable nail-biter.","torrent":{"xt":"urn:btih:9c00fc722c646da324d739ab936481c7470b6b12","amp;dn":"Final+Descent+%281997%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c00fc722c646da324d739ab936481c7470b6b12","infoHashBuffer":{"type":"Buffer","data":[156,0,252,114,44,100,109,163,36,215,57,171,147,100,129,199,71,11,107,18]},"announce":[],"urlList":[]}}