{"title":"Art.of.Murder.The.Secret.Files-TiNYiSO","uid":5978634,"size":379705354,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9cfc3a1b8095c3cefa9be169170865f6220f41ab&amp;dn=Art.of.Murder.The.Secret.Files-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rlf-rls","files":28,"time":1290522907,"description":"Art of Murder: The Secret Files (c) City Interactive\nRelease On: 24 November 2010 Disk Amount/Format: 1 CD ISO\nType of Game: Adventure Media Protection: Nothing\n\nProper Information:\n\nAll those tough cases for FBI investigator Nicole Bonnet must have had an\neffect on her - she's had a hair colour change, from black to mousey\nblonde. What haven't changed are the challenges that constantly await her\nwith each case\n\nFans of the Art of Murder series have been following Nicole from her early\ndays as a new recruit. In The Secret Files, players will get to follow in\nthe agent's footsteps once more as she attempts to crack a case of murder\nand a mysterious kidnapping. It seems that DEA Specialist Professor J\nBrenner has been snatched by a drug cartel in Mexico, and amidst the chaos\nan undercover Special Agent has been killed\n\nNot only could the life of Brenner be under threat, but in fact the entire\nDEA operation that aims to fight the drugs market in Mexico. Nicole only\nhas her wits as her weapon as you help her identify the criminals behind\nthe incident and rescue the Professor before his time is up. You do this\nas always, with the challenge of hidden object gameplay - solve riddles\nand find clues that can lead you to the truth, while a thrilling storyline\nunravels with a haunting soundtrack and atmosphere\n\nThis is Nicole's most suspenseful adventure yet!\n\nBurn/mount, install, play\n\nGreetz: LARGEiSO and MEDIUMiSO\n\nLanguage: English only","torrent":{"xt":"urn:btih:9cfc3a1b8095c3cefa9be169170865f6220f41ab","amp;dn":"Art.of.Murder.The.Secret.Files-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cfc3a1b8095c3cefa9be169170865f6220f41ab","infoHashBuffer":{"type":"Buffer","data":[156,252,58,27,128,149,195,206,250,155,225,105,23,8,101,246,34,15,65,171]},"announce":[],"urlList":[]}}