{"title":"The Lighthouse by Alison Moore","uid":7617296,"size":505825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ed334dfa212c52f527a7e199a9fd4587e6c1221&amp;dn=The+Lighthouse+by+Alison+Moore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"azizex666","files":-1,"time":1347236728,"description":"Longlisted for the Man Booker Prize 2012 &quot;The Lighthouse&quot; begins on a North Sea ferry, on whose blustery outer deck stands Futh, a middle-aged, recently separated man heading to Germany for a restorative walking holiday. Spending his first night in Hellhaus at a small, family-run hotel, he finds the landlady hospitable but is troubled by an encounter with an inexplicably hostile barman. In the morning, Futh puts the episode behind him and sets out on his week-long circular walk along the Rhine. As he travels, he contemplates his childhood; a complicated friendship with the son of a lonely neighbour; his parents' broken marriage and his own. But the story he keeps coming back to, the person and the event affecting all others, is his mother and her abandonment of him as a boy, which left him with a void to fill, a substitute to find. He recalls his first trip to Germany with his newly single father. He is mindful of something he neglected to do there, an omission which threatens to have devastating repercussions for him this time around. At the end of the week, Futh, sunburnt and blistered, comes to the end of his circular walk, returning to what he sees as the sanctuary of the Hellhaus hotel, unaware of the events which have been unfolding there in his absence.\n\n\n                            Format 1 - .EPUB\n\n                            Format 2 - .MOBI\n\n\n          **Support Your Favorite Authors By Buying Their Books**\n","torrent":{"xt":"urn:btih:9ed334dfa212c52f527a7e199a9fd4587e6c1221","amp;dn":"The+Lighthouse+by+Alison+Moore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ed334dfa212c52f527a7e199a9fd4587e6c1221","infoHashBuffer":{"type":"Buffer","data":[158,211,52,223,162,18,197,47,82,122,126,25,154,159,212,88,126,108,18,33]},"announce":[],"urlList":[]}}