{"title":"The War on Science: Muzzled Scientists and Wilful Blindness in S","uid":9471248,"size":964633,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ee8efa65de5bb9bddf72707dcac7267a2d9e0a9&amp;dn=The+War+on+Science%3A+Muzzled+Scientists+and+Wilful+Blindness+in+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dududus","files":2,"time":1389580296,"description":"'The War on Science: Muzzled Scientists and Wilful Blindness in Stephen Harper's Canada' by Chris Turner\n\nEbook in PDF and EPUB\n\nIf possible, buy the book to support the author!\n\n------------------------------------\n\nA passionate and meticulously researched argument against the Harper government's war on science.\n\nIn this arresting and passionately argued indictment, award-winning journalist Chris Turner argues that Stephen Harper's attack on basic science, science communication, environmental regulations, and the environmental NGO community is the most vicious assault ever waged by a Canadian government on the fundamental principles of the Enlightenment. From the closure of Arctic research stations as oil drilling begins in the High Arctic to slashed research budgets in agriculture, dramatic changes to the nation's fisheries policy, and the muzzling of government scientists, Harper's government has effectively dismantled Canada's long-standing scientific tradition.\n\nDrawing on interviews with scientists whose work has been halted by budget cuts and their colleagues in an NGO community increasingly treated as an enemy of the state, The War on Science paints a vivid and damning portrait of a government that has abandoned environmental stewardship and severed a national commitment to the objective truth of basic science as old as Canada itself.","torrent":{"xt":"urn:btih:9ee8efa65de5bb9bddf72707dcac7267a2d9e0a9","amp;dn":"The+War+on+Science%3A+Muzzled+Scientists+and+Wilful+Blindness+in+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ee8efa65de5bb9bddf72707dcac7267a2d9e0a9","infoHashBuffer":{"type":"Buffer","data":[158,232,239,166,93,229,187,155,221,247,39,7,220,172,114,103,162,217,224,169]},"announce":[],"urlList":[]}}