{"title":"Bad Girls Go To Hell  (1965)  by Doris Wishman","uid":7075336,"size":3471124480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f048f1119f09c6b112330360508742a2ead1245&amp;dn=+Bad+Girls+Go+To+Hell++%281965%29++by+Doris+Wishman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Odin1066","files":-1,"time":1330816046,"description":"One day after pretty Meg Keltons husband Ted has left for work, she gets assaulted by the apartment buildings janitor in the stairwell as she was taking out some trash. This begins a chain of events that will she Meg flee Boston to dissappear in the crowds of NYC and then going by the name of Ellen over and over she meets people who seem nice but something always goes very wrong. I added some commercials from 1965 to the final mpeg2 file. Before the Feature Film are AMC Rambler Rogue, Folgers coffee and Sweeta TV commercials. After are Polaroid, Brylcreem, Lady Sunbeam and a long trailer for Thunderball. \n\nProduced and  Directed by Doris Wishman\nStory and Screenplay by Dawn Wishman (Doris again)\nStarring\nGigi Darlene as Meg Kelton and Ellen Green\nDawn Bennet, Marlene Starr, Harold Key, George La Rocque, Sandee Norman, Sam Stewart \nCinematography by C. Davis Smith, Sound by Titra Sound Corp.\nMusic by Music Sound Track, Editing by Ali Bendi, Prints by Movielab Inc.\nDistributed by Juri Productions Inc. and  Sam Lake Enterprises \nReleased December 24, 1965 \n\nVideo:  720x480  MPEG2 NTSC 29fps\nAudio:  2 channel Stereo 48kHz\nTotal Length:  1:12:58\n\nDoris Wishman (1912 - 2002) was a prolific self taught exploitation film maker. She learned when she worked as a secretary for movie distributor Joseph E. Levine that a low budget movie could make money by way of good advertising and successful distribution. She started out with Nudist, Naturalist films and progressed to true sexploitation by 1965 as the bar had been raised on what was allowed in public theatres.","torrent":{"xt":"urn:btih:9f048f1119f09c6b112330360508742a2ead1245","amp;dn":"+Bad+Girls+Go+To+Hell++%281965%29++by+Doris+Wishman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f048f1119f09c6b112330360508742a2ead1245","infoHashBuffer":{"type":"Buffer","data":[159,4,143,17,25,240,156,107,17,35,48,54,5,8,116,42,46,173,18,69]},"announce":[],"urlList":[]}}