{"title":"Walter Mosley - Futureland","uid":12045324,"size":145157636,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9f56c1f93e1237d8569302c6d5b241b3c07ebb31&amp;dn=Walter+Mosley+-+Futureland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":3,"time":1434883435,"description":"Projecting a near-future United States in which justice is blind in at least one eye and the ranks of the disenchanted have swollen to dangerous levels, Mosely offers nine interconnected stories whose characters appear and reappear in each others' lives. For all its denizens, from technocrats to terrorists, celebs to crooks, &quot;Futureland&quot; is an all-American nightmare just waiting to happen.\n\nLife in America a generation from now isn't much different from today: The drugs are better, the daily grind is worse. The gap between the rich and the poor has widened to a chasm. You can store the world's legal knowledge on a chip in your little finger, while the Supreme Court has decreed that constitutional rights don't apply to any individual who challenges the system. Justice is swiftly delivered by automated courts, so the prison industry is booming. And while the media declare racism is dead, word on the street is that even in a colorless society, it's a crime to be black.\n\nBut the world still turns, and folks still have to get by with the hands they're dealt, folks such as:\n\nPtolemy &quot;Popo&quot; Bent: This gentle backwoods child has a genius I.Q.- and a soul so pure that officials want him locked up forever.\n\nFolio Johnson: A hardboiled, cyber-augmented private eye who can see beneath the dark poetry of the metropolis, he will need an even greater edge than that to find out who's systematically murdering rich, young Nazis.\n\nFera Jones: She's the boxing Queen of the Ring who must still fight all comers to save her dad, preserve her identity, and protect the fans who believe in her.\n\nDr. Ivan Kismet: The world's richest man, Macrocode's CEO is a tycoon, tyrant, and messiah who is evidently more powerful than God. So it's too bad for everyone that Dr. Kismet is utterly insane.\n\nWalter Mosley brings to life the celebs, working stiffs, leaders, victims, technocrats, crooks, oppressors, and revolutionaries who inhabit a glorious all-American nightmare that's just around the corner. Welcome to Futureland.\n\n\n\n\n\nWhispers in the Dark - Details the early life of one Ptolemy Bent, a young black child who has the greatest IQ the world has ever known, and the purest heart possible in the world he is born into.\n\nThe Greatest - The rise of Fera Jones, the first female heavyweight Universal Boxing Authority world champion.\n\nDoctor Kismet - An interview between the CEO of MacroCode International, the world's most powerful corporation, and one of the leader's of the Sixth Radical Congress, a movement to strengthen the positions of African-Americans in world society.\n\nAngel's Island - The tale of a prisoner on the world's largest privately owned prison and how he came to expose its dark secrets.\n\nThe Electric Eye - A detective story focusing on one Folio Johnson, the &quot;last private detective in New York&quot;. Folio is hired to investigate the mysterious deaths of members of an elite Neo-Fascists think tank group known as the International Socialists, &quot;The Itsies&quot;.\n\nVoices - Professor Jones (Fera Jones', from 'The Greatest', father) hears voices in his head after undergoing a brain tissue transplant. His doctor reassures him that it is simply the foreign tissue becoming part of him. Jones meets a little girl in a park who he shows a fatherly affection for, however her existence is eerie. Similar scenes play out throughout the story, making him question what is real and what are dreams, maybe even echoes of his past drug addiction.\n\nLittle Brother - A courtroom trial for the death of a policeman in Common Ground, where the defendant can afford neither an attorney nor a judge. He is thus tried and matches wits with a judicial automaton programmed with the minds of 10,000 legal experts.\n\nEn Masse\n\nThe Nig in Me- An international plague ravages the world and the only ones who are spared are those with African genes.\n\n\n\nFormat: MP3\nBitrate: 32 Kbps","torrent":{"xt":"urn:btih:9f56c1f93e1237d8569302c6d5b241b3c07ebb31","amp;dn":"Walter+Mosley+-+Futureland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f56c1f93e1237d8569302c6d5b241b3c07ebb31","infoHashBuffer":{"type":"Buffer","data":[159,86,193,249,62,18,55,216,86,147,2,198,213,178,65,179,192,126,187,49]},"announce":[],"urlList":[]}}