{"title":"HISTORY OF POP AND ROCK MUSIC - part 518","uid":8947726,"size":707004531,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9f9c893a195f2749fdf775ea6e32558566c5c610&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+518&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1379813078,"description":"\n\n                    PART  518\n\n\n\n                                                 \n          MARTIKA  -   More Than You Know  (1988)\n          MARTIKA  -   Martika's Kitchen  (1991)\n          SHAKESPEAR'S SSITER  -  You're History  (1989)\n                                                   \n\n\n                 \n\n                   &quot;More Than You Know&quot; is the second single from Martika's  debut album. &quot;More Than You Know&quot; reached the top twenty of the pop charts in the US (#18), UK (#15) and Australia.    \n  \n               &quot;Martika's Kitchen&quot; is the second single and title track released from Martika's 1991 album of the same name. The single was written and produced by Prince, but failed to be a success in America, peaking at number 93 on the US pop chart. The vibrant and colorful video helped the song be a bigger hit in the UK, where it reached number 17.\n\n                  &quot;You're History&quot; is a song by the British-based pop act Shakespears Sister, released in 1989 as the second single from their debut album &quot;Sacred Heart&quot;. The song was the first release to present the act as a duo, and their first chart hit, reaching #7 in the UK. The music video for &quot;You're History&quot; is the first to feature Detroit, and was also the act's third video to be directed by award-winning Sophie Muller, who previously directed the videos for &quot;Break My Heart (You Really)&quot; and &quot;Heroine&quot;.The comical video begins with Detroit singing the opening verse of the song in front of a red stage curtain. At the end of the verse, the curtains open and the video continues in a glittering vaudeville style featuring Detroit and Fahey superimposed against various backdrops. A variety of dancers (including a group of ballerinas), a court jester juggling act, and various musicians also appear in the video, as does Fahey's two year old son, Sam, dressed in a bumblebee costume.\n\n                ","torrent":{"xt":"urn:btih:9f9c893a195f2749fdf775ea6e32558566c5c610","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+518","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f9c893a195f2749fdf775ea6e32558566c5c610","infoHashBuffer":{"type":"Buffer","data":[159,156,137,58,25,95,39,73,253,247,117,234,110,50,85,133,102,197,198,16]},"announce":[],"urlList":[]}}