{"title":"Viruses and Human Disease,2nd Ed {BBS}","uid":7692813,"size":18024388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a313481bcf526244c15d9157e869bdfe3ce71dd9&amp;dn=Viruses+and+Human+Disease%2C2nd+Ed+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1349282299,"description":"Completely revised and updated, the new edition of this groundbreaking text integrates basic virology with pathophysiological conditions to examine the connection between virology and human disease. Most virology textbooks focus on the molecular biology involved without adequate reference to physiology. This text focuses on viruses that infect humans, domestic animals and vertebrates and is based on extensive course notes from James Strauss' virology class at the California Institute of Technology taught for over 30 years. Expertly depicting in color the molecular structure and replication of each virus, it provides an excellent overview for students and professionals interested in viruses as agents of human disease.\n\n* Includes over 30% new material - virtually all of the figures and tables have been redrawn to include the latest information and the text has been extensively rewritten to include the most up-to-date information\n* Includes a new chapter on emerging and reemerging viral diseases such as avian flu, SARS, the spread of West Nile virus across America, and the continuing spread of Nipah virus in Southeast Asia.\n* Further reading sections at the end of each chapter make it easy find key references\n* World maps depicting the current distribution of existing and newly emerging viruses are also incorporated into the text\n* A companion website features illustrations for use in class notes and presentations.\n\n\n# Hardcover: 480 pages\n# Publisher: Academic Press; 2 edition (October 1, 2007)\n# Language: English\n# ISBN-10: 0123737419\n# ISBN-13: 978-0123737410","torrent":{"xt":"urn:btih:a313481bcf526244c15d9157e869bdfe3ce71dd9","amp;dn":"Viruses+and+Human+Disease%2C2nd+Ed+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a313481bcf526244c15d9157e869bdfe3ce71dd9","infoHashBuffer":{"type":"Buffer","data":[163,19,72,27,207,82,98,68,193,93,145,87,232,105,189,254,60,231,29,217]},"announce":[],"urlList":[]}}