{"title":"The Big Book of Curry Recipes (2012) (Pdf, Epub, Mobi) Gooner","uid":12079371,"size":11156712,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a3b371102a4c64ea03ac3b6b87933c61266bd8f7&amp;dn=The+Big+Book+of+Curry+Recipes+%282012%29+%28Pdf%2C+Epub%2C+Mobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1435706456,"description":"Publisher: Nemeton; 2 edition (July 10, 2012)\nPublication Date: July 10, 2012\nLanguage: English\nASIN: B008K9EXII\n\nCurries are one of the world's culinary success stories. They are now prepared, in various guises throughout the globe. Curries were originally developed in the Indus valley some 4000 or more years ago. Indian traders introduced them to Southeast Asia and East Africa whilst buddhist monks introduced them to south Asia and East Asia. The British introduced them to the remainder of the world. This book contains over 780 recipes for curries and curry-associated dishes with recipes for starters, main courses, accompaniments, breads, pickles, curry pastes and spice blends, and drinks from the Indian sub-Continent. Also included are curries from the remainder of Asia, from Africa and from the Caribbean. In addition there is a whole chapter on how to prepare restaurant-style curries for the home and on modern British curries as well as a chapter on historic curry recipes, beginning with the first curry recipe in English, from 1747. This book brings together the whole world of curries and curry recipes in one place.\n\nThis second edition of the book has been completely revised, with the addition of a new chapter on Diwali (Festival of Lights) recipes and additional recipes in other chapters. The African curries section has been extended with Cape Malay curries. Chapters now included are: Starters; Meat-based Curries, Chicken Curries, Fish Curries, Vegetarian Curries, Accompaniments, Desserts, Breads, Snacks and Savouries, Drinks, Relishes and Pickles, Diwali Recipes, Spice Blends, Historic Curries, South Asian Curries, Southeast Asian Curries, East Asian Curries, African Curries, Caribbean Curries and Restaurant and British Curries. This is the most comprehensive view of curries from around the world ever published.\n\nAbout the Author\n\nDyfed Lloyd Evans was born on the LÅ·n Peninsula, North Wales in 1967. Educated as a scientist, in London and Cambridge he has worked in both research and publishing. His interest has always been cookery, countryside and Celtic literature. These interests were brought together in his Celtnet website (www.celtnet.org.uk). He has been working on ancient Welsh texts and historic cookery books for over 20 years and this research is now being turned into a series of eBooks. His first work, the Guide to Spices and Their Uses was first published in 2008 and is now available as a kindle eBook. He has also published a number of poems, which are anthologiezed as 'Memories of Myth and Man'","torrent":{"xt":"urn:btih:a3b371102a4c64ea03ac3b6b87933c61266bd8f7","amp;dn":"The+Big+Book+of+Curry+Recipes+%282012%29+%28Pdf%2C+Epub%2C+Mobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3b371102a4c64ea03ac3b6b87933c61266bd8f7","infoHashBuffer":{"type":"Buffer","data":[163,179,113,16,42,76,100,234,3,172,59,107,135,147,60,97,38,107,216,247]},"announce":[],"urlList":[]}}