{"title":"United States:  A Nation of Inmates?  2013 02 20  AJE","uid":8187661,"size":82152408,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a48ac92931ee25a55304aba30886ae8f98c7bd05&amp;dn=United+States%3A++A+Nation+of+Inmates%3F++2013+02+20++AJE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shunster","files":1,"time":1361758215,"description":"United States:  A Nation of Inmates?  2013 02 20  AJE\n\n\n78mb/25mns/MP4\n\n\nThere are more prisoners in the US than any other nation in the world.\n\nThe country makes up five percent of the world's population, but accounts for 25 percent of its prison population. And over the last three decades the number held in US federal prisons has jumped by nearly 80 percent.\n\nThe number of inmates in US federal prisons has increased from about 25,000 in 1980 to 219,000 in 2012, according to a report by the US Congressional Research Service. \n\nThe report says the federal prison system was 39 percent over its capacity in 2011. And the situation is worse for high and medium security male facilities.\n\nHigh-security prisons were overcrowded by 51 percent, while medium security prisons were overcrowded by 55 percent in 2011. \n\nAccording to a report by the Government Accountability Office, overcrowding has contributed to worse safety and security conditions for both inmates and staff.\n\nThe overcrowded facilities have contributed to a multibillion dollar demand for private prisons. The industry argues it is helping the government save money. But others argue that for-profit prisons only increase the incentive to incarcerate more people.\n\nAlmost half of those incarcerated in federal prisons are drug offenders. Another 16 percent of inmates are in prison for offences related to weapons, explosives and arson. Those convicted of immigration violations make up 12 percent of the federal prison population. And the impact of mass imprisonment spreads far beyond the prison walls. \n\nSociologists have found that the rise in incarceration rates reduce social mobility and ensure both prisoners and their families remain trapped in a cycle of poverty. In the US, minorities make up over 70 percent of the federal prison population.\n\nDemographically, African-Americans - who represent 12 percent of the US population - make up 37 percent of federal prisoners. And Latinos - who are 16 percent of the population - make up 35 percent of prisoners.\n\nSo, what is the impact of the high incarceration rate on the US penal system and on poor communities?\n\nInside Story Americas with presenter Shihab Rattansi is joined by guests: David Fathi, the director of the American Civil Liberties Union National Prison Project; Matthew Mangino, a former district attorney in Pennsylvania; and Marc Mauer, the executive director of The Sentencing Project, and author of the book Race to Incarcerate.\n\nFlv:http://www.aljazeera.com/programmes/insidestoryamericas/2013/02/201322071650496567.html\n\nNote: Torrent renamed by AJE.\n\nPunishment and Profits: Immigration Detention 2012 04  AJE Fault Lines- &lt;a href=&quot;\nhttps://onebigtorrent.org/torrents/13200/Fault-LinesPunishment-and-Profits-Immigration-Detention-2012-04-AJE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://onebigtorrent.org/torrents/13200/Fault-LinesPunishment-and-Profits-Immigration-Detention-2012-04-AJE&lt;/a&gt;\n\n\n\nPBS Now~Prisons for Profit 2008  &lt;a href=&quot;\nhttps://onebigtorrent.org/torrents/12177/PBS-NowPrisons-for-Profit-2008-&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://onebigtorrent.org/torrents/12177/PBS-NowPrisons-for-Profit-2008-&lt;/a&gt;\n\nShunster","torrent":{"xt":"urn:btih:a48ac92931ee25a55304aba30886ae8f98c7bd05","amp;dn":"United+States%3A++A+Nation+of+Inmates%3F++2013+02+20++AJE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a48ac92931ee25a55304aba30886ae8f98c7bd05","infoHashBuffer":{"type":"Buffer","data":[164,138,201,41,49,238,37,165,83,4,171,163,8,134,174,143,152,199,189,5]},"announce":[],"urlList":[]}}