{"title":"The Murder of Little Mary Phagan","uid":11777810,"size":4933921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4a8e55bfa4bad403291e25bb9e352385d957964&amp;dn=The+Murder+of+Little+Mary+Phagan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427402383,"description":"One hundred years ago the nation reeled at the brutal rape and murder of thirteen year old Mary Phagan and the arrest of her accused killer, Leo Frank. Frank's trial and conviction generated fiery emotions in the people of Georgia and across the nation. When John Slaton, governor of Georgia, commuted Frank's sentence from death to life imprisonment, a group of prominent, well known men broke into the prison. They kidnapped and lynched Leo Frank. The repercussions are still being felt.\n\nNow, the great niece and namesake of Mary Phagan, whose startling resemblance to the murdered girl has haunted her life, breaks the vow of silence imposed on the Phagan family by Fannie Phagan Coleman, mother of little Mary. She discloses fro the first time the family's side of the affair. She recounts in ghastly detail Mary Phagan's murder and its grim legacy. She reveals the heretofore private Phagan family records. Her grandfather's secret meeting with Jim Conley, whose testimony convicted Leo Frank. Her meetings with the Georgia State Board of Pardons and Paroles. And her interview with Alonzo Mann, whose revelations about Jim Conley and Leo Frank in 1982 brought the nation's attention back to the case and led to Leo Frank's posthumous pardon.\n\nThe MURDER OF LITTLE MARY PHAGAN is the definitive account of one of the most famous crimes of the century and its continuing aftermath","torrent":{"xt":"urn:btih:a4a8e55bfa4bad403291e25bb9e352385d957964","amp;dn":"The+Murder+of+Little+Mary+Phagan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a8e55bfa4bad403291e25bb9e352385d957964","infoHashBuffer":{"type":"Buffer","data":[164,168,229,91,250,75,173,64,50,145,226,91,185,227,82,56,93,149,121,100]},"announce":[],"urlList":[]}}