{"title":"Battlefield.Hardline.Beta.B0XUP","uid":10387726,"size":7074315087,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a4d097d2deac91b4bf3e5e608489964839712e6f&amp;dn=Battlefield.Hardline.Beta.B0XUP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"Boxup","files":-1,"time":1403151027,"description":"Battlefield: Hardline features a whole new variety of gameplay that breaks away from the traditional Battlefield game modes. The focus of the game has been shifted to police and the &quot;war on crime&quot;, breaking away from the military background that has spanned the series up to now. As such, the main factions in Hardline are the police Special Response Units and the criminals. Players will have access to various military-grade weapons and vehicles, as well as having police equipment such as tasers and handcuffs.\n\nHardline also uses the Levolution mechanic from Battlefield 4. For example, in the map &quot;High Tension&quot;, players can send a construction crane crashing into the center of the map, ripping down debris from the central buildings in downtown Los Angeles.\n\nThe new game modes are Heist, Rescue, Hotwire Mode and Blood Money.\n\nHeist: The criminals must break packages out of armored trucks by blowing the doors off, then moving the package to an extraction point; the police must stop them. If the Criminals manage to escape by bringing all the packages to the extraction points they win.\nBlood Money: Both factions must retrieve money from an open crate in the center of the map, then move it back to their respective sides' armored truck. Players can also steal money from the opposing team's truck. The Team which firstly deposites 5 million or the most under a time limit into their own truck wins.\nHotwire Mode: Police chase down criminals at high speeds across expansive environments.\nRescue: Police officers attempt to save hostages from the criminals.\n\nThe plot revolves around Nick Mendoza, a SWAT officer who is seeking vengeance across the United States. For the first time, in Battlefield: Hardline, players can complete their objective in various different ways and paths, either silently or violently. A new gadget, called the Police Scanner, can be used to find enemies, important objects and evidences, and mark them.\n\nBattlefield Hardline Beta B0XUP\n\nREAD READ READ READ READ READ READ READ READ READ READ READ READ READ\n\nThese are the files of the game. you can copy them to Origin Games\nbut you need access to the beta. which you can go to EA support\n( http://www.help.ea.com/en/contact-us/new/ ) choose &quot;Battlefield: Hardline&quot;\nThen choose PC and &quot;Account Management&quot;, &quot;Chat&quot; and tell them you want to try out the beta.\n\nSo you quick load.\n\nB0XUP is a group that pirates PC games.","torrent":{"xt":"urn:btih:a4d097d2deac91b4bf3e5e608489964839712e6f","amp;dn":"Battlefield.Hardline.Beta.B0XUP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4d097d2deac91b4bf3e5e608489964839712e6f","infoHashBuffer":{"type":"Buffer","data":[164,208,151,210,222,172,145,180,191,62,94,96,132,137,150,72,57,113,46,111]},"announce":[],"urlList":[]}}