{"title":"Shadow Hearts [NTSC] PS2","uid":7576589,"size":1984646827,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:a5bc33e5a1693f15867addb2dba4a0438f147ee6&amp;dn=Shadow+Hearts+%5BNTSC%5D+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1346129340,"description":"Shadow Hearts for the Ps2                                    Rel. 12/11/2001\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         ISO\nGenre.:        RPG\nRating:        Mature\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nGame Description:\n\nShadow Hearts is a Japanese-style role-playing game set in a historical period (China and Europe of 1913, one year before the World War I) with plenty of supernatural elements mixed in. The game shares plot-related and stylistic traits with Koudelka, to which it can be considered a sequel. The player navigates a party of characters (up to three active combatants) over pre-rendered backgrounds. Combat with regular enemies occurs randomly. During battles, characters use regular attacks or cast spells. In addition to the regular health (HP) and magic points (MP), each character also has a special SP (&quot;sanity points&quot;) bar. Sanity bar is gradually depleted in combat; when characters run out of SP, they become insane and hence uncontrollable, until their sanity is restored with items.\n\nThe game implements traditional turn-based combat style for the battles, adding to it a feature called Judgment Ring. Every time a character performs an attack, a ring with a spinning arrow appears on the top of the screen. If the player stops the arrow when it is over a critical area on the ring, the attack will be more powerful. However, missing the larger hit area will cancel the attack completely. Various types of attacks have rings of various difficulty; usually, the more powerful a spell is, the smaller the hit area is on the ring. The Judgment Ring is also used for other purposes; it can help the player reduce prices in stores, and is needed to solve several puzzles.\n\nAll characters except Yuri learn new abilities automatically when leveling up. Due to his demon-fusion abilities, Yuri can collect soul energy and use it to acquire various fusion forms. When Yuri transforms into a demon he gains unique abilities, and continues fighting with the party as a controllable character. He also has to travel to a graveyard in his own mental realm from time to time, in order to face his own inner demons and clear Malice, negative vengeful energy the party accumulates by killing enemies. \n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t\t\t\t","torrent":{"xt":"urn:btih:a5bc33e5a1693f15867addb2dba4a0438f147ee6","amp;dn":"Shadow+Hearts+%5BNTSC%5D+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5bc33e5a1693f15867addb2dba4a0438f147ee6","infoHashBuffer":{"type":"Buffer","data":[165,188,51,229,161,105,63,21,134,122,221,178,219,164,160,67,143,20,126,230]},"announce":[],"urlList":[]}}