{"title":"The Tudors S2-E8 (2008 ) DivX [NL subs][NLtoppers][TVSerieSpot]","uid":7346190,"size":334654171,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a74161e80b7494af6555e820b908f6e33cac2083&amp;dn=The+Tudors+S2-E8+%282008+%29+DivX+%5BNL+subs%5D%5BNLtoppers%5D%5BTVSerieSpot%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chamond42","files":-1,"time":1339430861,"description":"The Tudors S2-E8 (2008 ) DivX [NL subs][NLtoppers][TVSerieSpot]\n\nIMDb: http://www.imdb.com/title/tt0758790/\nIMDb rating van deze episode 8,2/10[/color]\nEpisode lijst: http://en.wikipedia.org/wiki/List_of_The_Tudors_episodes\n\nUitgebracht door........ Peace Arch Entertaiment Group\n\nSeizoen 02 Episode 8: Lady in Waiting (uitgezonden op 18 mei 2008)\n\nSeizoen 2 Episode 8\nOp bevel van Hendrik VIII wordt Jane Seymour &quot;lady in waiting&quot; bij Anne Boleyn. Anne is over die benoeming zeer wantrouwend en voelt zich door die benoeming ongemakkelijk.\nKeizer Karel geeft zijn belangstelling door om weer nauwere banden met Engeland aan te knopen maar stelt daarbij wel als eis dat officieel wordt vastgelegd dat Lady Mary een opvolger is van Hendrik VIII.\nWanneer Hendrik ernstig wordt verwond in een steekspel komt de vraag van zijn mogelijke opvolging centraal te staan. Anne treft Hendrik intiem bij Jane aan en de schok daarvan veroorzaakt opnieuw een miskraam. Ontmoedigt door weer een mislukte zwangerschap eindigt de episode ermee dat Hendrik het huwelijk met Anne Boleyn verwerpt onder het voorwendsel dat hekserij in het spel is.\n\nEen anachronisme: Gedurende een feestelijke scene speelt een muzikant Henry Playford's &quot;Mr. Beveridge's Maggot&quot;, een muziekstuk dat niet eerder werd gecomponeerd en uitgevoerd dan aan het einde van 1600. In deze episode vindt het feest plaats toen Anne Boleyn koningin was, hetgeen het geval was van 1533-1536 en is 150 jaar eerder dan dat het muziekstuk was gecomponeerd. \n\nCategorie.......... Drama\nSource............. DVDRip\nRuntime............ 49:10 minutes\nSize............... 318 MB\nForm............... DivX AVI\nResolution......... 720x576\nFrames/s........... 25\nAudio Language..... English\nAudio code......... 2 Stereo 48kHz\nSubtitles: Dutch - Nederlands\n\nSynopsis\nSeason 2 Episode 8:\nAt Henry's command Jane Seymour is made a lady-in-waiting to Anne Boleyn, much to the discomfort and suspicion of the Queen. Emperor Charles indicates his interest in renewed relation with England. However Charles insists that legitimizing Lady Mary as Henry's heir be a condition of the renewed relation. When Henry is seriously injured in a jousting match all thoughts turn to who might succeed him. Anne finds Henry with Jane and the shock leads to another miscarriage. Discouraged by yet another failed pregnancy, the episode closes with Henry declaring his marriage with Anne null and void, citing witchcraft. \n\nAnachronisms: During a feast scene, a musician is playing Henry Playford's &quot;Mr Beveridge's Maggot&quot; which was not composed and published until the late 1600's. This episode is set while Anne Boleyn is Queen which only encompasses 1533-1536 and is therefore over 150 years before the song was composed.","torrent":{"xt":"urn:btih:a74161e80b7494af6555e820b908f6e33cac2083","amp;dn":"The+Tudors+S2-E8+%282008+%29+DivX+%5BNL+subs%5D%5BNLtoppers%5D%5BTVSerieSpot%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a74161e80b7494af6555e820b908f6e33cac2083","infoHashBuffer":{"type":"Buffer","data":[167,65,97,232,11,116,148,175,101,85,232,32,185,8,246,227,60,172,32,131]},"announce":[],"urlList":[]}}