{"title":"Richard Fleischer - The Narrow Margin (1952)","uid":4513292,"size":1012593886,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a77574c1f882f11f1fabbf93d7904c900bb4c59b&amp;dn=Richard+Fleischer+-+The+Narrow+Margin+%281952%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1226869388,"description":"Richard Fleischer - The Narrow Margin (1952) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0044954/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0044954/&lt;/a&gt; &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51YJ1H3CQQL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51YJ1H3CQQL.jpg&lt;/a&gt;\n\nThis gem of a B-picture from RKO is the kind of trim, beautifully paced movie people have in mind when asking, &quot;Why don't they make 'em like that anymore?&quot; Two cops have to guard a gangster's widow against assassination as she rides the Golden West Limited sleeper train from Chicago to give evidence in L.A. Soon there's only one cop (gravel-voiced Charles McGraw, usually cast as a villain), and he's finding the sharp-tongued widow (Marie Windsor in excelsis) as obnoxious as she is endangered. Nothing goes quite as you'd expect in this exemplary train thriller, which rattles and rocks toward its destination without a music track or a wasted moment. The bad guys include a most distinctive, elegantly garbed hitman (Gordon Gebert); a soft-spoken, &quot;Be reasonable, Sergeant&quot; negotiator (the vulpine Peter Brocco); and possibly the fat man (Paul Maxey) who keeps blocking up the train corridor at just the wrong time. Detour writer Martin Goldsmith worked on the story, which was nominated for an Academy Award, and George E. Diskant's black-and-white cinematography is as sharp as the work he was doing for Nicholas Ray around the same time. Director Richard Fleischer went on to bigger things--but he never made a better movie. &lt;a href=&quot;\nhttp://bayimg.com/image/halegaabp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/halegaabp.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/haleiaabp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/haleiaabp.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/halejaabp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/halejaabp.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/halekaabp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/halekaabp.jpg&lt;/a&gt;\n\n-----my rip-----\n\n~~~~~~ The Narrow Margin.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................976,222,208                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:11:26                \nFrame Count:....................................102743             \nFrame Width (pixels):...........................592                  \nFrame Height (pixels):..........................432                  \nAspect Ratio:...................................1.370                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1424                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.232&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x2000 (Dolby AC3) AC3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................1      \n\nTwo Los Angeles detectives travel to Chicago to escort the wife of a mob boss back to LA to testify against her husband. One of the detectives is played by Charles McGraw, Det. Sgt. Walter Brown, and Mrs. Frankie Neil is played by Marie Windsor. Although neither are very well remembered today, both were great character actors and extremely prolific b-movie stars. According to William Friedkin's admiring commentary track the lovely, dark haired and doe eyed Windsor was a Vargas model and a former Miss Utah. The internet clarifies the history a bit. In an on-line interview the late Ms. Windsor explains that her home state didn't have a Miss Utah, but she was a Miss Covered Wagon Days in 1939, which was about as close the Mormon State got to such a thing. In any event Windsor's combination of authority and raven-haired beauty suits her edged character well. Friedkin describes McGraw as `the most hard-boiled of the tough guys.' With a face that looked like it was chiseled from a solid block of sandstone, augmented with a deep, growling snarl of a voice that sounded as if it had been steeped in whiskey and filtered through barbed wire - supplemented by the three packs (at least) of cigarettes McGraw smokes in this 71 minute movie- you'd be hard pressed to argue with Friedkin's assessment. In the interview Windsor remembers McGraw as a sweet and gentle man. Still, even though other b-actors, Lawrence Tierney and Tom Neal, for instance, had real life assault and murder convictions, of the bunch McGraw is the one you least want tailing you when the pavement turns slick and the shadows grow long.\n\nA great cast, and everyone in THE NARROW MARGIN is very good to excellent, can be betrayed by a weak script and/or poor direction. Fortunately, the story is a natural and the direction is top of the line. A valuable witness has to travel from Chicago to Los Angeles on a train infested with ruthless bad guys who'll do just about anything to eliminate her (if they can find her.) Almost all of the movie takes place on the train during its long journey, a hermetic and claustrophobic space with few places to run and fewer yet to hide. The dialogue crackles and Fleischer's direction, in a word, is propulsive. I've cribbed from Friedkin's commentary track a couple of times already. It's not necessarily the best c-track I've ever heard, but it may be the one I'm most in tune with. I had to dust the scales off my eyelids when he noted `they could make movies in seventy-minutes back then because the characters didn't spend all their time analyzing their actions.' Which, of course, is true. When you say a movie like THE NARROW MARGIN is fast paced you're talking about the overall pacing, not the jittery MTV editing style. Movies like TNM build tension through action, not reflection. Friedkin also points out the missing piece that keeps the `very good' TNM from being a classic. I hadn't thought about it, but after he mentioned it I knew he was right. It involves a major plot point, so rather than telling you I'll just recommend the commentary track (after, of course, you've watched the film the first time without commentary.)\n\nArchive interview audio of TNM's director Richard Fleischer is also heard on the c-track. As always, it's a treat to hear the director of old movies speak about them. What he doesn't address are two of the incredible (now) though common (then) facts about THE NARROW MARGIN. Namely that it was made on a $90,000 budget (still under $1 million in today's dollars after adjusting for inflation) and that the picture was shot in either 14 or 21 days (accounts vary.) If Friedkin is right and TNM is not a classic, it's still a wonderful crime thriller, and one that I strongly recommend. \n\n----------\n\n   \t\n7 of 7 people found the following review helpful:\n5.0 out of 5 stars &quot;This Train Is Headed Straight For The Cemetery!&quot;, July 20, 2005\nBy \tbdlion &quot;Have Gun Will Travel&quot; (Charter Oak, Covina, CA) - See all my reviews\nTHE NARROW MARGIN is the apex of film noir. If you have friends and family who want to know what film noir is, give them this movie. All the classic elements are here:\n\nModest length - the movie clocks in at a spare 71 minutes, and all the fat has been trimmed. There is not one wasted moment, and the action will keep viewers rivited.\n\nBrilliant black &amp; white photography - all the moody shadows, claustrophobic camera angles and amazing lighting that epitomizes film noir are on hand here and used to great effect.\n\nSnappy dialogue - some of the best hard-boiled dialogue I've heard (&quot;I've met some hard cases before, lady, but you make 'em look like putty&quot;) (&quot;What are you going to do? Shoot something for breakfast?&quot;). The barbs come quick and steady, with menace and biting sarcasm.\n\n\nFemme fatale - Mrs. Neil, the protected Mob witness is nasty, self-centered, selfish and mean. Detective Brown is almost no match for her sharp tongue.\n\n\nIn additon, there are twists and turns that will keep you guessing until the penultimate moment. This is one of those &quot;old&quot; movies that bear repeated viewings. Economy of direction, script and suspense that builds throughout make this film noir a classic.      \n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:a77574c1f882f11f1fabbf93d7904c900bb4c59b","amp;dn":"Richard+Fleischer+-+The+Narrow+Margin+%281952%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a77574c1f882f11f1fabbf93d7904c900bb4c59b","infoHashBuffer":{"type":"Buffer","data":[167,117,116,193,248,130,241,31,31,171,191,147,215,144,76,144,11,180,197,155]},"announce":[],"urlList":[]}}