{"title":"Louise Hay - You Can Heal Your Life book and study course","uid":4087568,"size":590679589,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a82e7f3c8994c9827ebd6507d256197999c3cb5e&amp;dn=Louise+Hay+-+You+Can+Heal+Your+Life+book+and+study+course&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"praeator","files":71,"time":1205897726,"description":"BOOK\nPublisher: Hay House; Gift edition (September 1999)\nIf you haven&amp;#039;t seen Hay House&amp;#039;s Lifestyles series of gorgeous gift books, there is no better way to acquaint yourself than with publisher/author Louise Hay&amp;#039;s You Can Heal Your Life. A bestseller for many years, You Can Heal Your Life has been republished with bright, beautiful illustrations in full, living color and exquisite typography--each and every page is a work of art by artist Joan Perrin Falquet. The timeless message of the book is that we are each responsible for our own reality and &quot;dis-ease.&quot; Hay believes we make ourselves ill by having thoughts of self-hatred. She includes a directory of ailments and emotional causes for each with a corresponding affirmation to help overcome the illness. For example, the probable cause of multiple sclerosis is &quot;mental hardness, hard-heartedness, iron will, and inflexibility.&quot; The healing &quot;thought pattern&quot; would be: &quot;By choosing loving, joyous thoughts, I created a loving joyous world. I am safe and free.&quot; --P. Randall Cohan\n\nFrom AudioFile\nThe four tapes in this collection describe our emotional ills and methods for curing them. Louise Hay has practiced successfully as a therapist for many years; her doctrines and exercises have a huge following. In the audio presentations her delivery is clear and energetic. Her voice and speech are conversational. No matter what bias one brings to the listening, the material offers much to think about. J.P. (c)AudioFile, Portland, Maine\n\nSTUDY COURSE\n(Downloaded from Youtube from user lunaserenaa)\nBased on the best-selling book of the same name, this  DVD shows you how to practice the principles of self-worth and self-esteem taught by Louise L. Hay.  Watch as Louise teaches you how to transform negative beliefs and thoughts into positive, loving ones.\n \nBy doing the exercises and repeating the affirmations and new thought patterns, you can learn to truly love who you are!\n &lt;a href=&quot;\nhttp://www.hayhouse.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hayhouse.com&lt;/a&gt;","torrent":{"xt":"urn:btih:a82e7f3c8994c9827ebd6507d256197999c3cb5e","amp;dn":"Louise+Hay+-+You+Can+Heal+Your+Life+book+and+study+course","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a82e7f3c8994c9827ebd6507d256197999c3cb5e","infoHashBuffer":{"type":"Buffer","data":[168,46,127,60,137,148,201,130,126,189,101,7,210,86,25,121,153,195,203,94]},"announce":[],"urlList":[]}}