{"title":"Snow.Chick-A.Penguins.Tale--w.subs--BBC-2015-720p","uid":13082129,"size":1045213888,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a844671a451ebf152048d15c961f08c1371e2f9e&amp;dn=Snow.Chick-A.Penguins.Tale--w.subs--BBC-2015-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uggauga","files":2,"time":1450913414,"description":"\nSnow Chick - A Penguin's Tale\r\n\r\nNarrated by Kate Winslet, Snow Chick - A Penguin's Tale tells the story of an emperor penguin chick's first precarious months of life as it grows up in the world's most extreme nursery.\r\n\r\nEmperor penguins are the only animals to breed in the Antarctic winter, and after months of blizzards and temperatures of -60C, male emperor penguins are watching and waiting for their chicks to hatch. Snow Chick is the last to emerge into this harsh, frozen world.\r\n\r\nAs he takes his first steps, he tries to fit in with the baby penguin gang, but when you're so small it's hard to be accepted by the bigger chicks. Soon he ventures too far from his mother for comfort and gets lost in a storm. Later, he's chased by chick-snatching penguins and escapes a scavenging petrel by the fluff of his back - all the while slipping and skating on treacherous ice. With the arrival of the comical and pugnacious adelie penguin, colony life is turned upside down. But it signals a bigger change - the parents who braved long and treacherous journeys across the sea ice to bring back food eventually return no more. With his band of penguin brothers, Snow Chick has no choice but to make his own way to the sea. A few more adventures lie ahead before he gets tossed unceremoniously into the open ocean - his new home for the next four years.\r\n\r\nAn enchanting and action-packed dramatised Christmas treat, featuring one of the cutest and toughest creatures on Earth. Filming over a whole Antarctic year, the crew endured some of the toughest conditions on earth to capture these astonishing moments of intimate behaviour.\r\n \nhttp://www.bbc.co.uk/programmes/b06t3sk9\r\n_______________________________________\r\n\r\n1280x720 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!","torrent":{"xt":"urn:btih:a844671a451ebf152048d15c961f08c1371e2f9e","amp;dn":"Snow.Chick-A.Penguins.Tale--w.subs--BBC-2015-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a844671a451ebf152048d15c961f08c1371e2f9e","infoHashBuffer":{"type":"Buffer","data":[168,68,103,26,69,30,191,21,32,72,209,92,150,31,8,193,55,30,47,158]},"announce":[],"urlList":[]}}