{"title":"Action Comics Weekly 642 (1989-03) (MaidOfMight-Novus-HD) [NVS-D","uid":9776398,"size":95987977,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:aa55e7bb826cd1b2aae0e8ff43563bd72c7991d2&amp;dn=Action+Comics+Weekly+642+%281989-03%29+%28MaidOfMight-Novus-HD%29+%5BNVS-D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1395040917,"description":"English | CBZ | 42 Pages\n\nAction Comics Weekly #642\nPublisher:  DC Comics\nPublication Date:  March 1989\n\nWriter:  Elliot S. Maggin\nPencillers:  Gil Kane, Steve Ditko, Curt Swan, Jim Aparo, Jim Mooney, and Carmine Infantino\nInkers:  Gil Kane, Art Thibert, Ty Templeton, John Nyberg, Ian Akin, Brian Garvey, and Kevin Nowlan\nColorist:  Glenn Whitmore\nLetterer:  John Workman\nCover Artist:  Ross Andru and Eric Shanower\n\nWhere There Is a Will... Chapter I - The Decision\nAs Abin Sur is dying, he summons a successor without fear-- Clark Kent. Since Clark is not a native of the planet per Guardian law, he cannot assume the responsibilities of a Green Lantern. Abin then shows Clark images of other worthy successors and Clark suggests Hal Jordan as a potential candidate.\n\nChapter II - The Decline\nDeciding to fight the bad guys instead of dealing with his personal problems, Green Lantern investigates reports of someone stealing fissionable nuclear material. For some reason, his ring is acting erratically. After he breaks into a military compound, he is fatally shot by the Major and left for dead. He then sends out green energy -- to find a successor.\n\nChapter III: The Summoning\nAt a tense moment in their lives, Hal's successors are all brought to his dying spot, outside of time and space. Hal then begins to choose his replacement. But Abin Sur's spirit, Clark Kent and Deadman convince Hal that his time is not up yet. Convinced, Hal's spirit rejoins his body and Green Lantern lives again!\n\nChapter IV: The Restoration\nAll of the successors are returned to their proper place and time, but each finds that they are charged with a small amount of Green Lantern energy, which solves the problems they were facing at the moment of their summoning. Hal captures the corrupt Major and his flunkies, and Clark and Deadman continue their discussion on existance.\n\nThanks goes to Maid of Might for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9226334&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9226334&lt;/a&gt;","torrent":{"xt":"urn:btih:aa55e7bb826cd1b2aae0e8ff43563bd72c7991d2","amp;dn":"Action+Comics+Weekly+642+%281989-03%29+%28MaidOfMight-Novus-HD%29+%5BNVS-D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa55e7bb826cd1b2aae0e8ff43563bd72c7991d2","infoHashBuffer":{"type":"Buffer","data":[170,85,231,187,130,108,209,178,170,224,232,255,67,86,59,215,44,121,145,210]},"announce":[],"urlList":[]}}