{"title":"How I Won The War - Patrick Ryan - 1963  (PDF)","uid":9867787,"size":4091803,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab13e6ee48353cf5230cb5cbdf1168a33cfefddc&amp;dn=How+I+Won+The+War+-+Patrick+Ryan+-+1963++%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Uncle_Dano","files":1,"time":1396377307,"description":"How I Won The War by Patrick Ryan\n\n\nFrom the dust jacket:\n\n&quot;Ike, Winnie and Monty have all had their say.  We've heard from Bradley, Alexander, de Gaulle and a battalion of other brass hats.  But here is a war memoir at ground level.\n\nLieutenant Ernest Goodbody recounts each horrifying step of his military career to &quot;Punch&quot; writer Patrick Ryan...horrifying because if Adolf Hitler had only left Goodbody unimpeded, the outcome of the history's greatest struggle might have been far, far different.  Luckily even Goodbody couldn't stop the Allies.  \n\nFrom the moment you meet him taking over command of Twelve Platoons (When Private Clapper came to tell about &quot;his hoggins&quot;) to the last glorious days when Goodbody's refugee children turn out to be full-blown German frauliens masquerading in toddler's clothes, your eyes will be opened to the war the way it really was fought by heavily armed civilians.  We doubt this volume will put an end to wars but we do predict that it will write finis to wartime memoirs&quot;\n\nSimply put, this is a hilarious novel about the military misadventures of a &quot;straight-laced&quot; and &quot;by the book&quot; British Army lieutenant and the soldiers he is charged with leading to glory, whether they like it or not.  If you have an interest in World War Two then this book is sure to keep you laughing from cover to cover.\n\nThough this novel shares the same name as the movie starring John Lennon, the two are only vaguely similar.  The novel is vastly wittier and superior to the movie in every way.  For fans of that &quot;stiff upper lip&quot; style of British humor.","torrent":{"xt":"urn:btih:ab13e6ee48353cf5230cb5cbdf1168a33cfefddc","amp;dn":"How+I+Won+The+War+-+Patrick+Ryan+-+1963++%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab13e6ee48353cf5230cb5cbdf1168a33cfefddc","infoHashBuffer":{"type":"Buffer","data":[171,19,230,238,72,53,60,245,35,12,181,203,223,17,104,163,60,254,253,220]},"announce":[],"urlList":[]}}