{"title":"Digital Tutors - Introduction to Softimage 2014","uid":10809097,"size":6355471967,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ab70f35918f95940f0eb8ac42ce9933c82d00624&amp;dn=Digital+Tutors+-+Introduction+to+Softimage+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sum1_here","files":86,"time":1408406630,"description":"This in-depth Softimage 2014 tutorial is designed to help you get a solid understanding of the core features found in Softimage, and help you ease your transition into this very powerful program. \n\nWhile viewing these lessons, you will have the opportunity to learn from several of the professional Softimage tutors who are part of Digital-Tutors and experts in their subject area. \n\nIn the first portion of this tutorial, we will get you familiar with some of the vocabulary and foundational skills that are necessary to begin moving around and working in Softimage. From there, we will explore some of the modeling features found in Softimage, and begin building the vehicle that will serve as our central project for the remainder of this tutorial. \n\nFrom there, we take you through the entire process of adding textures and materials to the vehicle, adding animated movement and animation controls, using the Interactive Creative Environment (ICE) to add particle and smoke dynamics, and finally we learn how to add lights, shadows, and output our final animated sequence.","torrent":{"xt":"urn:btih:ab70f35918f95940f0eb8ac42ce9933c82d00624","amp;dn":"Digital+Tutors+-+Introduction+to+Softimage+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab70f35918f95940f0eb8ac42ce9933c82d00624","infoHashBuffer":{"type":"Buffer","data":[171,112,243,89,24,249,89,64,240,235,138,196,44,233,147,60,130,208,6,36]},"announce":[],"urlList":[]}}