{"title":"Callisto - Signal To The Stars - New Age Music, 2004","uid":3502098,"size":107404328,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ab8b4fa158381dcd25499c73af84f87d98fb454f&amp;dn=Callisto+-+Signal+To+The+Stars+-+New+Age+Music%2C+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Blissynths","files":14,"time":1152506050,"description":"NFO-file created by PostAssistant v009\nDate : 7/8/2006  --  Time : 9:03:42 PM\n \nArtist     : Callisto\nAlbum      : Signal To The Stars\nSource     : CD\nYear       : 2004\nGenre      : New Age\nLabel      : AD Music\n\nCodec      : Lame 3.90 \nQuality    : VBR, average 202kbps, joint stereo\n\nID3-Tag    : Yes, Version 1 &amp; 2.3\n\nPosted By  :  on 08-07-2006\n\n\nIncluded   : This Info-File (NFO)\n             Frontcover\n\nTracklisting\n------------\n01 (7:39) Sycorax (part 1)\n02 (5:52) Sycorax (part 2)\n03 (5:35) Iosphere (part 1)\n04 (3:51) Iosphere (part 2)\n05 (7:16) Iosphere (part 3)\n06 (5:06) Elara\n07 (6:24) Setisphere (part 1)\n08 (6:40) Setisphere (part 2)\n09 (4:54) Setisphere (part 3)\n10 (6:12) Naiad (part 1)\n11 (7:19) Naiad (part 2)\n12 (3:47) Naiad (part 3)\n\nPlaying Time : 70:35\nTotal Size   : 102 MB\n\n\nAbout the Artist\n&quot;The seed for Callisto was sown in 2003 when David Wright discussed ideas for his 15th solo album &amp;#039;Continuum&amp;#039; with friend and colleague Dave Massey. A number of musical ideas were put aside simply because they did not fit into the album&amp;#039;s overall identity. Yet, both felt that these ideas deserved to be nurtured and developed into another direction. An exchange of musical ideas began and thus Callisto was born. \nThe two had already worked successfully as members of Newage electronic band Code Indigo, and both musicians share a passion for melodic, rhythmic, New Age music in the classic tradition of the early works of Tangerine Dream, Klaus Schulze, Kitaro and Vangelis, so &amp;#039;Signal to the Stars&amp;#039; had a direction mapped out from the start. However, both artists were determined to ensure that the Callisto sound would be &amp;#039;original&amp;#039;. \n\nDavid Wright is now considered a veteran of the Newage EM scene with a perennial sales record and an established fan base spanning 15 solo albums since the late 80&amp;#039;s and a further 5 albums with his band Code Indigo. David is also the founder and driving force behind the AD Music label and its publishing arm FX Media. \n\nDave Massey has been producing music as a solo musician and with his brother, under a variety of pseudonyms for over 10 years, producing more than a dozen New Age and world music albums for labels like North Star. Dave has also produced successful trance and dance music under numerous guises and is a respected producer. The creative process behind a successful collaboration such as this is often intuitive and therefore difficult to define. However, in broad terms, David Wright developed the musical and compositional dimensions whilst Dave Massey concentrated more on the production,developing ideas and refining increasingly sophisticated rhythms and sequences. After long, intense but highly productive studio sessions &amp;#039;Signal to the Stars&amp;#039; was carefully crafted.&quot; \n\nProduct Description\n&amp;#039;Signal to the Stars&amp;#039; is full of memorable and melodic themes, set against a backdrop of powerful and hypnotic rhythmic moods, augmented by inventive sequences, atmospherics and spontaneous keyboard solos. To quote writer Steve Roberts: &quot;Listening to music of this quality is always an enriching and uplifting experience. Enjoy your first journey into &amp;#039;Signal to the Stars&amp;#039; as you will revisit frequently and discover new depths and emotions every time. As for Callisto, this is just the beginning of the voyage.&quot; \n\n\n\n","torrent":{"xt":"urn:btih:ab8b4fa158381dcd25499c73af84f87d98fb454f","amp;dn":"Callisto+-+Signal+To+The+Stars+-+New+Age+Music%2C+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab8b4fa158381dcd25499c73af84f87d98fb454f","infoHashBuffer":{"type":"Buffer","data":[171,139,79,161,88,56,29,205,37,73,156,115,175,132,248,125,152,251,69,79]},"announce":[],"urlList":[]}}