{"title":"A is For Arsenic - The Poisons of Agatha Christie","uid":13553162,"size":4171078,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abfe8f53bec7ac2fbf4cca91e56b055f88d97eb9&amp;dn=A+is+For+Arsenic+-+The+Poisons+of+Agatha+Christie&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1455573271,"description":"People are fascinated by murder. The popularity of murder mystery books, TV series, and even board games shows that there is an appetite for death, and the more unusual or macabre the method, the better. With gunshots or stabbings the cause of death is obvious, but poisons are inherently more mysterious. How are some compounds so deadly in such tiny amounts?\r\n\r\nAgatha Christie used poison to kill her characters more often than any other crime fiction writer. The poison was a central part of the novel, and her choice of deadly substances was far from random; the chemical and physiological characteristics of each poison provide vital clues to the discovery of the murderer. Christie demonstrated her extensive chemical knowledge (much of it gleaned by working in a pharmacy during both world wars) in many of her novels, but this is rarely appreciated by the reader.\r\n\r\nWritten by former research chemist Kathryn Harkup, each chapter takes a different novel and investigates the poison used by the murderer. Fact- and fun-packed, A is for Arsenic looks at why certain chemicals kill, how they interact with the body, and the feasibility of obtaining, administering, and detecting these poisons, both when Christie was writing and today","torrent":{"xt":"urn:btih:abfe8f53bec7ac2fbf4cca91e56b055f88d97eb9","amp;dn":"A+is+For+Arsenic+-+The+Poisons+of+Agatha+Christie","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abfe8f53bec7ac2fbf4cca91e56b055f88d97eb9","infoHashBuffer":{"type":"Buffer","data":[171,254,143,83,190,199,172,47,191,76,202,145,229,107,5,95,136,217,126,185]},"announce":[],"urlList":[]}}