{"title":"Qarl's Texture Pack III for The Elder Scrolls IV: Oblivion (OMOD","uid":8145422,"size":1815239074,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:acbc39c25197c545f15ce720375454d82c8ae75e&amp;dn=Qarl%27s+Texture+Pack+III+for+The+Elder+Scrolls+IV%3A+Oblivion+%28OMOD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eardstapa","files":-1,"time":1360906199,"description":"Qarl's Texture Pack III Full v1.3 OMOD\n\n----\n\nI am creating this torrent as a mirror in case the other sources are down/too slow:\n &lt;a href=&quot;\nhttp://planetelderscrolls.gamespy.com/View.php?view=OblivionMods.Detail&amp;id=4721&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://planetelderscrolls.gamespy.com/View.php?view=OblivionMods.Detail&amp;id=4721&lt;/a&gt;\n &lt;a href=&quot;\nhttp://oblivion.nexusmods.com/mods/18498&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://oblivion.nexusmods.com/mods/18498&lt;/a&gt;\n\nI chose the OMOD as opposed to the 7z because they were both 1.7 GB, and uncompressing is just a waste of CPU time.\n\n----\n\nDescription-\nThis is a full version of Qarl's Texture Pack III, with patch v1.3 already installed, and then created into an OMOD. I did no work with the actual textures, all I did was combine Qarl's TP3 with the newest 1.3 patch, and then made it into an OMOD. I found this very helpful, because it is much easier than manually uninstalling and installing all those different textures and meshes, with the OMOD, all you have to do is activate or deactivate the mod, and Oblivion Mod Manager takes care of the rest.\n\nWhat Does It Do?- \nThis mod makes most of the textures in the game sharper and clearer.\n\nFeatures-\n* Most textures are 4 times the size of the originals. Some, even more. This makes things seem much clearer and sharper in-game.\n* A large number of meshes have been altered to take advantage of the game engine's parallax shader.\n* Only parts of the mesh which NEED parallaxing have the parallax flag enabled. This removes unwanted artifacts parallaxing can cause around corners.\n* Textures which use the parallax shader have been altered at the mipmap level so that things look very 3D from a distance but do not get the soupy artifacts associated with the parallax effect when viewed close-up.\n* Advanced normal map techniques used to make landscape textures seem very 3D.\n* Landscape color maps and normal maps edited at the mipmap level to reduce the tiling effect in the distance.\n* Mesh fixes from the Unofficial Oblivion Patch are included.\nThings retextured:\n\n* Architecture\n* Landscape\n* Rocks\n* Dungeons\n* Blood splatters, falling snowflakes, butterflies\n* Furniture, and other medium-sized clutter\n\nThings NOT retextured:\n\n* Clothes, armor, weapons, creatures, NPCs\n* Foliage, the sky\n* Kvatch, the Arena, and the Oblivion realm\n\nRequirements-\nThis mod greatly enhances the graphic detail of Oblivion. Therefore, you should probably only install this if you have a farily high-end system. I am currently running an 8800GT with 1280x1024 resolution, 4x anti-aliasing, and max graphics, and with this mod installed I average around 45fps.\n\nInstallation-\nExtract the OMOD to your C:...Oblivionobmmmods folder. Then, start up OBMM, and double click on the mod to activate it. After you have activated it, click on Utilities then Archive Invalidation. Click the bubble for BSA alteration, check mark the box for Textures, and check mark the box for Generate archiveinvalidation entries on hash collision. If you want to know why you did all that, scroll down to number 4 in Qarl's Installation section in his readme (which I have included with the download), and he explains it a little more. NOTE: The mod might take a while to install, this is normal, and its just because this is such a big file.\n\nOther Handy Mods-\nAlso, if you have Shivering Isles, keep an eye out for my Bomret's Shivering Isles Texture Pack OMOD, which I will be working on.\n\nCredit-\nAll the credit for creating this amazing texture pack goes to Qarl. If you modify this OMOD in any way, all I ask is that you give me credit, thanks. \n\n\nHAVE FUN :D!","torrent":{"xt":"urn:btih:acbc39c25197c545f15ce720375454d82c8ae75e","amp;dn":"Qarl%27s+Texture+Pack+III+for+The+Elder+Scrolls+IV%3A+Oblivion+%28OMOD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acbc39c25197c545f15ce720375454d82c8ae75e","infoHashBuffer":{"type":"Buffer","data":[172,188,57,194,81,151,197,69,241,92,231,32,55,84,84,216,44,138,231,94]},"announce":[],"urlList":[]}}