{"title":"Swamp Thing v1-v4 + Appearances","uid":4971787,"size":5156740535,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ae7871a177b5d206f0d17585732e54d8f5a63f2e&amp;dn=Swamp+Thing+v1-v4+%2B+Appearances&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1245799115,"description":"Swamp Thing was created by Len Wein and Berni Wrightson. He is a humanoid mass of vegetable matter who fights to protect his swamp home, the environment in general, and humanity from various supernatural or terrorist threats.\nThe character found perhaps his greatest popularity during the 1980s and early '90s mainly due to Alan Moore reconfiguring Swamp Thing's origin as a plant elemental. Outside of an extensive comic book history, the Swamp Thing property has inspired two theatrical films, a live-action television series, and a 5-part animated series among other media.\n\nThe Swamp Thing character first appeared in House of Secrets #92 (June-July 1971), with the name Alex Olsen. The comic is set in the early 20th century, when scientist Alex Olsen is caught in a lab explosion caused by his co-worker, Damian Ridge, who intended to kill him to gain the hand of Olsen's wife Linda. Olsen is physically altered by chemicals and the forces within the swamp and morphs into a monstrous creature.\n\nAfter the success of the short story in the House of Secrets comic, the original creators were asked to write an ongoing series, depicting a more heroic, more contemporary creature. In Swamp Thing #1 (October-November 1972) Wein and Wrightson updated the time frame to the 1970s and featured a new version character: Alec Holland, a scientist working in the Louisiana swamps on a secret bio-restorative formula &quot;that can make forests out of deserts&quot;. Holland is killed by a bomb planted by agents of the mysterious Mr. E, who wants the formula. Splashed with burning chemicals in the massive fire, Holland runs from the lab and falls into the muck-filled swamp, after which a creature resembling a humanoid plant appears some time later.\n\nRoy Thomas and Gerry Conway, who co-created Man-Thing for Marvel Comics a year and a half earlier, thought that this origin was too similar to that of their character, and Wein himself had written a Man-Thing story (in fact, the second) that was published with a June 1972 cover date, but he refused to change the origin in spite of some cajoling by Conway, who was his roommate at the time. Marvel, however, never took the issue to court, realizing the similarity of both characters to The Heap.\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:ae7871a177b5d206f0d17585732e54d8f5a63f2e","amp;dn":"Swamp+Thing+v1-v4+%2B+Appearances","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae7871a177b5d206f0d17585732e54d8f5a63f2e","infoHashBuffer":{"type":"Buffer","data":[174,120,113,161,119,181,210,6,240,209,117,133,115,46,84,216,245,166,63,46]},"announce":[],"urlList":[]}}