{"title":"Historical Dictionary of Human Rights by Jacques Fomerand (2014)","uid":10593292,"size":16447909,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0face71a854e88b44207481d115ed5972f84877&amp;dn=Historical+Dictionary+of+Human+Rights+by+Jacques+Fomerand+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405826456,"description":"Title: Historical Dictionary of Human Rights\nAuthor: Jacques Fomerand\nCategory: Academic/Dictionary/History/Human Rights\nSeries: Historical Dictionaries of Religions, Philosophies, and Movements Series\nPublisher: Rowman &amp; Littlefield Publishers (February 18, 2014)\nLanguage: English\nISBN-10: 0810858452\nISBN-13: 978-0810858459\n\nPromotional info/Publisher's summary - &quot;If the sheer number of references to human rights in media headlines or government statements is of any guidance, human rights concerns now appear virtually at the center of the framework of the norms, principles and obligations that shape relations within the international community both among and within states. That political journey began, perhaps arbitrarily, on 10 December, 1948, when the United Nations General Assembly (UN-GA) embraced and proclaimed the Universal Declaration of Human Rights (UDHR), a ringing endorsement and advocacy of the notion that regardless of race, religion or nationality, all men and women, everywhere in the world are entitled to the human rights and fundamental freedoms simply because they are human. \n\nThe Historical Dictionary of Human Rights covers the history of the Human Rights movement through a chronology, an introductory essay, appendixes, and an extensive bibliography. The dictionary section has more than 1000 cross-referenced entries on terminology, conventions, treaties, intergovernmental organizations in the United Nations family or regional bodies, and the constantly expanding universe of non-governmental organizations, as well as some of the pioneers and defenders. This book is an excellent access point for students, researchers, and anyone wanting to know more about the Human Rights movement.&quot;\n\nReview:\nFomerand, known for his long career with the United Nations, has produced a remarkable desktop reference for the field of human rights, useful both to students and professionals such as journalists. The book opens with a chronology covering the development of human rights from 1493 to the present day. A 72-page introduction provides the broader context of fact-finding, transitional justice, enforcement, and more. Dictionary entries cover a broad array of topics, from general subjects such as genocide and forced labor, to specific historical cases of human rights violations, as well as brief profiles of those nations and individuals who have featured prominently in rights discourse. Welcome coverage is also devoted to the sometimes bewildering array of NGOs, UN conventions and declarations, and tribunals that pop up in international studies and the media. Cross-referenced terms appear conveniently in boldface. Thirteen appendixes provide information on the structure of the UN, and lay out various complaints procedures; an extensive, thematically organized bibliography follows. All the complementary components result in a splendid dictionary that ably distills complex concepts and long histories without sacrificing either readability or authority. Summing Up: Highly recommended. Lower-division undergraduates and above; general readers. -CHOICE\n\nThis torrent contains the original retail EPUB as well as conversions into MOBI, AZW3, LIT, and large print PDF formats done in Calibre. The front cover image and generated metadata.opf file are also included. Please seed, and enjoy.\n","torrent":{"xt":"urn:btih:b0face71a854e88b44207481d115ed5972f84877","amp;dn":"Historical+Dictionary+of+Human+Rights+by+Jacques+Fomerand+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0face71a854e88b44207481d115ed5972f84877","infoHashBuffer":{"type":"Buffer","data":[176,250,206,113,168,84,232,139,68,32,116,129,209,21,237,89,114,248,72,119]},"announce":[],"urlList":[]}}