{"title":"Thomas &amp; Senior op het Spoor van Brute Berend (1985), DVDR(xvid)","uid":6348817,"size":1422373284,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b11018647d2ed6144fb75dcaa606eb45f8b79a7c&amp;dn=Thomas+%26+Senior+op+het+Spoor+van+Brute+Berend+%281985%29%2C+DVDR%28xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MeMar","files":-1,"time":1303925196,"description":"Thomas &amp; Senior op het Spoor van Brute Berend (1985), DVDR(xvid), NL Gespr. DMT\nNederland\nAvontuur / Familie\n4-delige serie, 110 minuten\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0844762/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0844762/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/22113&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/22113&lt;/a&gt;\n\nTegelijk met de 7-delige serie &quot;Thomas en Senior en de Grote Goudroof&quot; werd ook een speelfilm \nopgenomen, 'Thomas en Senior op het Spoor van Brute Berend' (tevens bekend als: 'Thomas en \nSenior on the trail of Brutal Bernard'). Deze werd enkele jaren later als 4-delige serie uitgezonden.\n\nThomas wordt op de eerste schooldag, na de vakantie, gekozen in een feestcommissie en maakt \nnieuwe vrienden en vriendinnen. Door de voorbereidingen voor het feest en het huiswerk komt \nThomas maar sporadisch bij Senior, de vitale zeventiger, die moeite heeft met de stilte na de \navontuurlijke zomer met Thomas. Senior slentert op een dag doelloos door de stad. Zijn aandacht \nwordt getrokken door een slooppand. Tussen het puin vindt hij een oud scheepsmodel; misschien \nkan hij dat samen met Thomas opknappen. Thomas reageert wat lauw op het idee, hij houdt zich \nliever bezig met de voorbereidingen van het feest. Dan bedenkt Senior een plan om het spannend \nvoor Thomas te maken. Bedachtzaam legt hij de basis voor een nieuw avontuur, gebaseerd op de \nsage van Brute Berend, een gevreesde zeerover die een schat begraven had. Senior zorgt ervoor \ndat Thomas in het wrakke bootje een oud stuk perkament, met een vreemde boodschap, ontdekt.\n Thomas is direct enthousiast en licht zijn vriendjes in dat hij op het spoor is van een goudschat. \nDat had Senior niet verwacht. De boodschap leidt naar een schatkaart, maar wat geheim had \nmoeten blijven wordt door de loslippigheid van de kinderen wereldnieuws. Dat trekt natuurlijk vele \nnieuwsgierigen, al dan niet met eerbare bedoelingen. Zoals meneer Mulder, een directeur van een \nreclamebureau, die weer voor een stunt moet zorgen. Hij ziet geld in een grandioze campagne met \nBrute Berend als middelpunt. Mulder doet Senior een vorstelijk aanbod voor de schatkaart. Senior \nwijst elk bod resoluut van de hand. Bij toeval ontdekt Thomas de reden van Seniors afwijzende \nhouding. Eerst is hij diep teleurgesteld door diens bedrog maar hij begrijpt al gauw dat Senior zich \nnu in een pijnlijke situatie bevindt. Samen smeden zij een plan om de schatkaart te laten verdwijnen \nen het avontuur vroegtijdig te laten beÃƒÂ«indigen. Maar iemand is hen voor. Wat begon als een \nonschuldig idee van Senior, ontwikkelt zich tot een netwerk van verwarrende complicaties die \nleiden tot de ontvoering van de kinderen door een duister drietal. Senior besluit het wereldkundig\n te maken en bekent dat het een uit de hand gelopen grap is. Maar zoals vaak wordt de waarheid\n niet geloofd. Senior is de wanhoop nabij, maar krijgt weer een van zijn lumineuze ideeÃƒÂ«n die \nleiden naar 'eind goed, al goed'.\n\n\nCategorie: Beeld\nBron: DVD Retail\nFormaat: DivX\nTaal: Nederlands gesproken\nGenre:  Avontuur / Familie\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:b11018647d2ed6144fb75dcaa606eb45f8b79a7c","amp;dn":"Thomas+%26+Senior+op+het+Spoor+van+Brute+Berend+%281985%29%2C+DVDR%28xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11018647d2ed6144fb75dcaa606eb45f8b79a7c","infoHashBuffer":{"type":"Buffer","data":[177,16,24,100,125,46,214,20,79,183,93,202,166,6,235,69,248,183,154,124]},"announce":[],"urlList":[]}}