{"title":"Oz the great and powerful 720 mp4(itunes,xbox360,ps3 etc.)","uid":8505356,"size":3473490421,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b1687258644b6c7703d0261f861252ca8fd51900&amp;dn=Oz+the+great+and+powerful+720+mp4%28itunes%2Cxbox360%2Cps3+etc.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dabadguy69","files":-1,"time":1369405399,"description":"video H.264/MPEG-4 AVC\n24 fps\nbitrates 3500k\naudio MPEG-4 AAC\naudio bitrates 160k\nstereo\n\nsynopsis\nA mischievous magician gains the wisdom to become a powerful ruler after being swept away to a land of magic and mystery as director Sam Raimi and screenwriters Mitchell Kapner and David Lindsay-Abaire (Rabbit Hole) explore the genesis of author L. Frank Baum's enduring tales of Oz. Shady illusionist Oscar Diggs (James Franco) enchants curious audiences at a Kansas circus. A self-professed con man, he's a fast-talking performer who aspires to follow in the footsteps of inventors like Thomas Edison. Oscar is being chased across the circus grounds by the rampaging Strongman when a tornado blows in and everyone runs for cover. Seeing a hot-air balloon as his only chance for escape, the illusionist jumps in and cuts himself free. Magically transported to the wondrous world of Oz, he soon encounters Theodora (Mila Kunis), a temperamental witch who surmises that he is the wizard named after their land (Oscar's nickname is Oz), foretold to fall from the sky, defeat a nasty witch, and ascend to the throne. Theodora takes Oscar to the Emerald City to meet her sister Evanora (Rachel Weisz), a powerful witch who reveals that he cannot become the rightful ruler of Oz until he's accomplished his mission. Later, as Oscar and his new flying-monkey companion Finley (voice of Zach Braff) prepare to face their fearsome enemy, they're joined by the fragile but fearless China Girl (voice of Joey King) and benevolent witch Glinda the Good (Michelle Williams), who help them prepare for the arduous battle ahead. Together with the brave people of Oz, Oscar draws up a plan to rid the land of evil once and for all, and become the great and powerful king who will rule from his throne in the Emerald City.\n\nseed and enjoy","torrent":{"xt":"urn:btih:b1687258644b6c7703d0261f861252ca8fd51900","amp;dn":"Oz+the+great+and+powerful+720+mp4%28itunes%2Cxbox360%2Cps3+etc.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1687258644b6c7703d0261f861252ca8fd51900","infoHashBuffer":{"type":"Buffer","data":[177,104,114,88,100,75,108,119,3,208,38,31,134,18,82,202,143,213,25,0]},"announce":[],"urlList":[]}}