{"title":"Donovan - The Reedy River (Bootleg) Live in USA 1968 [192kbps]","uid":5869065,"size":65121204,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b28b8fc32f5a04a3250bf42129ca216b4993273e&amp;dn=Donovan+-+The+Reedy+River+%28Bootleg%29+Live+in+USA+1968+%5B192kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ashm1986","files":-1,"time":1286390857,"description":"This bootleg is, to me anyway, the best Donovan boot. It's ripped from a Black Panther Label vinyl and the sound quality is not spectacular.\n\nNevertheless, the performance quality is beyond description. LaleÃƒÂ±a, Happiness Runs and possibly Two Lovers are from The Smothers Brothers Comedy Hour broadcast of 17th November 1968. On the bootleg, Two Lovers appears after Happiness Runs and no obvious edit can be heard. But the tape has Time is on the Run (The Main Thought) immediately after Happiness Runs with no obvious edit either. The video copy that the tape was dubbed from may not be a complete performance, but on the other hand, the original bootlegger may have been messing around with the material too. This may explain why Time is on the Run is inexplicably missing from the bootleg track list. Giggle in a Bubbly Bath, Angel's Thoughts, Come to me now Joyfully and To Love me are from The Smothers Brothers Comedy Concert Hour broadcast of 23rd March 1969.\n\n\n   Genre: Folk\n\n   Track Listing:\n\n   1. Colours (Duet With Joan Baez)\n   2. Jennifer Juniper\n   3. Giggle in a Bubbley Bath\n   4. Rules and Regulations\n   5. Angel's Thoughts\n   6. Come To Me Now Joyfully\n   7. To Love me a.k.a. Lassie Lay Doon\n   8. Lalena\n   9. The Ferryman's Daughter\n  10. Lord of the Reedy River listed as The Reedy River\n  11. Happiness Runs\n  12. Two Lovers listed as A Poem by Yeats\n  13. Hey Gyp (Dig the Slowness) listed as Hey Gyp\n  14. To Try for the Sun listed as I'll Try For The Sun\n  15. Someone's Singing\n  16. Mellow Yellow\n  17. The Sun is a Very Magic Fellow\n\n   Constant bit rate: 192kbps\n\n   Front cover only. \n\n\nPlease note the above info on sound quality, but then it is a rare old bootleg. Doesn't sound too bad to me for original 60's audio.\n\n\n\nI will be uploading 1 more Donovan album to add to the collection I've already put up, am putting them here so they're accessible to more people. Enjoy and remember to play your part and seed. Keep them alive for others! :)\n","torrent":{"xt":"urn:btih:b28b8fc32f5a04a3250bf42129ca216b4993273e","amp;dn":"Donovan+-+The+Reedy+River+%28Bootleg%29+Live+in+USA+1968+%5B192kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b28b8fc32f5a04a3250bf42129ca216b4993273e","infoHashBuffer":{"type":"Buffer","data":[178,139,143,195,47,90,4,163,37,11,244,33,41,202,33,107,73,147,39,62]},"announce":[],"urlList":[]}}