{"title":"Knorretjes Grote Film NL Gesproken - NLT Release","uid":4313359,"size":723266609,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b2dfddbc7acac85e4b5345c384eeee3244904c5f&amp;dn=Knorretjes+Grote+Film+NL+Gesproken+-+NLT+Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"diddle783","files":3,"time":1216934899,"description":"Dit is Knorretjes allereerste film... en het is een hele GROTE! Zoals je gewend bent van alle films van Winnie de Poeh zul je ook genieten van KNORRETJES GROTE FILM. Een heerlijk verhaal over vriendschap, plezier en waardering, waarin iedereen leert dat je niet altijd groot hoeft te zijn om grote dingen te doen!\n\nKnorretje verdwijnt in het Honderd Bunder Bos nadat hij gehoord heeft dat hij &amp;#039;te klein&amp;#039; is om Poeh, Teigetje, Iejoor, Roe en Konijn te helpen bij hun zoektocht naar honing. Samen maken ze een plan om hem weer te vinden en gebruiken hiervoor Knorretjes schetsboek waar allemaal aanwijzingen in staan. Terwijl ze aan het zoeken zijn, realiseren ze zich hoe groot Knorretjes rol eigenlijk is geweest in hun vele avonturen. Dan, als Poeh in een moeilijke situatie terechtkomt, verschijnt er een superheld ter grootte van je-weet-wel-wie op het toneel. Met een heleboel moed en een beetje geluk... zou hij wel eens de redder in nood kunnen zijn!\n\nDe film zit boordevol avontuur, humor en liefde - en vijf nieuwe liedjes. Het hele gezin zal steeds weer met KNORRETJES GROTE FILM genieten, meezingen en lachen!","torrent":{"xt":"urn:btih:b2dfddbc7acac85e4b5345c384eeee3244904c5f","amp;dn":"Knorretjes+Grote+Film+NL+Gesproken+-+NLT+Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2dfddbc7acac85e4b5345c384eeee3244904c5f","infoHashBuffer":{"type":"Buffer","data":[178,223,221,188,122,202,200,94,75,83,69,195,132,238,238,50,68,144,76,95]},"announce":[],"urlList":[]}}