{"title":"Latex  (DVD.xvid) - anal, DP, big tits, fetish","uid":4676111,"size":705503232,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b2e2db8d45f1b8c95faa7640638c705ef5014555&amp;dn=Latex++%28DVD.xvid%29+-+anal%2C+DP%2C+big+tits%2C+fetish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"h0tspurred","files":1,"time":1232906348,"description":"Latex (DVDrip.xvid)\n\n\n\n\n\n\nscreens + DVD-covers:\n &lt;a href=&quot;\nhttp://aaa.blogbugs.org/6022284/Latex---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aaa.blogbugs.org/6022284/Latex---screens.html&lt;/a&gt;\n\n\n  \t\n\n\n \nActresses\n\n    * Barbara Doll             [Facial]\n    * Debi Diamond             [BJOnly Facial]\n    * Emerald Estrada          [Anal]\n    * Jeanna Fine              [Anal DP]\n    * Jordan Lee               [LezOnly]\n    * Juli Ashton              [Anal Facial]\n    * Kelly Nichols            [NonSex]\n    * Lacy Rose                [Facial]\n    * Sunset Thomas            [Anal Facial]\n    * Tasha Blades             [LezOnly]\n    * Tyffany Million          [Anal Bald]\n    * Veronica Hart            [NonSex]\n \n   \nScene Breakdowns\n\n    * Scene 1. Sunset Thomas, Zack Thomas\n    * Scene 2. Debi Diamond, Emerald Estrada, Jon Dough\n    * Scene 3. Sam Cooper, Tyffany Million\n    * Scene 4. Barbara Doll, Jordan Lee, Lacy Rose, Tasha Blades\n    * Scene 5. Barbara Doll, Brick Majors, Lacy Rose\n    * Scene 6. Cal Jammer, Juli Ashton, Tom Byron\n    * Scene 7. Colt Steel, Sunset Thomas\n    * Scene 8. Jeanna Fine, Richie Razor, Vince Vouyer\n    * Scene 9. Jon Dough, Sunset Thomas\n\n\n\nStudio:  Hustler\nDistributor:  VCA\nDirector:  Michael Ninn\nReleased:  1995\n\n\n\n\nREVIEW:\n\nThe First Word:  One of the pioneering works in adult films, Latex is like a modern day CafÃƒÂ© Flesh.  It's one of the videos that made Michael Ninn one of the premier creative visionaries in X and is one of the best of 90's porn.\n\nWhat's It About?:  This is a sci-fi themed feature starring Jon Dough as Malcolm Stevens, a patient in a futuristic mental institution, arrested for vagrancy and public disorder.  His case history and psychological profile come alive though a series of vignettes, all of which are highly sexual.    \n\nThe first one is set in a 1950's kitchen, where  a housewife (Sunset Thomas) dons a pair of yellow rubber gloves.  Turned on by the scent of the latex, she begins to masturbate in various places in the kitchen.  While it doesn't look terribly comfortable, the unlubed gloves penetrating her pussy will probably work for latex fetishists.  Her husband (Zach Thomas) then enters with a &quot;Honey, I'm home&quot; before eat her for dinner on the kitchen table.  Then, with Sunset's continuous moaning echoing through the speakers, he fucks her in several positions on the table before penetrating her anally.  The best bits of this scene come at the end as Zach slowly shoves his cock into her ass and then shoots his load on her outstretched tongue.\n\nNext, Jon gets sucked by Debi Diamond before Emerald Estrada rides him reverse cowgirl.  Both girls are dressed as pony girls in open faced latex hoods and studded leather lingere, and they have white makeup on their faces.  After both vag and anal sex, the scene ends with a spurting oral cumshot. There's a good amount of post cumshot sucking and play, which is a refreshing change from the typical &quot;pop then fade out.&quot;\n\nTyffany Million plays Dr. Mangrove, a specialist concludes that his memories are mutations of pop culture images from his childhood.  &quot;Malcom&quot; reveals he has the power to read minds and see one's darkest fantasies.  After a long rant, he shows Dr. Mangrove her visions, specifically a fantasy where the doctor is clad in black latex and sucking the tongue of her assistant (Sam Cooper), now dressed in a business suit.  After unzipping the crotch of her latex outfit, exposing her bunghole, Sam first licks then finger fucks her ass.  The domination continues as his tie is first used as a gag then as a blindfold.  After a limp blowjob, she's bent over the table and fucked hard from behind, yielding some especially nice penetration shots as Sam ramrods into her while she holds a vibe against her clit and then again when he slips into her ass.\n\nOne of &quot;Malcolm's&quot; dreams involved four big-tited girls (Barbara Doll, Jordan Lee, Lacy Rose, and Tasha Blades) in short blonde wigs and pastel colored latex dresses.  After some go-go dancing, they begin to play with each other's breasts before abruptly delving into hardcore lesbian action with dildoes mounted on vacuum hoses.  \n\nThe next scene transitions seamlessly from the latex dress dream as Brick Majors appears, nude except for an armor plated loin cloth.  For some reason, the four girls are now in black, open breasted latex outfits.  And while Jordan and Tasha masturbate with the vacu-dildos in the background, Lacy and Barbara take on Brick, then one another as Brick has his way with them.  The scene ends with a nice facial over both girls.\n\nWhen &quot;Malcom's&quot; delusions take him into a fantasy of being on a talk show with Juli Ashton, we see an 80's fantasy between Juli, Colt Steele, and Tom Byron (the latter in a his long hair and goatee phase of his career).  Juli looks uncharacteristically bad with way too much makeup, wild big hair, and a punk latex outfit.  Juli is plugged vigorously on both ends until the two guys cum on her as the jingle for &quot;The Juli Show&quot; plays in the background (definitely a Passolini touch!).\n\nScene number 7 starts out with Colt Steele (as Jon Dough ex machina) sucking on Sunset's jugs after snapping off her nifty snap-on bra cups.  From there, it's pretty much a repeat of scene 1 in terms of action and positions.  Maybe it's intentional deja vu, especially since there's a lot of looped footage throughout the movie, but it's more of a throwaway scene.\n\nThe next scene is my personal favorite as &quot;Malcom's&quot; ex-wife, played by Jeanna Fine has a threesome in front of his trial, held on a stage in a stadium.  It's so notable because the Jeanna, one of porn's all-time cock-sucking queens and dirty talkers, goes to town on Vince Voyuer's cock while getting fucked from behind by Richie Razor.  And when I say &quot;goes to town,&quot; I mean it -- she gives him an awesome hands-free, deep throat blowjob.  Jeanna does the only DP in the movie, but a lot of the heat is taken away by a very visible and distracting zit on her rump. \n\nThere's a funny pseudo-sex scene where Sunset gets a very massive, yet obviously fake, facial from a completely latex encased figure (supposedly Jon Dough, but obviously just someone wrapped from head to toe in leather and sporting a ersatz cock and a whole bunch of homemade cum substitute).  This comes as the movie wraps up...I won't give away the ending but it has a nice, even though somewhat predictable, twist that brings this twisted tale to an end.\n\nWhat I liked: I clearly remember being impressed by how truly ground breaking Michael Ninn was at the time.  I mean, practically all of the adult films in the 1990s are crap, relying on bad actors and bad writing to string a bunch of fuck scenes together.  But pioneers like Ninn tried to bring together good writing, costumes, set design, computer effects, and top stars together to produce some quality porn.  At a time when Ed Powers was cranking out hours of crap shot on a handheld camera in his house, VCA comes up with the Blade Runner equivalent for the industry.  While certainly the production quality in general has improved for adult videos and the content has gotten more explicit and specialized, I can still watch Latex and be both impressed and turned on.  Try to say the same thing about any other porno -- there aren't that many that manage to do both.\n\nWhat I didn't like: Long dialogue scenes and too many effects: I think Antonio Passolini (writer) and Ninn lost sight at times that this is a porno because some of the dialogue scenes are boringly long.  1984, this isn't, so trying to set up the &quot;big brother&quot; plot with extended speeches and visual imagery when most people are watching this movie to see people fuck probably wasn't the best decision.  Also, the special effects that probably looked cool in 1995, including extensive computer graphics, lots of black and white, slow motion, warped audio, dropped frames, and quick edits, now just look tired and dated.  They also set the stage for all of the &quot;MTV-style&quot; pornos that followed, which I can only handle in small doses and under a doctor's supervision.\n\nFake tits and men with long hair:  Most of the girls in this movie have implants, and in a few cases, bolt-on boobs.  Blech!  And most of the guys have long, greasy-looking hair.  Get a haircut!  I never really cared for Jon Dough or Tommy Byron with long hair -- maybe some women dig it, but really gets on my nerves.\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:b2e2db8d45f1b8c95faa7640638c705ef5014555","amp;dn":"Latex++%28DVD.xvid%29+-+anal%2C+DP%2C+big+tits%2C+fetish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2e2db8d45f1b8c95faa7640638c705ef5014555","infoHashBuffer":{"type":"Buffer","data":[178,226,219,141,69,241,184,201,95,170,118,64,99,140,112,94,245,1,69,85]},"announce":[],"urlList":[]}}