{"title":"Gary Higgins - Red Hash 1973 (V0)","uid":9501454,"size":96693103,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b3d00a9b575d3dfd68df20687c89ae0d7c269a75&amp;dn=Gary+Higgins+-+Red+Hash+1973+%28V0%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1390237435,"description":"\n\nGary Higgins' only album has much in common with many other vaguely hippie-ish singer/songwriter records from the early '70s on small or vanity labels. There's a laid-back feel that seems two or three years out of time (or behind the times), like an exhausted hangover from the wilder peaks of the psychedelic era. Relative to this collector-oriented genre, however, the record's very much above average. For one thing, the production is much better than it is for many such endeavors that suffered from limited distribution -- subdued and no frills, perhaps, but clear, well recorded, and well played and sung. Too, few other records of this sort are so downright melancholy, though without succumbing to the unhinged despair that consigns many of them to an extremely limited audience. It's more like being trapped in a room where the candles are burning down to their wicks, with the knowledge that there will be no encores once the music's over. Higgins was in prison in the early '70s, and while it might be too much to project his personal circumstances onto judgment of the proceedings, it does rather sound like the musings of a gentle soul who somehow lost his way or got steered down the wrong path. There are dark insinuations of insomnia, doubt, a loss of hope, and in the last lyric of the closing &quot;Looking for June,&quot; desperate wondering as to where he's gonna get some dope. &quot;Down on the Farm&quot; sounds almost like a folky Captain Beefheart with its guttural vocals and twisted blues progressions, but it's not typical of an album that usually goes for a far more placid and mainstream (though slightly bent) singer/songwriter sound.\n","torrent":{"xt":"urn:btih:b3d00a9b575d3dfd68df20687c89ae0d7c269a75","amp;dn":"Gary+Higgins+-+Red+Hash+1973+%28V0%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3d00a9b575d3dfd68df20687c89ae0d7c269a75","infoHashBuffer":{"type":"Buffer","data":[179,208,10,155,87,93,61,253,104,223,32,104,124,137,174,13,124,38,154,117]},"announce":[],"urlList":[]}}