{"title":"Greenaway et al - Not Mozart - 1991","uid":6774283,"size":7740856320,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b43153ba41bab6f57fb79e1d928c9bbc5bc4e073&amp;dn=Greenaway+et+al+-+Not+Mozart+-+1991&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oddeven","files":-1,"time":1319683763,"description":"Six shorts, experimentally, conceptually, not Mozart exactly:\n\n&quot;M Is for Man, Music and Mozart,&quot; composed by Louis Andriessen and directed by Peter Greenaway \n&quot;Bring Me the Head of Amadeus,&quot; composed by H.K. Gruber and directed by Barrie Gavin (in German)\n &quot;Letters, Riddles and Writs,&quot; composed by Michael Nyman and directed by Jeremy Newson and Pat Gavin.\n&quot;N*t M*zart,&quot; composed by Mathias Ruegg and directed by Ernst Grandits \n&quot;WAM! Ltd,&quot; composed by Misha Mengelberg and directed by Anthony Garner\n&quot;Scipio's Dream,&quot; composed by Judith Weir and directed by Margaret Williams \n\n\nThe Greenaway style, this time around, is reminiscent of &quot;A TV Dante&quot; or &quot;Prospero's Books&quot;. \n\nA lot of &quot;we're classical, we're geeks, we're so cool&quot; attitude.\n\nThe subtitles are either on or off for the entire film. I couldn't find a way to just have them on for the non-English parts.\n\nA young Timothy Spall is the center of &quot;WAM! Ltd&quot;. Plenty of important names show up in the credits, Ute Lemper and David Cunningham to name a couple.\n\nThe collection itself does not have an IMdB entry, but most of the individual pieces do. I linked to the Greenaway contribution.\n\nNyman and Greenaway contribute to separate films here. Nyman actually gets some writing credit for &quot;Letters, Riddles and Writs&quot; and it is much like his earlier ventures into English operetta.\n\nUncompressed NTSC DVD9 VIDEO_TS files","torrent":{"xt":"urn:btih:b43153ba41bab6f57fb79e1d928c9bbc5bc4e073","amp;dn":"Greenaway+et+al+-+Not+Mozart+-+1991","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b43153ba41bab6f57fb79e1d928c9bbc5bc4e073","infoHashBuffer":{"type":"Buffer","data":[180,49,83,186,65,186,182,245,127,183,158,29,146,140,155,188,91,196,224,115]},"announce":[],"urlList":[]}}