{"title":"[PSP] Hammerin' Hero [USA]","uid":4846090,"size":131412125,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:b4e1f09540078ca1d1e5304a998de7f626673cee&amp;dn=%5BPSP%5D+Hammerin%5C%27+Hero+%5BUSA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ythan","files":1,"time":1239689867,"description":"In Hammerin' Hero, if it moves, hammer it! Smash your way through 12 distinct levels, including city streets, an amusement park, a TV studio, a baseball stadium, and more. With ad-hoc multiplayer, players can hammer with a friend to compete for the best score on each level.\n\nHammerin' Hero marks the triumphant return of Gen, everyone's favorite justice-bringing carpenter! Help Gen fight off Hyosuke Kuromoku and his evil construction company before they can evict Gen's neighbors from their homes! Gen will have to use a variety of jobs-from DJ to baseball player-through 12 diverse stages if he hopes to thwart the all-out attack of the Kurokomu Group and win the hearts of the people, even if it sometimes means giving them the tough love they need to solve their own problems.\n\nKey Features\n\n    * Wacky side-scrolling beat 'em up - Play as Gen-san as he hammers away at corporate evil across Japan and the world in this vibrant, action-packed platformer. The comic adventure unfolds fully-voiced in English and Japanese.\n\n    * Be more than a hammerin' hero - Choose from a variety of jobs, including sushi chef, baseball player, and diver, to give Gen different costumes and attacks as he fights through 12 crazy stages. Along the way, make allies in battle, collect loads of items, and even unlock two more playable characters!\n\n    * Ad-hoc multiplayer - 2 players can play together and compete for the best score on each level over ad-hoc wireless play. Why hammer alone when you can hammer with a friend?\n\nHammerin' Hero has been rated &quot;E10+&quot; for Everyone 10 and Older with Alcohol and Tobacco Reference, Cartoon Violence, Comic Mischief, and Mild Language by the ESRB.","torrent":{"xt":"urn:btih:b4e1f09540078ca1d1e5304a998de7f626673cee","amp;dn":"%5BPSP%5D+Hammerin%5C%27+Hero+%5BUSA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4e1f09540078ca1d1e5304a998de7f626673cee","infoHashBuffer":{"type":"Buffer","data":[180,225,240,149,64,7,140,161,209,229,48,74,153,141,231,246,38,103,60,238]},"announce":[],"urlList":[]}}