{"title":"GAY: To the Last Man: The Gathering Storm (2009.xvid)","uid":4712972,"size":1660753921,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b50dd76fa3694843f69a24d1bcf3bf5ae6c7bb00&amp;dn=GAY%3A+To+the+Last+Man%3A+The+Gathering+Storm+%282009.xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pure_screens","files":3,"time":1234132405,"description":"GAY: To the Last Man - The Gathering Storm (DVD.xvid)\n\n\n\n\n\n\nscreens + large DVD-covers:\n &lt;a href=&quot;\nhttp://transworld.blogbugs.org/7289117/To-the-Last-Man-The-Gathering-Storm---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://transworld.blogbugs.org/7289117/To-the-Last-Man-The-Gathering-Storm---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\n\nStarring: \nAntonio Biaggi, Antton Harri, Damian Rios, Damien Crosse, Dan Rhodes, Jackson Wild, Jake Deckard, Jimmy Tripps, Logan McCree, Rick Powers, Ricky Sinz, RJ Danvers, Scott Campbell, Scott Tanner, Tristan Jaxx \n\n\n\n\nThemes: Muscle Guys, Huge Cocks, Bathroom/Shower Sex, Bondage/BDSM, Cowboys, 3 Ways, Public Sex, Submissive, S&amp;M\n\nRunning Time:   Approx 3 Hours\nDirector:       Chris Ward, Ben Leon, Tony Dimarco\nRating:         XXX\nStudio:         Raging Stallion Studios\nReleased:       01/2009\nFormat:         Xvid\n\n\n\nREVIEW:\n\nCo-director Chris Ward calls the controversial, much-anticipated western epic &quot;the most significant porn movie of the year.&quot;\n\n\nSAN FRANCISCO - To the Last Man: The Gathering Storm, the first half of Raging Stallion's controversial XXX western epic, has shipped and should be showing up on retail store shelves very soon, the studio said Wednesday.\n\n \nThe complete two-part version saw limited online release over Thanksgiving weekend, and consumer response led Raging Stallion president Chris Ward to conclude the studio has a bona fide blockbuster on its hands.\n\n\n&quot;We think [sales of] this movie will hit numbers in excess of 15,000 units, which in these troubled times is a huge, huge hit,&quot; said Ward, who also co-directed the movie. &quot;It should perform at least as well as Grunts [which topped industry sales charts for 2008]. European orders, which were somewhat weak for Grunts, are exceptionally strong [because] the Western theme [is] especially attractive to customers overseas.\n\n \n&quot;Reviews for To the Last Man are beginning to appear around the Web and they have been unanimously positive, with many claiming this film may be the best gay porn movie produced in many, many years,&quot; he added. &quot;Customers have also been posting high praise on blogs and in direct feedback.&quot;\n\n \nThe film, which stars Ricky Sinz, Scott Tanner and Jake Deckard, is controversial because it contains graphic violence: All but one of the characters is killed during the course of the story.\n\n \nShot on location in the Arizona high country, To the Last Man was directed by Ward, Ben Leon and Tony Dimarco. Production values reportedly rival those found in Hollywood movies.\n\n \n&quot;This is probably the most significant porn movie of the year,&quot; Ward said. &quot;We have found that customers like big movies, so we hope to continue making them - even though it gets harder and harder with the economy sinking by the day.&quot;\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:b50dd76fa3694843f69a24d1bcf3bf5ae6c7bb00","amp;dn":"GAY%3A+To+the+Last+Man%3A+The+Gathering+Storm+%282009.xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b50dd76fa3694843f69a24d1bcf3bf5ae6c7bb00","infoHashBuffer":{"type":"Buffer","data":[181,13,215,111,163,105,72,67,246,154,36,209,188,243,191,90,230,199,187,0]},"announce":[],"urlList":[]}}