{"title":"Mythology - Native American Myths, Vol 1 (pdf) EarthBow","uid":4667149,"size":133890270,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5617e6a0a20399b31ec0ca6ea7d9e9d42a09336&amp;dn=Mythology+-+Native+American+Myths%2C+Vol+1+%28pdf%29+EarthBow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"EarthBow","files":12,"time":1232607406,"description":"This torrent contains...         (all .pdf format)\n\nAlexander, Hartley - American Indian Myth Poems, 1922, 8 pages\nSmaller than my usual uploads, this work has been included because it is unique in its genre. Contains 7 beautiful short poems.\n\nAustin, Mary - The Mary Austin Collection, 2003, 113 pages\nThis is a collection of Mary Austin's writings I assembled into an eBook several years ago. Austin lived in California, and her writings deal with the natives of that region.\n\nBogoras, Waldemar - Chukchee Mythology, 1910, 202 pages\nThis is a collection of myths, legends, and tales collected by the Jesup North Pacific Expedition in 1900 and 1901, originally published by the American Museum of Natural History.\n\nCatlin, George - Life among the Indians, 1861, 358 pages\nCaitlin spent a great deal of his life traveling and living with various tribes. Although most known for his paintings, he also collected many myths and legends. This book is a collection of folklore collected during his last expedition among the Indians.\n\nEastman, Charles - Indian Boyhood, 1902, 127 pages\nCharles Alexander Eastman is unique among Indian writers, having been raised by his grandmother in the traditional ways of the Woodland Sioux. His early experiences gave him thorough first-hand knowledge of the life-ways, language, culture, and oral history of these Native People.\n\nEastman, Charles - Indian Heroes and Great Chieftains, 1918, 85 pages\nFirst published in 1918, Indian Heroes and Great Chieftains contains biographical vignettes of fifteen great Indian leaders, most of them Sioux and some of them, (like Red Cloud and Rain-in-the-Face), friends and acquaintances of Eastman.\n\nFarrand, Livingston - Traditions of the Quinault Indians, 1902, 60 pages\nThis is another group of myths and legends collected by the Jesup North Pacific Expedition from the Quinault tribe of Washington state.\n\nKroeber, AL - Indian Myths of South Central California, 1907, 92 pages\nThis is a nice collection of the myths and legends of the Natives of California, originally published by the University of California's Department of American Archaeology and Ethnology. \n\nSkinner, Alanson - Associations and Ceremonies of the Menomini Indians, 1915, 56 pages\nThis book explains some of the customs, folklore, and mythology of the Menomi Indians of Wisconsin. The book's focus is on their religious societies, dances (and their meanings), and a little about their supernatural beliefs and practices.\n\nTeit, James - Mythology of the Thompson Indians, 1912, 224 pages\nAnother of the books written after the Jesup North Pacific Expedition, this one relates mythology and legends of the British Columbia's Thompson Indians.\n\n\nNote: I will be adding many more titles soon, Search for &quot;EarthBow&quot; for a list of available titles.\n\nAs always, comments (good or bad) are appreciated\n\nKeywords: native american, american indian, mythology, myth, legend, folklore, religion, beliefs, dances, societies\n","torrent":{"xt":"urn:btih:b5617e6a0a20399b31ec0ca6ea7d9e9d42a09336","amp;dn":"Mythology+-+Native+American+Myths%2C+Vol+1+%28pdf%29+EarthBow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5617e6a0a20399b31ec0ca6ea7d9e9d42a09336","infoHashBuffer":{"type":"Buffer","data":[181,97,126,106,10,32,57,155,49,236,12,166,234,125,158,157,66,160,147,54]},"announce":[],"urlList":[]}}