{"title":"Gnomoria v0.8.36","uid":8406285,"size":206347560,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b58d8b01dc3fa7960564457291b7db0994c7a807&amp;dn=Gnomoria+v0.8.36&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aedziex23","files":-1,"time":1366815222,"description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies! \n\nGnomoria v0.8.36\n\nGeneral\n\n-Professions can have a Uniform assigned to them.  If a Gnome is in a Squad, the Squad uniform is used instead\n-A Uniform can be assigned as the Default Uniform for all Professions from the Population Overview menu.  Professions can be assigned to use the Default, No Uniform or a specific Uniform\n-Removed Militia Perk. All Squad members will perform jobs when not on duty\n-Armor decreases the rate at which jobs complete.  Metal slows down more than leather\n-Gnomes not in a Squad will prioritize retreating to stop bleeding over staying and fighting\n-Gnomes not in a Squad will always attempt to run from enemies.  Previously they would fight unarmed goblins or    potentially unarmored goblins with 1 weapon\n-Added import and export options for Military settings\n-Moved Professions import/export buttons to the Pause menu\n-Windows will keep their size and position during a game session\n\nFixed\n\n-Professions with a space in the name not importing correctly\n-Sometimes not importing the last Profession\n-Market Stall UI not correctly scrolling with the mouse wheel\n-Fix crash when resizing Market Stall UI while a merchant is not present\n-Gnomes sometimes falling asleep when digging down\n-Mant spawns effectively being 1 tier above where they should have been, ie spawning as if you had iron when you had bronze\n\n\nXNA Framework.NET Framework are included in the _CommonRedist Folder. (Install these first.)\n\nYou can help the developer and buy the game on steam here: http://store.steampowered.com/app/224500/\n","torrent":{"xt":"urn:btih:b58d8b01dc3fa7960564457291b7db0994c7a807","amp;dn":"Gnomoria+v0.8.36","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b58d8b01dc3fa7960564457291b7db0994c7a807","infoHashBuffer":{"type":"Buffer","data":[181,141,139,1,220,63,167,150,5,100,69,114,145,183,219,9,148,199,168,7]},"announce":[],"urlList":[]}}