{"title":"Flexible Web Design (scuba-doo) [eRG]","uid":6640906,"size":22303729,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b77b95c54927a0884cdb153b3eb4af060da6aa1d&amp;dn=Flexible+Web+Design+%28scuba-doo%29+%5BeRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"scuba-doo","files":-1,"time":1314742020,"description":"- Paperback: 336 pages\n- Publisher: New Riders Press; 1 edition (December 14, 2008)\n- Language: English\n- ISBN-10: 0321553845\n- ISBN-13: 978-0321553843\n\nDescription:\n\nLiquid or fluid layouts change width based on the user's unique device viewing size. These types of layouts have always been possible with tables but offer new design challenges as well as opportunities when built with CSS. This book, for experienced Web designers with some CSS experience, outlines how to do this successfully.\n\nDesigners will learn the benefits of flexible layouts and when to choose a liquid, elastic, or hybrid design. They will learn not only how to build a liquid layout from scratch using standards-compliant and cross-browser compatible (X)HTML and CSS, but will also learn how to design and slice their graphic comps in a way that makes flexible design achievable. This book will show designers that flexible layouts do not have to be visually boring or difficult to build when planned and built correctly. Even those who do not intend to build liquid layouts can use the concepts and techniques taught in this book to improve their fixed-width CSS designs, because they will learn how to design for the inherent flexibility of the web medium, instead of the rigid qualities of print media or table grid-based layouts.\n\n\nAbout the Author:\n\nZoe Mickley Gillenwater is an experienced web designer, project manager and technical author, active in the web standards community. She uses her expert knowledge of CSS, XHTML, Dreamweaver, accessibility, and visual design in all aspects of her career. Zoe leads the design and development efforts of dozens of information-rich web sites and applications. Her work has focused on creating web sites that combine beautiful aesthetics with standards compliance, usability, and accessibility best practices.\n\n\nHASH:     B77B95C54927A0884CDB153B3EB4AF060DA6AA1D\n\n\nscanned with Kaspersky  + SuperAntiSpyware + Malwarebytes = Malware FREE\n\nENJOY\n       scuba-doo\n\n\nshare the wealth and seed, comments are more then welcome","torrent":{"xt":"urn:btih:b77b95c54927a0884cdb153b3eb4af060da6aa1d","amp;dn":"Flexible+Web+Design+%28scuba-doo%29+%5BeRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b77b95c54927a0884cdb153b3eb4af060da6aa1d","infoHashBuffer":{"type":"Buffer","data":[183,123,149,197,73,39,160,136,76,219,21,59,62,180,175,6,13,166,170,29]},"announce":[],"urlList":[]}}