{"title":"Laura Ingraham Sept 8 Hillary Forum","uid":15794193,"size":33892643,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b88040b4e9540af6b266a62a204c6abbd5d232cc&amp;dn=Laura+Ingraham+Sept+8+Hillary+Forum&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1473430276,"description":"Laura Ingraham Sept 8, 2016\r\nJudge Gonzales: 'Watching Hillary At The Forum Was Painful' \r\nLaura Anne Ingraham is an American radio talk show host, best-selling author, and conservative political commentator. Her nationally syndicated talk show, The Laura Ingraham Show, airs throughout the United States on Courtside Entertainment. Wikipedia\r\n\r\nAlberto Gonzales\r\nFrom Wikipedia, the free encyclopedia\r\n\r\nAlberto R. Gonzales (born August 4, 1955) was the 80th United States Attorney General, appointed in February 2005 by President George W. Bush, becoming the highest-ranking Hispanic American in executive government to date.[1] He was the first Hispanic to serve as White House Counsel, and earlier he had been Bush's General Counsel during his governorship of Texas. Gonzales had also served as Secretary of State of Texas and then as a Texas Supreme Court Justice.\r\n\r\nGonzales's tenure as U.S. Attorney General was marked by controversy regarding warrantless surveillance of U.S. citizens and the legal authorization of so-called &quot;Enhanced interrogation techniques&quot; (i.e., much later, generally-acknowledged as constituting torture), in the U.S. government's post-9/11 &quot;war on terrorism&quot;. Following partisan calls for his removal, Gonzales resigned from the office &quot;in the best interests of the department,&quot; on August 27, 2007, effective September 17, 2007.[2] Democrats were particularly opposed to Gonzales presiding over the firings of several U.S. Attorneys who had refused back-channeled White House directives to prosecute political enemies — allegedly causing the office of Attorney General to become improperly politicized.[3]\r\n\r\nIn 2008, Gonzales began a mediation and consulting practice. Additionally, he taught a political science course and served as a diversity recruiter at Texas Tech University. Gonzales is currently the Dean of Belmont University College of Law, in Nashville, Tennessee, where he currently teaches Constitutional Law, Separation of Powers, National Security Law and First Amendment Law. He is also counsel at a Nashville-based law firm, Waller Lansden Dortch &amp; Davis, where he advises clients on special matters, government investigations and regulatory matters. He often writes opinion pieces for national newspapers [4][5] and appears on national news programs.[6][7] He was ranked one of &quot;Newsmax's 50 Most Influential Latino Republicans&quot; in 2016.[8]\r\n \nhttp://www.lauraingraham.com/","torrent":{"xt":"urn:btih:b88040b4e9540af6b266a62a204c6abbd5d232cc","amp;dn":"Laura+Ingraham+Sept+8+Hillary+Forum","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b88040b4e9540af6b266a62a204c6abbd5d232cc","infoHashBuffer":{"type":"Buffer","data":[184,128,64,180,233,84,10,246,178,102,166,42,32,76,106,187,213,210,50,204]},"announce":[],"urlList":[]}}