{"title":"The Trap - Sir James Goldsmith","uid":7749643,"size":2550517,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8ec065d1a6f526b6b2ddc0b337c99c9053a9e26&amp;dn=The+Trap+-+Sir+James+Goldsmith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1350863667,"description":"In The Trap, one of the most successful businessmen of the era brings his challenging perspective to such key issues as the true effects of global economic integration, the environmental and economic dangers of modern industrial agriculture, and our destabilized society, and offers answers and solutions that will help determine the shape of our world in the 21st century.\n\nJames Goldsmith, after amassing a vast fortune in the 1980s, turned his companies into cash before the stock market collapse on Black Monday. he officially &quot;retired&quot; from business to devote himself to ecological causes. (His brother, Teddy, is the founding father of the British green movement, and publisher of the &quot;Ecologist&quot;). His enquiries led him to confront the worldwide problems of unemployment, urban decay, the poisoning of our food and air, and made obvious the lack of essential solutions politicians, of whatever persuasion, were offering. He confronts in this book, the &quot;sacred cows&quot; of modern political and economic thought, exposing why global free trade will destroy nations, the lies about the nuclear energy industry, why agricultural policy is poisoning and destabilizing communities, and the cost of a welfare state that doesn't deliver welfare.","torrent":{"xt":"urn:btih:b8ec065d1a6f526b6b2ddc0b337c99c9053a9e26","amp;dn":"The+Trap+-+Sir+James+Goldsmith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8ec065d1a6f526b6b2ddc0b337c99c9053a9e26","infoHashBuffer":{"type":"Buffer","data":[184,236,6,93,26,111,82,107,107,45,220,11,51,124,153,201,5,58,158,38]},"announce":[],"urlList":[]}}