{"title":"Food Contaminants - Sources and Surveillance","uid":15160332,"size":13337524,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9f972ee157cfc56c20b12b26a4224e2c9b41e12&amp;dn=Food+Contaminants+-+Sources+and+Surveillance&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467321799,"description":"Food Contaminants - Sources and Surveillance - C. Creaser and R. Purchase (WP, 2004).pdf\r\n\r\nISBN 1855737841\r\n\r\nThis book contains contributions based on the proceedings of two symposia on food contamination held in London in April 1989 and May 1990, both of which were organised jointly by the Environment, Food Chemistry and Toxicology Groups of the Royal Society of Chemistry. The aim of these meetings was to assess the extraneous chemical contamination of food from two sources: firstly, food-chain contaminants - the presence of plant toxicants of fungal metabolites in food, or the contamination of food from environmental sources (airborne, aquatic and terrestrial); and secondly, food-production contaminants - contaminants of man-made origin brought about by a desire to facilitate food production and distribution. The contributors concentrate on the contamination of food by chemicals arising from environmental and food-production sources. Chapter 1 is concerned with food-chain contaminants present in food as natural components of the diet. This is followed by discussion of the chlorinated dioxins and furans, and polycyclic aromatic hydrocarbons. Following an introduction to the control and surveillance of food-production contaminants, four areas of activity are described: migration from food contact materials with particular reference to plastics, the analysis and regulatory control of veterinary products, the analysis of pesticides in drinking water and finally the problem of food taints","torrent":{"xt":"urn:btih:b9f972ee157cfc56c20b12b26a4224e2c9b41e12","amp;dn":"Food+Contaminants+-+Sources+and+Surveillance","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9f972ee157cfc56c20b12b26a4224e2c9b41e12","infoHashBuffer":{"type":"Buffer","data":[185,249,114,238,21,124,252,86,194,11,18,178,106,66,36,226,201,180,30,18]},"announce":[],"urlList":[]}}