{"title":"Amy Devlin Mystery (v1 - v3) (2010+2014) (Digital) (DR &amp; Qui","uid":11398925,"size":442695466,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ba5025403e8b197f3a7916587cbc0c79c8dc17b1&amp;dn=Amy+Devlin+Mystery+%28v1+-+v3%29+%282010%2B2014%29+%28Digital%29+%28DR+%26amp%3B+Qui&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"nemesis43","files":3,"time":1415402183,"description":"Amy Devlin Mystery (v1 - v3) (2010+2014) (Digital) (DR &amp; Quinch-Empire)\n\n\nVol.1 - From the co-writers of AVALON CHRONICLES and PLAY BALL and the artist of WASTELAND! Amy Devlin might not be a licensed Private Investigator but that hasn't stopped her from playing one on the internet! But the case she's about to find herself on is no game. Trevor Schalk was an eccentric millionaire obsessed with reincarnation right up to his murder in 1980. Now Tim Gilbraight is having weird dreams in which he's a bitter, rich man--despised by everyone around him. It's up to Devlin to determine if Schalk is a past life or a past lie.\n\nVol.2 - Three years after the events of Past Lies, Amy Devlin, in her final days in Beverly Hill's Cold Case division, uncovers a series of murders that seem connected through time. Every 10 years, a sinner with a saint's name has been brutally murdered on All Saints Day. With a string of cases spanning 30 years, and another killing likely to occur within the month, can Amy convince anyone these unsolved crimes are connected? And when she starts digging, will she make herself the next victim?\n\nVol.3 - Times are tough for Amy Devlin, and without a case her financial situation is dire. Busting a cold case of kidnapping and murder from years ago may be the answer to her problems. Amy is sure that she can solve the case, but when the powerful, and untouchable, Life Science Institute of Hollywood gets involved, she may wind up with much more than just her reputation on the line","torrent":{"xt":"urn:btih:ba5025403e8b197f3a7916587cbc0c79c8dc17b1","amp;dn":"Amy+Devlin+Mystery+%28v1+-+v3%29+%282010%2B2014%29+%28Digital%29+%28DR+%26amp%3B+Qui","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba5025403e8b197f3a7916587cbc0c79c8dc17b1","infoHashBuffer":{"type":"Buffer","data":[186,80,37,64,62,139,25,127,58,121,22,88,124,188,12,121,200,220,23,177]},"announce":[],"urlList":[]}}