{"title":"Takedown by Jeff Buck (2016).epub Gooner","uid":15155722,"size":2678218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba6d6e78f9b3c6cfbaee052babd6e80ab0b091d3&amp;dn=Takedown+by+Jeff+Buck+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1467299265,"description":"Takedown - A Small-Town Cop's Battle Against the Hells Angels and the Nation's Biggest Drug Gang (2016).epub Gooner\r\n\r\nPublisher: Forge (8 Mar. 2016)\r\nLanguage: English\r\nISBN-10: 0765338092\r\nISBN-13: 978-0765338099\r\n\r\nJeff Buck thought he'd seen it all. Twenty years working undercover in the netherworld of drugs had left him burned out and grateful to assume the quiet job of police chief in the small town of Reminderville, Ohio. That is, until a simple domestic assault case turns out to have links to the murder of a drug runner in upstate New York and a syndicate smuggling billions of dollars in drugs across the U.S.-Canada border.\r\n\r\nAs Buck reluctantly plunges back into his old world of death and deceit, he uncovers a complex chain linking the Hells Angels to the Russian Mafia in a plot to use Native American tribal land to smuggle their deadly wares into the United States. From grow houses set ablaze in Quebec to the insular St. Regis Mohawk Indian Reservation, from board rooms and biker wars to the frozen rivers that serve as private turnpikes for the drug gangs, Buck opposes a serpentine criminal enterprise that has every reason to want to end his crusade in violence and bloodshed.\r\n\r\nUltimately, his efforts lead to an unprecedented slew of indictments on both sides of the border and prison terms for even the kingpins, toppling an empire once deemed invincible. &quot;Takedown &quot;spans the period of December 2007 to June 2009","torrent":{"xt":"urn:btih:ba6d6e78f9b3c6cfbaee052babd6e80ab0b091d3","amp;dn":"Takedown+by+Jeff+Buck+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba6d6e78f9b3c6cfbaee052babd6e80ab0b091d3","infoHashBuffer":{"type":"Buffer","data":[186,109,110,120,249,179,198,207,186,238,5,43,171,214,232,10,176,176,145,211]},"announce":[],"urlList":[]}}