{"title":"La vita e bella / Life is beautiful enhanced dual version (wides","uid":5149195,"size":874539902,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bb35be53ea974f4822e0004519ff1cdee5eab588&amp;dn=La+vita+e+bella+%2F+Life+is+beautiful+enhanced+dual+version+%28wides&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrizzo2","files":-1,"time":1257452648,"description":"Great picture and sound quality. Widescreen formatted too. Chosse to view with \nItalian or English Audio. Embedded subtitle options include English or French.\n\nByth way, I avoid watching a dubbed version of a movie when the original version\nis available with English subtitles. You miss out on a great deal of the flavour\nand affect and in this respect you lose a lot in the translation with a dubbed\napproach. This movie is called &quot;La Vita e bella/Life is beautiful&quot; in the\ncombined Italian/English version and that is how I recommend you purchase it\nas I can tell you that they have done a beautiful job with the English audio\ntoo in this great movie performance.\n\nThis is a movie with a lot of potential to teach. It teaches the value of\nhonesty as a way of life in that this can be fully retained when a man is\nsimply acting in a humorous spirit to make life seem more bearable and to spare\nchildren an ugly reality that surrounds them. Yet there is a spirit that\ncontinues in Benigni's character as a man who'd like to stay sane honestly\nenough that he will conjure up a version of events to keep his audience with\nhim and in good humour. Such characters are always trying for as much real\nhonesty as the situation will allow however they have learned a defensive\ncoping mechanism to telling it like it is. And in this respect perhaps his son\nat the end has a better view of the world than is justified however fact is\nthat he is being lied to by a man who thinks he is being a better father this\nway. Its a great story that touches on the travesty and the tragedy of the\nholocaust, as Italian jews were not spared this fate although many were\nharbored by good Italians who could not go along with Hitler's madness in this\nrespect.\n\nEnjoy! Grazie, especially for all who seed, I'm grateful!\n\nMichael Rizzo Chessman\nreview posted at moviesbyrizzo.info\n\nWe will try to have other subtitles posted for you as they become available\ntoo in SRT format, especially.","torrent":{"xt":"urn:btih:bb35be53ea974f4822e0004519ff1cdee5eab588","amp;dn":"La+vita+e+bella+%2F+Life+is+beautiful+enhanced+dual+version+%28wides","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb35be53ea974f4822e0004519ff1cdee5eab588","infoHashBuffer":{"type":"Buffer","data":[187,53,190,83,234,151,79,72,34,224,0,69,25,255,28,222,229,234,181,136]},"announce":[],"urlList":[]}}