{"title":"Thunder - Shooting At The Sun (2003) @320K","uid":3429646,"size":144988097,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bb91d940973d066c2254ee344284dfa7a9f77e99&amp;dn=Thunder+-+Shooting+At+The+Sun+%282003%29+%40320K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zwiebelchen","files":14,"time":1136824881,"description":"Thunder - Shooting At The Sun\n\nFull-length album\nFrontiers Records, November 18th, 2003\nGenre: Hard Rock\nCountry: UK\n\nLine-up:\nDanny Bowes - Vocals\nLuke Morley - Guitars\nBen Matthews - Guitars, Keyboards\nChris Childs - Bass\nHarry James - Drums\n\nOn this cd:\n1.\tLoser\n2.\tEverybody's Laughing\n3.\tIf I Can't Feel Love\n4.\tShooting At The Sun\n5.\tThe Pimp and the Whore\n6.\tA Lover, Not A Friend\n7.\tShake The Tree\t\n8.\tSomebody Get me A Spin Doctor\n9.\tThe Man Inside\n10.\tOut Of My Head\n11.\tBlown Away\n12.\tRiver Of Pain (live)*\n13.\tSomebody Get Me A Spin Doctor (live)*\n14.\tRiver Of Pain (live video)*\n\n(*bouns tracks on european release)\n\n[metal-invader.com]This is really good news cause most of us thought that UK?s THUNDER split up for good back in 2000. But no, this is not the case. They are back, even stronger, ready to give some lessons about rock. In case you are not familiar with THUNDER keep in mind that their history go as back as the early 1980?s with TERRAPLANE out of whom the nucleus of THUNDER came to be. Also in case you ignore THUNDER?s musical framework, it has to be mentioned, they groove within &quot;real&quot; (some could say &quot;authentic&quot; ) rock fields. This means that they carry on the legacy bands such as FREE, LED ZEPPELIN, BAD COMPANY, EAGLES, ROLLING STONES, AEROSMITH etc. left behind. In other words, a true rock sound that has nothing to do with the so-called &quot;rock&quot; of OASIS and generally that kind of &quot;rock&quot; bands the UK industry and radio had and still has in mind. \n\nTHUNDER?s kind of music is a very rare game in Britain nowadays, at least to a mass scale degree. In fact, it has been this way since ages ago. The only places you get to experience this kind of rock are traditional suburb or countryside pubs, usually with an extremely small audience. Since day one THUNDER is the only band that managed to gather nearly all the remaining fans of rock music there. No other band in the UK who plays like THUNDER had 18 top 40 singles during the 1990?s! \n\nTHUNDER proudly refuse to follow the modern aesthetic of rock music, the one their local music industry has well established since the early 1990?s. THUNDER claim in pride their authentic musical roots, the ones that derive from the long-lost 1970?s. And they not just claim but also they capitalize to the maximum on the music! We ought to support THUNDER for their conscious excitement with real rock and of course to enjoy this brilliantly, sort of old-fashioned record!","torrent":{"xt":"urn:btih:bb91d940973d066c2254ee344284dfa7a9f77e99","amp;dn":"Thunder+-+Shooting+At+The+Sun+%282003%29+%40320K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb91d940973d066c2254ee344284dfa7a9f77e99","infoHashBuffer":{"type":"Buffer","data":[187,145,217,64,151,61,6,108,34,84,238,52,66,132,223,167,169,247,126,153]},"announce":[],"urlList":[]}}