{"title":"Great Shakespeare Actors - 1st Ed (2015).pdf Gooner","uid":12424714,"size":11176809,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bbd622ae5fa71477ef5492bcab2981261130cd7e&amp;dn=Great+Shakespeare+Actors+-+1st+Ed+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1442358499,"description":"Publisher: Oxford University Press; 1 edition (June 23, 2015)\nLanguage: English\nISBN-10: 0198703295\nISBN-13: 978-0198703297\n\nGreat Shakespeare Actors offers a series of essays on great Shakespeare actors from his time to ours, starting by asking whether Shakespeare himself was the first--the answer is No--and continuing with essays on the men and women who have given great stage performances in his plays from Elizabethan times to our own. They include both English and American performers such as David Garrick, Sarah Siddons, Charlotte Cushman, Ira Aldridge, Edwin Booth, Henry Irving, Ellen Terry, Edith Evans, Laurence Olivier, John Gielgud, Ralph Richardson, Peggy Ashcroft, Janet Suzman, Judi Dench, Ian McKellen, and Kenneth Branagh. Individual chapters tell the story of their subjects' careers, but together these overlapping tales combine to offer a succinct, actor-centred history of Shakespearian theatrical performance.\nStanley Wells examines what it takes to be a great Shakespeare actor and then offers a concise sketch of each actor's career in Shakespeare, an assessment of their specific talents and claims to greatness, and an account, drawing on contemporary reviews, biographies, anecdotes, and, for some of the more recent actors, the author's personal memories of their most notable performances in Shakespeare roles","torrent":{"xt":"urn:btih:bbd622ae5fa71477ef5492bcab2981261130cd7e","amp;dn":"Great+Shakespeare+Actors+-+1st+Ed+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbd622ae5fa71477ef5492bcab2981261130cd7e","infoHashBuffer":{"type":"Buffer","data":[187,214,34,174,95,167,20,119,239,84,146,188,171,41,129,38,17,48,205,126]},"announce":[],"urlList":[]}}