{"title":"Morrissey - Years Of Refusal(split tracks + covers)","uid":4733712,"size":64256413,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bbea34ce5e267082129d36d287725d4d3070f09a&amp;dn=Morrissey+-+Years+Of+Refusal%28split+tracks+%2B+covers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michelinman","files":16,"time":1235166398,"description":"[img]http://images.play.com/covers/5800638x.jpg[/img]\n\nIconic indie legend Morrissey presents his ninth solo studio album, Years of Refusal. Bursting at the seams with venomous, punk-fuelled tirades, this expansive, gutsy and nostalgia-inducing record demonstrates the sublime lyrical dexterity of The Smiths' former frontman in formidable fashion.\n\nVery little has changed from the setup that brought together Morrissey's highly acclaimed comeback albums, You Are The Quarry and Ringleader Of The Tormentors. His backing band is still The Tormentors and the muscular rock approach remains intact. However, with Years Of Refusal something that had previously gone unnoticed seems to click into place. Generating a spectacular spark, the musical quality exceeds much of the previous material and is harder, packing more of a punch than before. Whether it be that the band are more comfortable with one another after extensive touring, or simply that the potency of their leader's increasingly gritty, angst-drenched lyrics have fuelled this fiercer sound, it is safe to say that this is Morrissey's most entertaining and savage record since 1994's celebrated Vauxhall and I. From the stormy opener 'Something Is Squeezing My Skull', it is clear that Moz has returned, and is in the finest of form. With full throttle bitterness and spite, the song opens the album with a driving force that leaves you champing at the bit for the remaining tracks. What follows is everything you would expect and desire from 'The Pope of Mope'. Whilst 'I'm Throwing My Arms Around Paris' tremors with pensiveness, 'One Day Goodbye Will Be Farewell' tackles the notion of death, before the heart-rendering 'I'm OK By Myself' closes the record in a true Smiths-esque, lovelorn style. Ferocious in delivery, the tracks strike with unquestionable vigour. Breaking cautiously from subjects of anger to desperation with impeccable timing, Morrissey showcases a renewed strength both in his vocals and himself.\n\nProduced by You Are The Quarry contributor Jerry Finn, Years Of Refusal benefits from being recorded live in the studio, and has a pure and organic energy that is both urgent and increasingly intimate. Offering unexpected touches that engage and satisfy in equal measure, this score-settling album demonstrates the remarkable talent of Morrissey with enough vitality and fire to become an instant classic.\n\n   1. Something Is Squeezing My Skull\n   2. Mama Lay Softly On The Riverbed\n   3. Black Cloud\n   4. I'm Throwing My Arms Around Paris\n   5. All You Need Is Me\n   6. When I Last Spoke To Carol\n   7. That's How People Grow Up\n   8. One Day Goodbye Will Be Farewell\n   9. It's Not Your Birthday Anymore\n  10. You Were Good In Your Time\n  11. Sorry Doesn't Help\n  12. I'm OK By Myself\n\n[IMG]http://i78.photobucket.com/albums/j81/wrcfoucs/watching3vemq8.gif[/IMG]\n\n[IMG]http://i78.photobucket.com/albums/j81/wrcfoucs/dontseed.gif[/IMG]\n\n[img]http://i121.photobucket.com/albums/o219/uuffoo/vghlr7.png[/img]\n\n[img]http://i447.photobucket.com/albums/qq195/mariokazg/20qdrhe.gif[/img]","torrent":{"xt":"urn:btih:bbea34ce5e267082129d36d287725d4d3070f09a","amp;dn":"Morrissey+-+Years+Of+Refusal%28split+tracks+%2B+covers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbea34ce5e267082129d36d287725d4d3070f09a","infoHashBuffer":{"type":"Buffer","data":[187,234,52,206,94,38,112,130,18,157,54,210,135,114,93,77,48,112,240,154]},"announce":[],"urlList":[]}}