{"title":"Beyond Green: Toward a Sustainable Art","uid":3584784,"size":6247310,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd3b8973a6ae8bdc75d76c289d7b98ddd4f4c42e&amp;dn=Beyond+Green%3A+Toward+a+Sustainable+Art&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"arttorrents","files":1,"time":1167219601,"description":"Beyond Green: Toward a Sustainable Art\n\nStephanie Smith and Victor Margolin, with a Foreword by Anthony Hirschel and Judith Olch Richards, and artist interviews by Stephanie Smith Â©2005.\n\nBalancing environmental, ethical, economic, and aesthetic concerns, sustainable design has the potential to transform everyday life and has already dramatically reshaped the practice of architecture. Beyond Green introduces a new generation of international artists who work at the intersection of sustainable design and contemporary art.\n\nThe book explores the ways that this design strategy is being used ? and sometimes intentionally misused ? by an emerging group of artists who combine fresh aesthetic sensibilities with constructively critical approaches to the production, dissemination, and display of their art. Lavishly illustrated, the book also includes texts by and interviews with individual artists, along with substantial essays by exhibition curator Stephanie Smith and design historian Victor Margolin. What results is a bracing volume that will be of interest to practitioners and aficionados of design and art alike, as well as to environmentalists.\n\nThis exhibition and accompanying catalogue are made possible in part by the Smart Family Foundation; the Horace W. Goldsmith Foundation; the Richard H. Driehaus Foundation; and iCI Exhibition Partners Kenneth S. Kuchin and F. Bruce Anderson, and Gerrit and Sydie Lansing. Additional support is provided by the Arts Planning Council, the Environmental Studies Program, and the Green Campus Initiative, University of Chicago. Related programs in Chicago are made possible with additional support from the Chicago Architecture Foundation.","torrent":{"xt":"urn:btih:bd3b8973a6ae8bdc75d76c289d7b98ddd4f4c42e","amp;dn":"Beyond+Green%3A+Toward+a+Sustainable+Art","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd3b8973a6ae8bdc75d76c289d7b98ddd4f4c42e","infoHashBuffer":{"type":"Buffer","data":[189,59,137,115,166,174,139,220,117,215,108,40,157,123,152,221,212,244,196,46]},"announce":[],"urlList":[]}}