{"title":"Tom Jones - 24 Hours 2008 TQMP FLAC","uid":4983311,"size":386048611,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bd478dadb22c373faa79efe536379bd303963b91&amp;dn=Tom+Jones+-+24+Hours+2008+TQMP+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Breezin","files":21,"time":1246472763,"description":"Quotes from amazon.com:\n\n&quot;Tom has a voice and talent that is just second to none. He exudes energy, personality, emotion, and his love of music with every note he sings. This CD has a wide variety of music, and Tom nails every bit of it. He hits you between the eyes with the opener &quot;I'm Alive&quot;. You want to dance to the great tune of &quot;Give a Little Love&quot;. &quot;In Style and Rhythm&quot; is so catchy and makes you feel good. You can just picture the story of &quot;The Hitter&quot; as you listen, because Tom doesn't just sing the notes, he reaches your soul and takes you through the experience. &quot;Seasons&quot; and &quot;24 Hours&quot; make you feel reflective about your own life. Tom has got to be the most versitile singer on the face of this earth. This CD will blow you away. And here's a message to Simon Cowell...this is the real American Idol. All your winners through the years don't hold a candle to this man who is approx. 3 times their ages. No comparison!&quot;\n\n&quot;He's still got it! I purchased this CD of Tom Jones' new hits after seeing his show in Vegas! It is fantastic! He's still got it! Great music, great rhythm, great performance! Loved it!&quot; \n\n&quot;Go to bed with Tom Jones at your side every night! Tom Jones is a wonderful singer who never loses his style and always remains up to date. I personally love this CD because I listen to it every night before I fall alseep...just my idea of sleeping with Tom Jones.&quot;\n\n&quot;I admit up front that I am a big fan of Sir Tom's... if he sings a song, I will give it a listen. With that in mind, I did my very best to listen to &quot;24 Hours&quot; and rate it on its own merits. If you are a fan of Tom Jones, you should love this album. He doesn't &quot;reinvent the wheel&quot; here, he just does what he does best: belt out soulful, fun, awesome tunes. If you are NOT a fan of Tom Jones, you should still enjoy this album. If the stylings of Amy Winehouse or Duffy have done anything for you, pick up &quot;24 Hours&quot;, because you will find a lot of that same brassy, ballsy UK soul. What is truly remarkable to me is Jones' voice. While other &quot;comeback&quot; crooners like Tony Bennett, Johnny Cash, and most recently Neil Diamond (&quot;Home Before Dark&quot; is an excellent album, by the way) have lost a little of their voices' depth, Tom Jones sounds as strong as he ever has. This is a great album from a great talent. Tom Jones fans rejoice... A-Tomic is back!&quot;\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project! Since all TQMP torrents are tracked by countless other trackers by now, the lifetime of your uploads will increase by a BIG margin ;)\n\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless FLAC format AND include artwork.\n\nYou can find all TQMP uploads at: www.thepiratebay.se/tag/tqmp\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5a38283f3f2033341a36332c3f743436&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:bd478dadb22c373faa79efe536379bd303963b91","amp;dn":"Tom+Jones+-+24+Hours+2008+TQMP+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd478dadb22c373faa79efe536379bd303963b91","infoHashBuffer":{"type":"Buffer","data":[189,71,141,173,178,44,55,63,170,121,239,229,54,55,155,211,3,150,59,145]},"announce":[],"urlList":[]}}