{"title":"Bashar - Past Future History","uid":7685643,"size":50885830,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:bdc75e3f27c601fe8a91b77438e936363eb2b0b4&amp;dn=Bashar+-+Past+Future+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"awakeperson","files":2,"time":1348938682,"description":"&quot;PAST &amp; FUTURE HISTORY&quot;\n\nNew York, NY 9-19-09\n\nAt this exciting New York adventure, Bashar discusses time as an artificial construct of consciousness; all realities (past, present and future) exist now; memory constitutes connection to currently existing realities; &quot;predictions&quot; are sensings of the energy of consciousness that exists in the present and that can change as events &quot;predicted&quot; near. Bashar then describes some of the previous civilizations that have inhabited Earth and gives the generally held consensus agreement as to what is in store for humanity in the next 40 years.\n\nQ&amp;A: how to free oneself of the fear of being attacked. What practices does Bashar suggest to initiate or increase consciousness communication with God or higher self? Are other civilizations part of the higher self? What will be the first extraterrestrial civilization that will contact Earth first? Bashar discusses permission slips. How to find your spiritual purpose. How to positively channel a powerful energy that is experienced as sexual in nature. Clarification of what it is like for a spirit after leaving the physical body. Discussion of the phenomenon of memory, including shared memories and the effect of memory on addiction. How can we use our understanding of time to require less sleep per day? Questioner wants to know how he can improve his eyesight. Discussion of staying balanced between positive and negative as vibratory frequency rises. Are there other civilizations which are not &quot;friendly?&quot; Discussion of detoxification for health problems. Questioner invites Bashar to fly over his back yard. Was the position of the moon in orbit around Earth been adjusted sometime during the history of the planet? Discussion of the &quot;past lives&quot; relationship between Bashar and Darryl.\n &lt;a href=&quot;\nhttp://bashar.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bashar.org&lt;/a&gt;\n\n\n_________________________________________________________________________________\n\nKnowledge is free!\nShare it, seed it, grow it!\n\nMake earth a better place! :)\n","torrent":{"xt":"urn:btih:bdc75e3f27c601fe8a91b77438e936363eb2b0b4","amp;dn":"Bashar+-+Past+Future+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdc75e3f27c601fe8a91b77438e936363eb2b0b4","infoHashBuffer":{"type":"Buffer","data":[189,199,94,63,39,198,1,254,138,145,183,116,56,233,54,54,62,178,176,180]},"announce":[],"urlList":[]}}