{"title":"Casablanca (1942) enhanced DivX version Humphrey Bogart","uid":5163528,"size":788173197,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bde787cb4f5a9eb88926ebd7952dd928a636573a&amp;dn=Casablanca+%281942%29+enhanced+DivX+version+Humphrey+Bogart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrizzo2","files":-1,"time":1258291352,"description":"Excellent picture and sound quality. \nEmbedded and external subtitles, including English, French and Spanish\nThe latter two are the embedded ones addtionally, for your compatible DivX\nplayer.\n\nPlease check the net for any compatible subtitles if you should need them.\nYou can also download an excellent program from Denmark, on the Internet\n(its either free or donation supported I would think - its worth paying\nsomething for)called &quot;Subtitle editor&quot;. You can use it to make any improvements\nto exisiting subtitles on the net, or to create your own for your community.\n\nThis is a re-launch of this torrent with an added jpg image. If you've\npreviously downloaded this movie from us, kindly join this multi-tracker\ntorrent instead, to help us seed to all fans of the great Mr. Humphrey Bogart\nand the lovely Ms. Ingrid Bergman. With thanks!\n\nCasablanca is one of the greatest movies ever made. it is a tale of chivalry.\nthe ability of a man to sacrifice what might have been his own happiness\npotentially, for the happiness of the woman he loves, together with the man she\nprefers to be with in actuality. A lovely movie that should be in every\nlibrary, The lovely song &quot;as time goes by&quot; has become a classic favorite from\nthis great period of movie making history.\n\nThe industry has long overpriced movies such as this (including The Sound of\nMusic especially), and other than getting a break at Columbia House on these\ntitles now and then, theres no way to see a reasonable way to share this movie\nthan through this extra quality conversion for this torrent launch.\n\nAfter 70 years, I think this title belongs in the Public domain, however\nId pay five bucks gladly for a real DVD on the shelf! (I bet you would too).\nIn the meantime, this is as good as it gets!\n\n\nMichael Rizzo Chessman\nMovie reviews: moviesbyrizzo.info","torrent":{"xt":"urn:btih:bde787cb4f5a9eb88926ebd7952dd928a636573a","amp;dn":"Casablanca+%281942%29+enhanced+DivX+version+Humphrey+Bogart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bde787cb4f5a9eb88926ebd7952dd928a636573a","infoHashBuffer":{"type":"Buffer","data":[189,231,135,203,79,90,158,184,137,38,235,215,149,45,217,40,166,54,87,58]},"announce":[],"urlList":[]}}