{"title":"Terrors of the Table - The Curious History of Nutrition (gnv64)","uid":12631305,"size":20580251,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be02f01fbd77d937055fc322555a70fd5c3c982a&amp;dn=Terrors+of+the+Table+-+The+Curious+History+of+Nutrition+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":4,"time":1445848338,"description":"Terrors of the Table - The Curious History of Nutrition\r\nby Walter Gratzer\r\nOxford University Press | November 2005 | ISBN-10: 0192806610 | 288 Pages | PDF | 19.6 mb\r\n\r\nWalter Gratzer here offers a marvelous smorgasbord of stories taken from the history of nutrition, providing an engaging account of the struggle to find the ingredients of a healthy diet, and the fads and quackery that have waylaid the unwary.\r\nGratzer recounts this history with characteristic crispness and verve. The book teems with colorful personalities, a veritable who's who of medical history, from Hippocrates to Pasteur, plus such intriguing figures such as Count Rumford, who argued that since plants got their food from water, soups would make the best meals for us. Gratzer highlights the brilliant flashes of insight as well as the sadly mistaken leaps of logic in the centuries-long effort to understand how the body uses food. We see the ingenious experiments used to reveal the workings of the stomach, the chemical analyses that uncovered the nature of proteins, carbohydrates, and vitamins, and the slow recognition that malnutrition lay behind such terrible diseases as scurvy, rickets, beriberi, and pellagra. Along the way, we read about the invention of the tin can (which originally had to be opened with a hammer and chisel), learn why ancient Egyptians had thicker skulls than Persians, and find out about today's fads and fancy diets--some dangerous, others just daft, such as the blood group diet, where you plan your meals around your blood type (people who are type 0 are supposed to eat more meat).\r\nSpiced with colorful anecdotes from the history of medicine and with sharp portraits of the scientists who advanced our understanding of diet and digestion, Terrors of the Table is a must read for anyone interested in food and health.\r\n\r\nAbout the Author\r\nWalter B. Gratzer is a British biophysical chemist. He is professor emeritus of biophysical chemistry at King's College London and an author and reviewer of popular science. He was the first Nature news correspondent appointed by editor John Maddox. Oliver Sacks of Nature writes that his reviews have high literary quality and show knowledge of a wide range of topics. He is a friend of James D. Watson, and wrote the introduction and afterword of his A Passion for DNA.\r\nGratzer received his BA in chemistry in 1954 and his MA in 1958 from the University of Oxford, and his PhD in 1960 from the National Institute for Medical Research. He was a research fellow at Harvard University from 1960 to 1963, a lecturer in biophysics at King's from 1963 to 1966, and worked at the Medical Research Council from 1966 to 1996. He has been emeritus professor since 1997.\r\n\r\nCONTENTS\r\nPicture acknowledgements vi\r\nIntroduction vii\r\n1 The Ravages of War i\r\n2 The Scurvy Wars 16\r\n3 In the Beginning 36\r\n4 Dawn of the Scientific Age: the Road to the Scaffold 48\r\n5 The Savants' Disputes 69\r\n6 The Poor, the Rich, the Healthy, and the Sick 100\r\n7 Cheats and Poisoners 118\r\n8 Paradigm Postponed: the Tardy Arrival of Vitamins 135\r\n9 The Quarry Run to Earth 162\r\n10 Fads and Quacks 188\r\n11 The New Millennium: Profits and the Higher Quackery 211\r\nAppendix The Hard Science 248\r\nFurther Reading and References 260\r\nIndex 270\r\n \nhttp://s18.postimg.org/upc5r3rgp/Terrors_of_the_Table_The_Curious_History_of_Nu.jpg","torrent":{"xt":"urn:btih:be02f01fbd77d937055fc322555a70fd5c3c982a","amp;dn":"Terrors+of+the+Table+-+The+Curious+History+of+Nutrition+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be02f01fbd77d937055fc322555a70fd5c3c982a","infoHashBuffer":{"type":"Buffer","data":[190,2,240,31,189,119,217,55,5,95,195,34,85,90,112,253,92,60,152,42]},"announce":[],"urlList":[]}}