{"title":"Great Pianists - 014. Alfred Brendel III (1968) [2 CD] [Flac]","uid":12689935,"size":755774125,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:be1898a75f8fab83e91c34ec82b789d6a27d5430&amp;dn=Great+Pianists+-+014.+Alfred+Brendel+III+%281968%29+%5B2+CD%5D+%5BFlac%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"greenjey","files":24,"time":1446658692,"description":".:Great Pianists:.\r\n.:014. Alfred Brendel III:.\r\n\r\n\r\n.: Dati Album :.\r\n\r\n\r\nEtichetta: Philips Classics\r\nData pubblicazione: 1968\r\nFormato: Flac + Cue + Log + m3u + Pdf scans + nfo\r\nDurata:\r\n- CD 1: 01:16:50 06 Brani\r\n- CD 2: 01:13:44 09 Brani\r\nDimensione: 720 Mb\r\nGenere: Classica, Pianoforte\r\nLingua: ---\r\n\r\nAlfred Brendel (Wiesenberg, 5 gennaio 1931) è un pianista e poeta austriaco.\r\nContinua su Wikipedia\r\n\r\nAlfred Brendel KBE (born 5 January 1931) is an Austrian pianist, poet and author. He is widely considered to be one of the greatest pianists of all time.\r\n\r\n.: Tracce :.\r\n\r\n\r\n\r\nCD1\r\n1. Alfred Brendel III - Felix Mendelssohn Barholdy / Variations serieuses, Op. 54[10:40]\r\n2. Alfred Brendel III - Carl Maria Von Weber / Konzertstuck in F minor, Op. 79 - Larghetto affettuoso[09:50]\r\n3. Alfred Brendel III - Carl Maria Von Weber / Konzertstuck in F minor, Op. 79 - Adagio[07:34]\r\n4. Alfred Brendel III - Johannes Brahms / Piano Concerto No. 1 in D minor, Op. 15 - 1 Maestoso - Poco piu moderato[22:44]\r\n5. Alfred Brendel III - Johannes Brahms / Piano Concerto No. 1 in D minor, Op. 15 - 2 Adagio[13:47]\r\n6. Alfred Brendel III - Johannes Brahms / Piano Concerto No. 1 in D minor, Op. 15 - 3 Allegro non troppo[12:15]\r\n\r\nCD2\r\n\r\n1. Alfred Brendel III - Frederic Chopin / Polonaise in F sharp minor, Op. 44[11:32]\r\n2. Alfred Brendel III - Franz Liszt / Vallee d'Obermann (No. 6 from Annees de pelerinage: Permiere annee: Suisse) (live)[12:57]\r\n3. Alfred Brendel III - Franz Liszt / Orage (No. 5 from Annees de pelerinage: Permiere annee: Suisse)[04:24]\r\n4. Alfred Brendel III - Franz Liszt / Totentanz [15:37]\r\n5. Alfred Brendel III - Franz Liszt / Sposalizio (No. 1 from Annees de pelerinage: Deuxieme annee: Italie) (live)[06:53]\r\n6. Alfred Brendel III - Franz Liszt / Bagatelle sans tonalite (live)[02:40]\r\n7. Alfred Brendel III - Franz Liszt / Hungarian Rhapsody No. 15 in A minor (Rakoczy March)[05:43]\r\n8. Alfred Brendel III - Franz Liszt / La lugubre gondola No. 1[04:24]\r\n9. Alfred Brendel III - Ferruccio Busoni / Toccata (Preludio - Fantasia - Ciaccona) (live)[09:34]\r\n\r\n\r\nGreat Pianists of the 20th Century was a 200-CD box set released by Philips Records in 1999 and sponsored by Steinway &amp; Sons.\r\n\r\nThe box set comprised 100 volumes featuring 72 pianists of the 20th century, each volume with two CDs and a booklet about the life and work of the featured pianist. The set contains a variety of composers from different eras, from Baroque to Contemporary classical. The material was the result of a collaborative association between Philips (who had access to the Polygram Records back catalogue) and a number of other labels, notably EMI Classics, as no single label possessed a representative set of recordings for every pianist considered to be significant. Material from Warner Classics and Sony Classics was also used.\r\n\r\nThe majority of the pianists feature on one set only, with sixteen appearing on a second set. Seven artists (Arrau, Brendel, Gilels, Horowitz, Kempff, Richter and Rubinstein) are featured across three sets.\r\n\r\nPerceptive pianophiles have pointed out various errors in the set, including misattributed recordings and use of unauthorized takes. For example, the Paderewski volume contains a performance of Liszt’s &quot;La Leggierezza&quot; which was actually recorded by Benno Moiseiwitsch – also included in the latter’s volume. Further, the liner notes claim the cadenza of the piece was by Moiseiwitsch, while it was actually by Theodor Leschetizky. The first of two Cortot volumes was withdrawn when it was discovered that a previously rejected performance of Schumann’s Kreisleriana was issued by mistake. The volume was reissued with the correct take. The series has also been criticized for the lack of remastering of historic recordings, notably in the Hofmann reissue which degraded the transfers originally issued by Ward Marston.\r\n\r\nThe German edition of the set (and possibly others) includes a bonus CD with Clara Haskil (Sonderausgabe zur Edition) —raising to 5 the total number of CDs with her. This bonus CD contains her interpretation of some of Scarlatti's piano sonatas from her 1947 Westminster LP, and is the first printing on CD of these recordings, according to the CD cover (Erstveröffentlichung auf CD).\r\n\r\nITA\r\n\r\nGreat Pianists of the 20th Century (Grandi pianisti del 20º secolo) è un cofanetto di 200 CD pubblicato dalla Philips Records nel 1999 e sponsorizzato da Steinway &amp; Sons.\r\n\r\nIl cofanetto comprende 100 volumi che includono 72 pianisti del 20º secolo, ogni volume è composto da due CD ed un libretto relativo alla vita ed opera del pianista. Il cofanetto contiene una varietà d'autori di diverse epoche, dal barocco ai classici contemporanei. Il materiale è il risultato di un'unione collaborativa tra Philips (che ha avuto accesso all'archivio della Polygram Records) ed una serie di altre etichette, in particolare EMI Classics, dal momento che nessuna di esse possedeva, singolarmente, un insieme esaustivo di registrazioni per ciascun pianista. È stato utilizzato anche materiale della Warner Classics e Sony Classics.\r\n\r\nLa maggior parte dei pianisti è trattata in un solo volume, sedici ne impiegano anche un secondo. Sette artisti (Arrau, Brendel, Gilels, Horowitz, Kempff, Richter e Rubinstein) comprendono tre volumi.\r\n\r\nAttenti &quot;pianofortofili&quot; hanno evidenziato vari errori nel cofanetto, tra cui la presenza di registrazioni accreditate erroneamente e l'utilizzo di materiale non autorizzato. Ad esempio, il volume Paderewski contiene un'esecuzione de (&quot;La Leggierezza&quot;) di Liszt che in realtà fu registrata da Benno Moiseiwitsch - malgrado questa sia già inclusa nel volume del suddetto. Inoltre, le note di copertina sostengono che la cadenza del pezzo sia opera di Moiseiwitsch, mentre è in realtà di Theodor Leschetizky. Il primo dei due volumi di Cortot fu ritirato quando si scoprì che era stata rilasciata per errore un'esecuzione musicale della Kreisleriana di Schumann precedentemente respinta. Il volume è stato ristampato con la registrazione corretta. La serie è anche stata criticata per la carenza delle rimasterizzazioni di registrazioni storiche, in particolare nella ristampa di Hofmann, nella quale risultano degradate le acquisizioni originariamente rilasciate da Ward Marston.\r\n\r\nL'edizione tedesca del cofanetto include un CD bonus con Clara Haskil (Sonderausgabe zur Edition) - aumentando a 5 il numero totale dei CD in cui la pianista è presente. Questo CD bonus contiene la sua interpretazione di alcune sonate per pianoforte di Scarlatti prese dall' LP del 1947 (etichetta Westminster) e, secondo la copertina del CD (Erstveröffentlichung auf CD), si tratta della prima stampa su CD di queste registrazioni.\r\n\r\n.: Dati Tecnici :.\r\n\r\nGeneral\r\nComplete name : C:UsersDesktopTnTDownloadGreat Pianists of the 20th CenturyGreat Pianists 014. Alfred Brendel IIICD11. Alfred Brendel III - Felix Mendelssohn Barholdy , Variations serieuses, Op. 54.flac\r\nFormat : FLAC\r\nFormat/Info : Free Lossless Audio Codec\r\nFile size : 36.2 MiB\r\nDuration : 10mn 40s\r\nOverall bit rate mode : Variable\r\nOverall bit rate : 474 Kbps\r\nAlbum : Great Pianists of the 20th Century, Vol.14 CD1\r\nTrack name : Felix Mendelssohn Barholdy / Variations serieuses, Op. 54\r\nTrack name/Position : 01\r\nPerformer : Alfred Brendel III\r\nGenre : Classical\r\nRecorded date : 1999\r\nComment : EAC FLAC -8\r\n\r\nAudio\r\nFormat : FLAC\r\nFormat/Info : Free Lossless Audio Codec\r\nDuration : 10mn 40s\r\nBit rate mode : Variable\r\nBit rate : 474 Kbps\r\nChannel(s) : 2 channels\r\nSampling rate : 44.1 KHz\r\nBit depth : 16 bits\r\nStream size : 36.2 MiB (100%)\r\nWriting library : libFLAC 1.2.1 (UTC 2007-09-17)","torrent":{"xt":"urn:btih:be1898a75f8fab83e91c34ec82b789d6a27d5430","amp;dn":"Great+Pianists+-+014.+Alfred+Brendel+III+%281968%29+%5B2+CD%5D+%5BFlac%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be1898a75f8fab83e91c34ec82b789d6a27d5430","infoHashBuffer":{"type":"Buffer","data":[190,24,152,167,95,143,171,131,233,28,52,236,130,183,137,214,162,125,84,48]},"announce":[],"urlList":[]}}