{"title":"Obama's time a history [MyeBookShelf]","uid":11316491,"size":3877272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be366b37790cb0203ded2af136187a5a9f0b84d2&amp;dn=Obama%27s+time+a+history+%5BMyeBookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MyeBookShelf","files":-1,"time":1414555552,"description":"Obama's time a history [MyeBookShelf]\nMorton Keller | 2014 | True PDF | ISBN: 0199383375 | 352 pages | 3 Mb\n\nBarack Obama swept into office in 2008, capitalizing on his fresh and compelling political persona, the appeal of his &quot;Hope and Change&quot; campaign, the pre-election financial crisis, and a wave of popular discontent with his predecessor. The nation's first African-American president stirred unusually high expectations, and his first term saw the passage of a substantial economic stimulus package, a large-scale expansion of financial regulation, a drawdown in Iraq, and his signature health care reform. But a stagnant economy persisted. His personal popularity had no effect on the persistent disapproval of his program. The Democrats suffered a severe electoral setback in the 2010 Congressional election. But Obama's exceptional campaign organization, his strong personal appeal, and a weak Republican opponent won him a second term in 2012.\n\nNow his presidency is in its final stage. In Obama's Time, eminent historian Morton Keller has written the first historical assessment of Barack Obama's presidency. Drawing on a lifetime of scholarship on American history and politics, Keller examines Obama's presidential persona and governing style, his domestic and foreign policies, and his place in the broader history of American politics. Obama is deeply committed to active federal government, in the tradition of FDR's New Deal and LBJ's Great Society. But his ambitions have been tempered by the heavy weight of existing institutions and past precedents, strong Republican opposition, and unforeseen events. Keller concludes that this is a time when the centralized bureaucratic state faces a deep crisis of legitimacy. He ascribes the intense party polarization to a political culture in which the media, advocacy groups, and ideologically-driven donors have outsize influence","torrent":{"xt":"urn:btih:be366b37790cb0203ded2af136187a5a9f0b84d2","amp;dn":"Obama%27s+time+a+history+%5BMyeBookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be366b37790cb0203ded2af136187a5a9f0b84d2","infoHashBuffer":{"type":"Buffer","data":[190,54,107,55,121,12,176,32,61,237,42,241,54,24,122,90,159,11,132,210]},"announce":[],"urlList":[]}}