{"title":"American Pie 5 The Naked Mile [2006] ENG GER SPA ITA Multisubs","uid":9923602,"size":7072155648,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:be3a5df6e09992b53f37133838bb5d686fdaae40&amp;dn=American+Pie+5+The+Naked+Mile+%5B2006%5D+ENG+GER+SPA+ITA+Multisubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":null,"files":-1,"time":1397031300,"description":"audio: english,german,spanish,italian\n\n\nsubs: english,german,spanish,italian,croatian,portuguese\n\n\n\nDVD9 PAL\n\n\n\n\nAmerican Pie Presents: The Naked Mile is a 2006 American teen comedy film released by Universal Pictures. The film is the second spin-off to the American Pie film series and begins a story arc that continues and concludes with American Pie Presents: Beta House (2007).[1][2] John White stars as Erik Stifler, a high school senior who is given a &quot;guilt free pass&quot; by his girlfriend, Tracy Sterling (Jessy Schram), and so visits the Beta House fraternity led by his cousin, Dwight Stifler (Steve Talley), to run a mile naked. Christopher McDonald co-stars as Erik's father, Harry, and Eugene Levy once again plays Jim's Dad, who turns out to be a family friend of both Erik's and Tracy's. Also, it is in this film that his name is revealed to be &quot;Noah Levenstein&quot;.\n\n\nErik Stifler (John White) has a difficult time living up to his family name. He is Steve and Matt Stifler's cousin. He is perhaps the only Stifler about to graduate from high school as a virgin. The film opens with Erik feigning illness so that he can stay home and masturbate. Unfortunately, just as he is about to ejaculate, his parents and grandmother unexpectedly walk into the door and are hit with Erik's semen, after which his grandmother dies of a heart attack. Erik's dad later surmises that, as a Stifler, his son should be out having sex instead of masturbating. Erik's girlfriend of two years, Tracy (Jessy Schram), loves him, but is not ready for intercourse. Tracy decides to have sex, their first attempt goes horribly wrong, and she backs out of trying again.\n\nErik's friends Cooze (Jake Siegel) and Ryan (Ross Thomas) plan a road trip to visit Erik's cousin Dwight Stifler (Steve Talley) in Michigan during an event known as the Naked Mile. Tracy sees this as an opportunity to give Erik a &quot;guilt free weekend pass,&quot; hoping that he can quench his lust and get sex out of his system since she is not ready.","torrent":{"xt":"urn:btih:be3a5df6e09992b53f37133838bb5d686fdaae40","amp;dn":"American+Pie+5+The+Naked+Mile+%5B2006%5D+ENG+GER+SPA+ITA+Multisubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be3a5df6e09992b53f37133838bb5d686fdaae40","infoHashBuffer":{"type":"Buffer","data":[190,58,93,246,224,153,146,181,63,55,19,56,56,187,93,104,111,218,174,64]},"announce":[],"urlList":[]}}