{"title":"[iFap]Artificial Girl 3 v1.50 [all-in-one][eng][XP,Vista,Win7][H","uid":4922125,"size":6898477554,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:bf920aff2422ef4027a1260e9b32eceaaf0463ed&amp;dn=%5BiFap%5DArtificial+Girl+3+v1.50+%5Ball-in-one%5D%5Beng%5D%5BXP%2CVista%2CWin7%5D%5BH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DirtyFinger","files":-1,"time":1243707918,"description":"BIG screenshot: http://bayimg.com/eAAcaAaCF\n\n\n\n----------------\n1. Introduction\n----------------\nThis is the famed anime Girl Simulator from Illusion. \n\nThe most notable feature (in my opinion) is the community around that fap game, that wasted no time with providing us with our most popular anime characters, so we can (virtually) bugger ourselves through the whole cast of Evangelion, Tenchi Muyo, Naruto, Bleach, Streetfighter and whatever else there is. \n\nThe preview pictures should speak for themselves. \n\nSome of the greatest hurdles to enjoy that game was the japanese language and the numerous amounts of mods, extensions, patches and whatever other supplementary files you need to get it running. Censorship didn't help much either. \n\nBut REJOICE ! \n\nThis release is UNCENSORED, has an english launcher, high definition textures and even subtitles for some of the voice acting. \n\nYou can thank the folks over at hongfire.com for that. \n\n\n\n---------------------------\nInstallation &amp; Modification \n---------------------------\n\n  ---------------------------------\n  Installation &amp; Launching the game\n  ---------------------------------\n\n  1. Unpack archive files to a directory of your choice. \n  2. Start the game with &quot;AG3_Play.exe&quot;. \n\nYes, thats all.\n\nI tested this on Windows XP and Windows Vista. Looks like it doesn't need any registry information. But if it does, then try the Registry Fixer located in the AG3 directory. \n\n  ----------------\n  Adding new girls\n  ----------------\n\nYou can create new girls or import them from somewhere else. \nThe Girl editor is called AG3_Make.exe and is pretty intuitive. See the wiki for more details.\n\nShould you aquire new girls for AG3 from somewhere else then you need to know how to install them.\nDon't use the Illusion Wizard for that job! Use that only for new mods!\n\nA new girl usually consists of a character and associated costumes. If not using the standard clothes, the new costume models have to be provided or else she'll rund around naked all the time.\n\nInside your game folder is the repository for all girls. It's divided in three groups: \n\nCharacter files: \n  .../AG3/data/save/m_cha\n\nCostume files:\n  .../AG3/data/save/m_cos\n\nTextures:\n  .../AG3/data/save/m_tex\n\nThe content of the aquired new archive with the girl inside should have a similar structure. Sadly every modder has his own idea on which directory structure to put inside those archives, so it's up to you to copy them into the correct folder.\n\nNote that the new girls very often are assigned to a world already, even though you don't have that world. That means their names show up in red, like all occupied girls and not in black, like they should.\nYou have to find her name, unload her, then load her again into the world you want her to be in.\n\nAnd sometimes the girls REALLY don't show up.\nIn that case start the AG3_Maker, click create character and manually load the character file to create her. Assign her a costume if she doesn't have one and you're done. The costume should be inside that archive you aquired. If not, either recycle another costume or be creative.\n\n\n  ----------------\n  Errors and Fixes\n  ----------------\n\n[*] &quot;This application failed to start because d3dx9_24.dll was not found. Re-installing this application may fix this problem.&quot;\n   Solution: Downloads the missing dll from somewhere and put it here:\nC:windowssystem32 (Windows XP. Vista and Win7 may differ.) \n   Dlls available here: http://www.dll-files.com/dllindex/dll-files.shtml?d3dx9_24\n\n\n---------\nGameplay \n---------\n\n[*] A decent guide can be found here: http://scratchpad.wikia.com/wiki/Artificial_Girl_3 \n\n[*] Controls:  \n    The numer keys 1,2,3,4 are used to hide/reveal your character, the environment, your dick and to dress/undress yourself. Apart from the undressing bit, these changes are purely visual to allow you an unobstructed view at the action scenes. \n    &quot;WASD&quot; to move. Left Mouse Button  is for interacting with the environment, right button is for hugging girls. Keep the right button pressed while hugging to attempt to engage sex mode. \n[*] Sex mode \n    Left button controls camera. Also undresses girls when you click at the right spot. \n    Right button controls camera, too. Also changes sex positions by hovering over your dick (icon changes), press and hold the button while moving the mouse up all the way.  \n    Mouse Wheel changes speed and position of ongoing sex. \n    Please check the guid for full explanations. \n[*] The girls don't want to... \n    Yeah, it's a game. You have to get them to like you by ... just check the wiki, ok ? \n[*] I WANT SEX NOW \n    Happily there's a trainer included. It's in the AG3 directory and named &quot;AG3Trainer.exe&quot; \n    Start it, start the game, enter a world. Switch to the trainer, click on the &quot;WOW&quot; button, switch back to the game. If the graphics screw up while doing that, disable fullscreen mode in the configuration. \n    Note that the &quot;WOW&quot; button makes the girls so desperately horny that they rape you on the spot. Convenient, but some sexual positions are only possible with you in the lead. \n\n    Enjoy. \n\n\n---------------\nTorrent Content\n---------------\n\nI don't claim any credit for that stuff. The real work was done by other people than me. I'm even too lazy to list all the included content correctly , but I'll try to list most it. \n\n[list]\n[*] Artificial Girl 3 v 1.50 + Official extras. The base for this release is this torrent: http://www.hongfire.com/forum/showthread.php?t=86353 \n    Get detailed info there. \n[*] Illusion Wizard v042 \n    This is a modding tool. Current version, I think. \n[*]. Girley3T mod \n    Unless I'm mistaken I installed better textures and a more buff guy model with that mod. \n[*] AG3Trainer for AG3 v1.5 \n    Should you ever choose to install an update then be sure to get the respective trainer first. \n[*] Artificial Girl3 Registry Fixer \n    Honestly, I didn't need it. \n[*] Girls \n    I created some worlds named after animes and other series and included the respective girls. Animes include: \n    One Piece, Totally Spies, Slut Girl (the famous manga), Evangelion, Bleach, King of Fighters, Guilty Gear, Tenchi Muyo, Claymore, Teen Titans, Street Fighter, Kaibatsu Oujo, History's strongest disciple Kenichi, Naruto. \n    Sadly not all worlds are complete. But it's a good start. \n\n\n-----\nLinks\n-----\n\n* http://www.hongfire.com/forum/showthread.php?t=76578 (Links, resources and gameplay discussion. Highly useful) \n* http://scratchpad.wikia.com/wiki/Artificial_Girl_3 (The Guide) \n* http://www.hongfire.com/forum/showthread.php?t=76672 (more girls)","torrent":{"xt":"urn:btih:bf920aff2422ef4027a1260e9b32eceaaf0463ed","amp;dn":"%5BiFap%5DArtificial+Girl+3+v1.50+%5Ball-in-one%5D%5Beng%5D%5BXP%2CVista%2CWin7%5D%5BH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf920aff2422ef4027a1260e9b32eceaaf0463ed","infoHashBuffer":{"type":"Buffer","data":[191,146,10,255,36,34,239,64,39,161,38,14,155,50,236,234,175,4,99,237]},"announce":[],"urlList":[]}}