{"title":"God and the Atom (2013) epub","uid":8959756,"size":2907151,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0ee00628357e7c8eadc92c1cc07db674a2b47ca&amp;dn=God+and+the+Atom+%282013%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1380073780,"description":"This history of atomism, from Democritus to the recent discovery of the Higgs boson, chronicles one of the most successful scientific hypotheses ever devised, making the case that in the final analysis, atoms and the void are all that exists. Originating separately in both ancient Greece and India, the concept of the atom persisted for centuries, despite often running afoul of conventional thinking. Until the twentieth century, no direct evidence for atoms existed. Today it is possible to actually observe atoms using a scanning tunneling microscope. The book begins with the story of the earliest atomists - the ancient Greek philosophers Leucippus, Democritus, and Epicurus, and the Latin poet Lucretius. As the author notes, the idea of elementary particles as the foundation of reality had many opponents throughout history - from Aristotle to Christian theologians and even some nineteenth-century chemists and philosophers. While theists today accept that the evidence for the atomic theory of matter is overwhelming, they reject the atheistic implications of that theory.\n\n2013","torrent":{"xt":"urn:btih:c0ee00628357e7c8eadc92c1cc07db674a2b47ca","amp;dn":"God+and+the+Atom+%282013%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0ee00628357e7c8eadc92c1cc07db674a2b47ca","infoHashBuffer":{"type":"Buffer","data":[192,238,0,98,131,87,231,200,234,220,146,193,204,7,219,103,74,43,71,202]},"announce":[],"urlList":[]}}