{"title":"Usagi Yojimbo v3 002-005 (1996) (2048px - c2c) (theProletariat-N","uid":10567185,"size":485954437,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c1a8a0779949a98d422d8853d7c5455cd7d3d1ed&amp;dn=Usagi+Yojimbo+v3+002-005+%281996%29+%282048px+-+c2c%29+%28theProletariat-N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1405537031,"description":"\nA Novus Release\n\n\n\n\nThis torrent includes the standard and 2048px (c2c) versions.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\n\n#2  An innocent Noodles has been captured by the corrupt police force, and there's nothing Usagi can do -- except expose his persecutors' deceptions. Policeman Yoriki Matsuda is a puppet of the local criminals, but once the puppet is eliminated, the puppet masters fall as well.\n\n#3  Those who travel the haunted paths of The Tangled Skein are warned to make an offering of protection to the demons that rule the woods. When a traveling party fails to make that sacrifice, they pay the price in another way -- the young woman traveling with them is overcome with great illness. Now it's up to Usagi to exorcise the demons the only way he knows how -- in battle.\n\n#4  The war between the Neko ninjas and the Komori ninja resumes. Chizu, the leader of the Neko ninjas is transporting a secret document, and when she meets up with Usagi, he is compelled to help her against the Komori.\n\n#5  An assassins' guild to one side and the Mogura ninja to the other, Usagi Yojimbo is between a rock and a hard place. High in the mountains above ancient Japan, he is forced into battle along the narrow Chrysanthemum Pass. And what is the secret of the medicine peddler?\n\n\n\n\n\n\nThanks goes to the RoyalRumor for this release.\n\n","torrent":{"xt":"urn:btih:c1a8a0779949a98d422d8853d7c5455cd7d3d1ed","amp;dn":"Usagi+Yojimbo+v3+002-005+%281996%29+%282048px+-+c2c%29+%28theProletariat-N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1a8a0779949a98d422d8853d7c5455cd7d3d1ed","infoHashBuffer":{"type":"Buffer","data":[193,168,160,119,153,73,169,141,66,45,136,83,215,197,69,92,215,211,209,237]},"announce":[],"urlList":[]}}