{"title":"Joseph Kwan - Joomla! VirtueMart 1.1 Theme and Template Design","uid":6492686,"size":10607689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1f83f4797363c1d384a299effee55a783b1f103&amp;dn=Joseph+Kwan+-+Joomla%21+VirtueMart+1.1+Theme+and+Template+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheBookie","files":-1,"time":1308942869,"description":"Joomla! VirtueMart 1.1 Theme and Template Design By Joseph Kwan\n\nPublisher: Packt Publishing 2011 | 384 Pages | ISBN: 1849514542 | PDF | 10 MB\n\n\nVirtueMart is the best shopping cart solution around for the Joomla! CMS. A VirtueMart template is a Joomla! template that is designed to create the overall look of a store. It puts in things such as a shopping cart bar, more shop-like graphics, more readable colors, and so on. A VirtueMart theme only impacts the area of the site actually controlled by the VirtueMart component. Themes work inside the overall framework. Applying custom templates and themes to give a unique look and feel to your VirtueMart web store will really attract customers! This book will guide you to build VirtueMart custom themes and templates.\nJoomla! VirtueMart 1.1 Theme and Template Design explains how the VirtueMart theme and template system works and points out ways to configure the default theme. It then goes on to look at each of the major templates with an emphasis on how to customize them. It then discusses individual page groups such as product list, product details, shopping cart, checkout, and invoice e-mails in the order they appear to your customer. After-sale services like invoice e-mail, account management, and order list are also discussed.\n\nThe book also discusses the different components of a VirtueMart theme and will teach you how to build a theme from scratch. You will also learn advanced features like child products, advanced attributes, custom attributes, and product types. Topics like integration with Joomla! plugins and AJAX functions are also included. An Appendix provides a comprehensive template reference of the use and available fields of every template.\n\nJoomla! VirtueMart 1.1 Theme and Template Design is a practical guide for all those who want to make VirtueMart work for them. It will put many advanced features of this popular open source e-Commerce application at your finger tips.\n\nAn indispensable guide to tailoring your web store look according to your need based on the most popular Joomla! e-Commerce component\n\nWhat you will learn from this book :\n\nUnderstand the basic framework of the Joomla! VirtueMart template system\nUnderstand the structure of a VirtueMart template\nCustomize VirtueMart using the general configuration and default theme configuration\nIdentify the file(s) that need to be modified to achieve your requirements\nCustomize and add features to the product list page, product detail page, shopping cart, checkout pages, invoice e-mails, and many more features\nBuild your own web store home page and customize the overall look of your store\nCreate custom language elements that can work in a multi-language web store\nExtend VirtueMart features through integration with existing Joomla! plugins\nExtend VirtueMart features through integration with existing javascript frameworks\nCustomize the Joomla! modules that come with VirtueMart\nBuild a VirtueMart theme that is backward compatible with new VirtueMart versions\nCustomize and add features to several VirtueMart advanced functionalities such as child products, advanced attributes, custom attributes, and product types\n\n\n","torrent":{"xt":"urn:btih:c1f83f4797363c1d384a299effee55a783b1f103","amp;dn":"Joseph+Kwan+-+Joomla%21+VirtueMart+1.1+Theme+and+Template+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1f83f4797363c1d384a299effee55a783b1f103","infoHashBuffer":{"type":"Buffer","data":[193,248,63,71,151,54,60,29,56,74,41,158,255,238,85,167,131,177,241,3]},"announce":[],"urlList":[]}}