{"title":"Drowned God","uid":6046225,"size":1783165591,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c20c426181617867a5f67a1004afad4c1e5394ca&amp;dn=Drowned+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Psychodad149","files":60,"time":1292562176,"description":"The Bible and Darwin were both wrong.\n\nThat is the premise of Drowned God, a point-and-click, hi-res graphic adventure that will rattle a few cages and get plenty of ink. &quot;It's obviously a contentious subject,&quot; says the game's producer, Algy Williams. &quot;If we piss off a few zealots, so much the better.&quot;\n\nThe game purports that many thousands of years ago an alien race from Orion not only genetically engineered humans but also guided their social and scientific development. Then along came the great flood, erasing much of that work and concealing the world's greatest artifacts: the Rod of Osiris (the Egyptian god of the dead), the Holy Grail, the Philosopher's Stone, and the Ark of the Covenant.\n\nYour challenge is to visit the four earthly and spiritual realms in which these items can be found, unlock a labyrinth of puzzles, and complete several tasks to gather them one by one. Sound like your basic treasure hunt? It's not - far from it.\n\n&quot;We are aiming for a totally immersive experience, a quest for knowledge,&quot; says Williams. &quot;Basically you are uncovering a huge government and church conspiracy that has seriously altered human history.&quot;\n\nClassic!  One of my all time favorites.","torrent":{"xt":"urn:btih:c20c426181617867a5f67a1004afad4c1e5394ca","amp;dn":"Drowned+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c20c426181617867a5f67a1004afad4c1e5394ca","infoHashBuffer":{"type":"Buffer","data":[194,12,66,97,129,97,120,103,165,246,122,16,4,175,173,76,30,83,148,202]},"announce":[],"urlList":[]}}