{"title":"PC - Evil Dead Regeneration [English]","uid":3424270,"size":2190755800,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c31165a7b945d48f3e40438ed06a78e162735ca6&amp;dn=PC+-+Evil+Dead+Regeneration+%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"changoboy","files":45,"time":1135546309,"description":"Enter an all-new Evil Dead experience, as Ash finds himself arrested, \nconvicted of murder, and sentenced to Sunny Meadows, an institute for the \ncriminally insane. Though better than the madness he escaped hidden within\nthe woods, he quickly learns the evil has only become more malevolent.\nDeep in the basement of an insane asylum, the mad Dr. Vingo Reinhard\ncombines technology with The Book of The Dead, AKA The Necronomicon to \nfulfill perverted experiments of his very own. Hell-bent on using science \nto harness the Necronomicons powers, the malevolent doctor unleashes the\nbooks all-powerful Evil on the world - creating a new breed of Deadites,\nmonsters and experiments gone wrong, twisting reality into a hellish\nstrudel and leaving mankind with that not-so-fresh apocalyptic feeling.\n\nFEATURES:\nEnter an all-new experience as Ash finds himself arrested, convicted of murder, and sentenced to Sunny Meadows, an institute for the criminally insane. \nThough better than the madness he escaped hidden within the woods, he quickly learns the evil has only become more malevolent. \nDeep in the basement, the mad Dr. Vingo Reinhard fulfills perverted experiments of his very own. \nThe doctor combines technology with The Book of The Dead, aka The Necronomicon.","torrent":{"xt":"urn:btih:c31165a7b945d48f3e40438ed06a78e162735ca6","amp;dn":"PC+-+Evil+Dead+Regeneration+%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c31165a7b945d48f3e40438ed06a78e162735ca6","infoHashBuffer":{"type":"Buffer","data":[195,17,101,167,185,69,212,143,62,64,67,142,208,106,120,225,98,115,92,166]},"announce":[],"urlList":[]}}