{"title":"Stacked and Sticky (2013 The Score Group) [DVDRip]","uid":8818191,"size":1527732148,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c553849eb152ad31aa423a68c9c949dffee9934e&amp;dn=Stacked+and+Sticky+%282013+The+Score+Group%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":2,"time":1376629800,"description":"Stacked and Sticky (2013 The Score Group) [DVDRip]\n\nPersia Monir, Rita Daniels, Demi La Rue, Joanna Storm, Shana DuPlae, Sunny Ray\n\nTwelve naturally stacked girls next door-almost all of them not available on DVD anywhere else-suck, fuck and offer up their big racks for cum. Features Internet sensation Maggie Green-a girl who, four years ago, wouldn't even show her pussy-in her first all-the-way XXX scene on DVD. Plus Siri with her hourglass figure, Beverly Paige, Destiny Rose, newcomer Jazmine, Latina Kitana Flores, voluptuous Reina Lee, big-assed Felicia Clover, black `n' stacked Pheona Monroe, Alex Chance, Bella Blaze and redhead Jolie Rain. No porn stars. Just real girls.\n\nENJOY MAGGIE GREEN'S FIRST DVD FUCK!\nMaggie Green, is about as far from being a porn star as a girl can get. She's just a girl-next-door who, a few years ago, wouldn't even show her pussy. But now she's going all the way in her first hardcore DVD, and she's dressed in slutty lingerie fuck-wear, too!\nBlonde, big-titted, big-assed Siri, looking slutty in an outfit that conceals just about nothing, opens up her cunt for dick and her mouth for cum.\nGoth chick Beverly Paige hooks up with a guy she just met online! He bangs her from behind, and she gets her legs behind her head so he can get his dick deeper. She takes his cum all over her face.\nVoluptuous blonde Destiny Rose is a Midwestern girl who dresses up like a cowgirl for her first on-camera fuck.\nSaucy, sassy Latina hottie Kitana Flores fucks two guys and opens her mouth for their cum.\nCurvy, voluptuous redhead Jolie Rain is a screamer when she's getting rammed by Johnny's big dick.\nSlim `n' naturally stacked Bella Blaze, rockin' a tight top, rides a cock until the stud coats her big jugs with cum. They're totally glazed!\nExotic, voluptuous beauty Reina Lee takes on a huge, thick cock. She fucks it and jacks it two-handed onto her face and tits.\nPheona has the pinkest pussy you've ever seen, and she loves getting turned upside-down for a piledriver fucking.\nPretty newcomer Jazmine jacks and fucks and lets her tits jiggle while she talks dirty and gets dicked hard.\nCurvy, sweater-busting Felicia Clover, newcomer Jazmine and girl-next-door Alex Chance also enjoy their first on-camera fucks. There's nothing like a girl's first time when we get to see it!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=zkjqp1u7a56rk0jnp052.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=zkjqp1u7a56rk0jnp052.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8p6wovgbidg65hc5wqrb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8p6wovgbidg65hc5wqrb.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=bgwl08m28dz8tevflqaf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=bgwl08m28dz8tevflqaf.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c553849eb152ad31aa423a68c9c949dffee9934e","amp;dn":"Stacked+and+Sticky+%282013+The+Score+Group%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c553849eb152ad31aa423a68c9c949dffee9934e","infoHashBuffer":{"type":"Buffer","data":[197,83,132,158,177,82,173,49,170,66,58,104,201,201,73,223,254,233,147,78]},"announce":[],"urlList":[]}}