{"title":"LiEat","uid":13695504,"size":197546582,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c57a993e2d9ba8382f32f717428d670695f084be&amp;dn=LiEat&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1456687650,"description":"About This Game\r\n\r\n\r\nEfina is a very special young girl. She's curious. She's optimistic. She has the power to make lies manifest as physical beings, and then she eats them for sustenance.\r\n\r\nShe's also a dragon.\r\n\r\n\r\n\r\nLiEat is the classic story of a vagabond and his dragon protege traveling a curious world, buying and selling secrets, all the while trying to uncover the truth about themselves. Along the way, they'll discover a web of hidden mysteries, meet a variety of colorful characters (including other dragons) and learn about the past events that brought them to where they are today.\r\n\r\nLiEat is broken down into three fantastic, bite-sized chapters:\r\n\r\n\r\n\r\n\r\nIn the first chapter, meet Efi and her caretaker, the multi-titled Leo, as they happen upon a small town with a big secret. Efi begins to understand the world around her in a different perspective, and the player finds that the legends that haunt the night aren't necessarily just children's tales...\r\n\r\n\r\n\r\nChapter two finds Efi and Hal (formerly Leo) investigating rumors of something magical and possibly dangerous inside a resort casino. Posing as a new guard, Hal gets room and board for himself and Efi, but they quickly realize that a roof over their heads doesn't mean it's a safe place to stay.\r\n\r\n\r\n\r\nThe final installment of LiEat bring Efi and Sid to a lavish mansion to foil the plans of a master thief. However, after the great robbery occurs, Sid begins to realize there's more at work than a simple heist, and Efi watches as his past - and his lies - finally catch up to them both.\r\n\r\n\r\nThis amazing trilogy has been beloved by JRPG enthusiasts and, for the first time ever, can be enjoyed in its entirety on Steam, in one singular package! With support from the original developer and the fan translator, PLAYISM is proud to help bring LiEat to the world at large!","torrent":{"xt":"urn:btih:c57a993e2d9ba8382f32f717428d670695f084be","amp;dn":"LiEat","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c57a993e2d9ba8382f32f717428d670695f084be","infoHashBuffer":{"type":"Buffer","data":[197,122,153,62,45,155,168,56,47,50,247,23,66,141,103,6,149,240,132,190]},"announce":[],"urlList":[]}}