{"title":"Vikings (2013) S01 (x265 BD-1080p Opus-5.1)","uid":10288910,"size":19483127205,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:c5c8f168dab0ccb4d623320fe55c08940d7b5fce&amp;dn=Vikings+%282013%29+S01+%28x265+BD-1080p+Opus-5.1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kammander","files":-1,"time":1401830164,"description":"!--------------------------------WARNING!--------------------------------\nThis release is intended to be played back on a desktop computer with a specific set of codecs. By intended, I mean it's the only thing that will work without a re-encode.\n\nAgain, this won't work, and it's not intended to work on your:\nPS3/PS4/Xbone/Wii U/Roku/BD Player/Media Center Streaming Device/whatever the hell else you people use to play back on a TV that's not hooked up to a good old fashion computer. It simply won't have the codecs, nor would it have the processing power to do it, though of course that varies greatly.\n\nIn other words, don't complain that it won't play on your PS4. I know it won't, and I told you it wouldn't. I am not surprised, and you shouldn't be either. I also told you what it WILL work on: your desktop computer. Though actually, depending on how bad it is it is, maybe not that either. As some advice, if you end up downloading this and it can't play back fast enough, it's time to upgrade grandpa's computer.\n\nSo, why you ask? Well, that's simple... because it is a new codec.\n\nWelcome to the future of encoding! One of these years, x265 will be the new standard for lossy encoded video, and opus the new standard for lossy encoded audio. For now, only a properly set up desktop computer can easily play this back. The purpose of course is the same purpose for codecs since the beginning: to keep quality the same, and lower the file-size at the same time.\n\nNow that we have discussed the hardware required, let's talk about the software you need.\n\nI recommend the KCP codec pack.\nDirect download: &lt;a href=&quot;\nhttp://haruhichan.com/projects/KCP/KCP-0.5.7.2_%5BECA20C88%5D.exe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://haruhichan.com/projects/KCP/KCP-0.5.7.2_%5BECA20C88%5D.exe&lt;/a&gt;\nGeneral reading page: &lt;a href=&quot;\nhttp://haruhichan.com/forum/showthread.php?7545-KCP-Kawaii-Codec-Pack&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://haruhichan.com/forum/showthread.php?7545-KCP-Kawaii-Codec-Pack&lt;/a&gt;\n\nDirections:\n1. Uninstall all other codec packs (K-lite, CCCP, whatever else is out there)\n2. Uninstall MPC-HC if you have it installed.\n3. Restart\n4. Install KCP (for best results, choose Highest preset you can. Note that not what you will be able to handle is based on the power of your computer, so play with the presets. The KCP package includes an on the fly preset changer, so you don't have to reinstall over and over)\n5. Watch Vikings!\n\nI've also heard that maybe VLC can play these already, so try that first if you have it installed already. Note though that I am NOT advocating that abortion called VLC. KCP is objectively the best playback solution available to Windows computers outside of setting codecs and filters up yourself manually. So, the other upside you get out of this is a much better playback experience.\n\nGood luck, and with a bit of patience, you can simultaneously:\n1. Set up a proper playback experience\n2. Enjoy the fruits of an emerging new codec that WILL replace h264 after enough time\n3. Watch some fucking Vikings.\n\nEnjoy!","torrent":{"xt":"urn:btih:c5c8f168dab0ccb4d623320fe55c08940d7b5fce","amp;dn":"Vikings+%282013%29+S01+%28x265+BD-1080p+Opus-5.1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5c8f168dab0ccb4d623320fe55c08940d7b5fce","infoHashBuffer":{"type":"Buffer","data":[197,200,241,104,218,176,204,180,214,35,50,15,229,92,8,148,13,123,95,206]},"announce":[],"urlList":[]}}