{"title":"HISTORY OF POP AND ROCK MUSIC - part 327","uid":6796046,"size":678514347,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c6406aa52275f172c56b65e4b36f68d87677e562&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+327&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1320453233,"description":"                       \n\n                       PART  327\n\n\n\n             ROGER WATERS  -  Radio Waves   (1987)\n             ROGER WATERS  -  Sunset Strip    (1987)\n             ROGER WATERS  -  Four Minutes   (1987)\n             ROGER WATERS  -  Tide is turning  (1987)\n\n\n\n\n       Radio K.A.O.S. is a 1987 concept album by Roger Waters. It is his second solo album.\n\n       The concept is based around a 23-year-old disabled man from Wales named Billy.Billy uses a wheelchair and is thought to be mentally a vegetable. However, Billy is highly intelligent but has no way of expressing himself. Billy has a twin brother Benny who is a coal miner. Billy lives with Benny, Benny's wife Molly, and their children. Unfortunately, Benny has lost his job in the mines due to the &quot;market forces&quot;. One night, Benny and Billy are out on a pub crawl when they pass a shop full of TV screens broadcasting Margaret Thatcher's &quot;mocking condescension&quot;. Benny vents his anger on this shop and steals a cordless phone. Next, in theatrical fashion, Benny poses on a footbridge in protest to the closures; the same night, a taxi driver is killed by a concrete block dropped from a similar bridge (Track 2 &quot;Who Needs Information). The police question Benny, who hides the phone in Billy's wheelchair. Benny is taken to prison, and Molly, unable to cope, sends Billy to live with his uncle David in L.A.. Billy is gifted and can hear radio waves in his head (&quot;Radio Waves&quot; track 1), so he begins to explore the cordless phone, recognising its similarity to a radio. He experiments with the phone and is able to access computers and speech synthesisers, he learns to speak through them. He calls a radio station in L.A. named Radio KAOS (hence the album title) and tells them of his life story about his brother being in jail (&quot;Me or Him&quot; track 3), about his sister-in-law not being able to cope and sending him to L.A. to live with his uncle Dave (&quot;Sunset Strip&quot; track 5), and about the closures of the mines (&quot;Powers that Be&quot; track 4). Billy eventually hacks in to a military satellite and fools the world in to thinking nuclear ICBMs are about to be detonated at major cities all over the world whilst deactivating the military's power to retaliate (&quot;Home&quot; track 6 and &quot;Four Minutes&quot; track 7). The album concludes with a song about how everyone, in thinking they were about to die, realises that the fear and competitiveness peddled by the mass media is much less important than their love for family and the larger community. (&quot;The Tide is Turning&quot; track 8).\n\n            After Roger had recorded the Radio K.A.O.S. album, which ends with a simulated nuclear attack in the song &quot;Four Minutes&quot;, his record company informed him that the album was too bleak and needed a more upbeat ending. Waters then recorded and added &quot;The Tide Is Turning&quot; to give the album a more optimistic finish.\n           Waters performed the song &quot;The Tide Is Turning&quot; with Joni Mitchell, Cyndi Lauper, Bryan Adams, Van Morrison with The Band and Paul Carrack and the Rundfunk Orchestra &amp; Choir in the 1990 concert, The Wall Live in Berlin.\n\n\nFrom Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:c6406aa52275f172c56b65e4b36f68d87677e562","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+327","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6406aa52275f172c56b65e4b36f68d87677e562","infoHashBuffer":{"type":"Buffer","data":[198,64,106,165,34,117,241,114,197,107,101,228,179,111,104,216,118,119,229,98]},"announce":[],"urlList":[]}}