{"title":"War Walks   (BBC 1997 - Season 2 - Complete)","uid":7256588,"size":1488824776,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c74151adbd223bfd1c63f1c85be50c0fd7c022c3&amp;dn=War+Walks+++%28BBC+1997+-+Season+2+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucybabe","files":9,"time":1336601650,"description":"Channels: BBC 2 &amp; BBC 4 (via DVB-S)\n\n(original broadcast date / capture date)\n\nMilitary historian Professor Richard Holmes goes on a journey through time to visit battlefields throughout Britain, northern France and Belgium that mark crucial moments in Britain's bloody and turbulent history.\n\n\nEpisode 1: Hastings (14th November 1997 / 22nd September 2010)\n\nRichard Holmes walks and rides over the Hastings battlefield that marks a turning point in British history, handling the weapons and equipment of the period and becoming a Norman knight to reveal just how close William the Conqueror came to defeat.\n\n\nEpisode 2: Bosworth (21st November 1997 / 29th September 2010)\n\nRichard Holmes visits a battlefield on which the course of British history was changed, as Henry Tudor's dynasty toppled that of King Richard III.\n\nHe encounters members of the Wars of the Roses Federation, who gather to re-enact the battle, and meets present-day supporters of Richard, convinced that he was not the soulless villain portrayed by Shakespeare.\n\n\nEpisode 3: Naseby (28th November 1997 / 6th October 2010)\n\nIn 1645, Charles I lost his struggle against Parliament during the decisive clash of the English Civil War. Professor Richard Holmes follows the campaign that led to the Battle of Naseby, starting at the king's headquarters in Oxford. On the battlefield itself he is able to touch the past, as metal detectors unearth musket balls buried for more than 350 years. Members of the Sealed Knot Civil War Reconstruction Society demonstrate the lethal power of the musket and the pike.\n\n\nEpisode 4: Boyne (5th December 1997 / 13th October 2010)\n\nFew battles resound down the centuries as loudly as the Boyne. The defeat of James II by William III in 1690 is commemorated every July, when the Protestant marching season begins in Northern Ireland.\n\nRichard Holmes walks beside the beautiful river where the two kings clashed and shows how the battle was almost over before it was fought - if a Jacobite gunner had been a little luckier, William would have been killed while inspecting enemy positions along the banks.\n\n\nEpisode 5: Dunkirk (12th December 1997 / 30th May 2010)\n\nRichard Holmes walks the French beaches and breakwaters from which thousands of British troops escaped capture in May 1940. German tanks had overwhelmed British and French troops and were poised to seize the British Expeditionary Force.\n\n\nEpisode 6: Blitz (19th December 1997 / 9th October 2010)\n\nOne night and one image encapsulate the London Blitz: 29th December 1940, the night of the second great fire of London when St Paul's rose in its glory above the smoke and flames. Richard Holmes traces the night's events, from the sector control room where the incoming raiders were plotted through to the efforts of the firemen to save St Paul's.\n\nA short sample is included for evaluation.","torrent":{"xt":"urn:btih:c74151adbd223bfd1c63f1c85be50c0fd7c022c3","amp;dn":"War+Walks+++%28BBC+1997+-+Season+2+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c74151adbd223bfd1c63f1c85be50c0fd7c022c3","infoHashBuffer":{"type":"Buffer","data":[199,65,81,173,189,34,59,253,28,99,241,200,91,229,12,15,215,192,34,195]},"announce":[],"urlList":[]}}