{"title":"To Save My Father's Soul - Michael William Molden","uid":4216587,"size":7710567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c821479f126183c4325e77b231bfb7c663d17a54&amp;dn=To+Save+My+Father%5C%27s+Soul+-+Michael+William+Molden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"raysuccre","files":1,"time":1212372760,"description":"Michael William Molden&amp;#039;s complete print book - pdf format with special features and interactive menu. \n\n\nFrom jacket:\n\nTo Save My Father&amp;#039;s Soul describes the quest of a young man, George, to learn his father&amp;#039;s true identity and inherit his spiritual legacy. In this mission he is forced to confront dark forces in far off lands, meet many strange characters and piece together his own destiny.\n\nAfter the death of his father, George undertakes to find out the truth about him and his mysterious life. George&amp;#039;s education in the dark arts begins in earnest, and he makes a promise to himself to save his father&amp;#039;s soul. Through the mastery of transcendental meditation George travels into astral planes and confronts the dark side of the human soul. He comes to a greater understanding of the nature of creation and discovers his spirit name and spirit guide.\n\nWe enter into a strange and often gruesome world that will, in parts, engross and challenge the reader. In order to save his father&amp;#039;s soul, George must use his new-found knowledge to fight the very heart of evil itself. To Save My Father&amp;#039;s Soul provides a magical insight into the personal spiritual journey of one young man and will raise fundamental questions in all of us","torrent":{"xt":"urn:btih:c821479f126183c4325e77b231bfb7c663d17a54","amp;dn":"To+Save+My+Father%5C%27s+Soul+-+Michael+William+Molden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c821479f126183c4325e77b231bfb7c663d17a54","infoHashBuffer":{"type":"Buffer","data":[200,33,71,159,18,97,131,196,50,94,119,178,49,191,183,198,99,209,122,84]},"announce":[],"urlList":[]}}