{"title":"The Berlin Wall: And the Inner-German Border 1961-89","uid":11767313,"size":27883260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c95dadf67c3b1543e1704bbf5398aefdb2ea6dbb&amp;dn=The+Berlin+Wall%3A+And+the+Inner-German+Border+1961-89&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1426897753,"description":"The Berlin Wall and the Inner-German Border (IGB) were built to halt the flow of refugees from East Germany to the West. From August 13, 1961, over 96 miles of crude fences and more sophisticated walls were erected around West Berlin. Border defenses ran 858 miles from the Baltic to the Czechoslovakian border, cutting villages in two, running through buildings, and intersecting roads and railways. Gordon L Rottman, who became familiar with both sides of the border while posted to Germany, examines the international situations that led to the creation of the Berlin Wall, discussing how the barrier systems functioned and their significance in the Cold War. Covering the erection of the barriers, how they evolved, defensive devices and the role of the checkpoints, this book also describes how ordinary people attempted to overcome these physical and political obstacles in their quest for freedom.\n\nGordon Rottman writes,&quot;In 1980 I found myself in a long-range reconnaissance patrol (LRRP) company. After 2 years of training we were assigned as the V Corps LRRP company: our mission in the event of a Soviet invasion of West Germany was to insert our 21 five-man reconnaissance teams inside East Germany, establish &quot;hides&quot; overlooking autobahns and other highways, and report the movements of the second operational echelon, the follow-on forces behind the initial assault forces. This required us to know a great deal about what it was like inside East Germany. We began an intense study of the IGB, and in the process I was able to visit the border, learn its ways, and find out how to penetrate it.&quot;","torrent":{"xt":"urn:btih:c95dadf67c3b1543e1704bbf5398aefdb2ea6dbb","amp;dn":"The+Berlin+Wall%3A+And+the+Inner-German+Border+1961-89","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c95dadf67c3b1543e1704bbf5398aefdb2ea6dbb","infoHashBuffer":{"type":"Buffer","data":[201,93,173,246,124,59,21,67,225,112,75,191,83,152,174,253,178,234,109,187]},"announce":[],"urlList":[]}}