{"title":"Dark Avenger Discography","uid":5533457,"size":229030338,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c9633a00a37e561a6437b253fbfd571ec0d3a1f4&amp;dn=Dark+Avenger+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":32,"time":1272996719,"description":"Iron Maiden meets Savatage with a little taste of the Helloween, led by a singer who steals the spotlights and tears everything up with extremely high vocals, with a impressivemix of Midnight, Rob Halford and Geoff Tate. This is Dark Avenger with a superb Power Metal from Brazil!\n\nThe band had its origins on the early 90's, after the relaese of a self-produced which attracted a great attention from the specialized media - which led to a recording contract, and therefore the release of their highly-acclaimed self-titled debut, on 1995, which is truly a heavy metal masterclass - just like their following release - &quot;Tales From Avalon: The Terror&quot;, released 6 years later.\n\nA huge number of musicians passed through the band, which contributed to a feeling of high instability which led to the end of the group, on 2005.\n\nRecently, on 2009, they reunited for a few concerts with the original line-up, including a show at the &quot;Rolla Pedra Festival&quot;, where they have presented a brand new song.\n\nThe Dark Avenger served as a living proof to show to many people that the brazilian metal is not just about the &quot;Angras&quot; or &quot;Shamans&quot;, and that Andre Matos is not even the best metal singer in the country. With this torrent, I bring to you 3 world class masterpieces of heavy metal to show to all the metal fans around the world the treasures that may be hidden behind the burocracy of the record labels, and the lack of support of the style.\n\nDark Avenger - Dark Avenger (1995)\nDark Avenger - Tales Of Avalon: The Terror (2001)\nDark Avenger - X Dark Years EP (2003)\n\nnote: there's also a great official recording which's supposed to be called &quot;Live In The Dark&quot;, including most of the band's greatest hits and a beautiful performance with a live orchestra, which was recorded with the last active lineup (the one from &quot;X Dark Years&quot;) but was never released due to some issues with the label and former members fighting for copyrights...","torrent":{"xt":"urn:btih:c9633a00a37e561a6437b253fbfd571ec0d3a1f4","amp;dn":"Dark+Avenger+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9633a00a37e561a6437b253fbfd571ec0d3a1f4","infoHashBuffer":{"type":"Buffer","data":[201,99,58,0,163,126,86,26,100,55,178,83,251,253,87,30,192,211,161,244]},"announce":[],"urlList":[]}}