{"title":"Lamb Of God And Ark Of The Covenant DivX","uid":3947789,"size":1710550312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c989f524be0ae2f12ec8ba0a23d4004b22f377ac&amp;dn=Lamb+Of+God+And+Ark+Of+The+Covenant+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"verifire","files":-1,"time":1198622147,"description":"Hi there.\n\nI'm at the moment being constantly monitored and hindered in sharing Christian material. For instance uTorrent shows that there's three(!) seeders on every torrent I upload when they've been published for a few minutes, and I have shared maybe 1% of the file. How's that possible? A month ago it showed &quot;only&quot; two..\n\nThe people who hate what I do block my listening port and slows down my bandwidth to an extreme low, and I'm being bombarded in comments on uploads and mails. The only thing I can do, is to appeal to you who are Christians, to help me seed these torrents, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world..\nAnd then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nAnyway: A while ago I uploaded this movie by Jonathan Gray, which I named &quot;Lamb Of God And Ark Of The Covenant&quot;.\nTruly amazing stuff. And he has several more amazing DVDs to share with us. I've bought them, And his books too, and they blow my mind...\n\nYou can find them, and prescribe to his free newsletter at:\n &lt;a href=&quot;\nhttp://beforeus.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://beforeus.com/&lt;/a&gt;\n\nUpon prescription, you'll receive special offers not available to the general public.\n\nAfter I uploaded the movie, I've realized that Mr. Gray is NOT a wealthy man. In fact He has sold all of his estate and now rents a place to live for himself and his wife.\nHe has spent, and spends, all of his money on expeditions and giving lectures. He does not even charge any money when he is invited to different places to give his seminars.\nHis ONLY income is from selling his books and DVDs, and he even personally signs the customs declaration on the packages people order. I've seen this with my own eyes. Know what I mean?\nIn other words;I don't think he makes too much money as it is, and I have written this by my own conviction, meaning that this is important work and should get as much real support as possible. And that is why I won't upload the DVDs. I've been in contact with Mr. gray about this. He said that he normally doesn't give such permission, but forgave me, and, quote: &quot;appreciated that I did this out of love for the material&quot;. He is really a good, humble servant of the Lord.\n\nI've NEVER read or heard anything remotely like this stuff. It'll change the way you look at a lot of things, yes even the way you look at the world in general.. This upload is to give you all the chance to PLAY AN ACTIVE ROLE in making this man's continued work possible. And your own benefit is actually priceless.\n\nI therefore uploaded a short movie-clip with Mr. Gray presenting his Books and DVD's on this location:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4178115/Surprising_Discoveries_Presented_By_Jonathan_Gray&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4178115/Surprising_Discoveries_Presented_By_Jonathan_Gray&lt;/a&gt;\n\nNow about &quot;Lamb Of God And Ark Of The Covenant DivX:\n\nWhat you are about to see may:\n1: Leave you in awe and wonder, or you\n2: may not believe in it, and\n3: also fail to see it's significance.\n\nI hope you are in the first group.\n\nThe archaeologist Jonathan Gray has made this video. I found it in a \nfriend's video collection and copied it, and uploaded it.\nThe day after , I received a newsletter from Mr. Gray's website, which I enclose in this folder along with\nthis comment. Amazing it should turn up in my mailbox the day after I saw \nthis video..\nI advice you to read it.\n\nThe video has Norwegian subtitles, and should be understandable for \nmost Scandinavian (and of course English-speaking) truth-seekers.. :-)\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f38596819a959a81969e929a9fb3949e929a9fdd909c9e&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:c989f524be0ae2f12ec8ba0a23d4004b22f377ac","amp;dn":"Lamb+Of+God+And+Ark+Of+The+Covenant+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c989f524be0ae2f12ec8ba0a23d4004b22f377ac","infoHashBuffer":{"type":"Buffer","data":[201,137,245,36,190,10,226,241,46,200,186,10,35,212,0,75,34,243,119,172]},"announce":[],"urlList":[]}}