{"title":"Ringo_Starr-Y_Not-2010-SiRE","uid":5269521,"size":58175847,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cbedf445208c597b04c6fc055731f1a3d7b46642&amp;dn=Ringo_Starr-Y_Not-2010-SiRE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":13,"time":1262998566,"description":"Artist:   Ringo Starr\nTitle:    Y Not\nLabel:    Universal\nGenre:    Rock\nBitrate:  209kbit av.\nTime:     00:36:44\nSize:     58.16 mb\nRip Date: 2010-01-08\nStr Date: 2010-01-11\n\n01. Fill In The Blanks                                            3:14\n02. Peace Dream                                                   3:34\n03. The Other Side Of Liverpool                                   3:23\n04. Walk With You                                                 4:42\n05. Time                                                          3:49\n06. Everyone Wins                                                 3:54\n07. Mystery Of The Night                                          4:05\n08. Can't Do It Wrong                                             3:45\n09. Y Not                                                         3:49\n10. Who's Your Daddy                                              2:29\n\nRelease Notes:\n\nFor the first time in one of popular music's most enduring and\nillustrious careers, Ringo Starr has decided to take charge and produce\nhimself. The result is perhaps the most personal and impressive album\nof this rock legend's entire solo career. How on earth did Starr\nfinally locate the absolutely perfect producer to work with him? &quot;Well,\nI looked in the mirror,&quot; Ringo says with a smile. &quot;And I was looking\nreal groovy that day.&quot;\n\nStarr's decision to take a stronger role in the recording of his latest\nand greatest solo album was a significant and fortuitous one. &quot;I didn't\ndo it at the start,&quot; Starr says. &quot;I was the least involved in the\nproduction of the Beatle records. And then with my solo records, I\nworked with some other great producers like Richard Perry, Arif Mardin,\nand Don Was. So it just seemed like that's the way that it goes. Then\nsuddenly, it's another point in your life, and you say, 'I'm going do\nthis now.' So I'll be producing anything I make from now on. That's the\ngood news. It's a confidence thing, I suppose. And Y Not is really\nanother way of me saying, 'Yes, I can.'&quot;\n\nThe joyous result of Starr looking in the mirror is Y Not, a groovy and\ndeeply felt song cycle that finds Ringo leading a smaller core group of\nold and new friends including longtime pal and recent brother-in-law\nJoe Walsh, Dave Stewart and longtime Roundheads member Steve Dudas on\nguitar, Benmont Tench of Tom Petty and the Heartbreakers on keyboards,\nDon Was and Mike Bradford on bass. The album also features Starr's\nengineer and co-producer Bruce Sugar on keyboards, as well as some\nspecial guests like Joss Stone, Ben Harper and Richard Marx on vocals,\nAnn Marie Calhoun on violin and Tina Sugandh -- aka Tina The Tabla Girl\n- on tabla and chanting. Starr's songwriting collaborators on Y Not\nalso include familiar and new names like Joe Walsh, Dave Stewart, Joss\nStone, Glen Ballard, Richard Marx, Van Dyke Parks, Gary Nicholson plus\nGary Wright and his former Roundhead band member, Gary Burr.\n\nYet no collaborator featured on Y Not is likely to receive as much\nattention as Starr's former bandmate and longstanding mate Paul\nMcCartney, who adds a characteristically brilliant bass part to the\ninspiring &quot;Peace Dream&quot; -- Starr's latest heartfelt plea for peace and\nlove -- and even more notably provides his unmistakably fabulous vocals\nto &quot;Walk With You,&quot; an exquisite new composition by Starr and Van Dyke\nParks.\n\n&quot;Walk With You&quot; is a moving, even spiritual meditation about the\nlasting power of friendship, and McCartney's inspired participation on\nthe track was a testament to McCartney's generosity of spirit and\nmusical talent. &quot;Paul was doing the Grammys, so he came over to the\nhouse and was playing bass on 'Peace Dream.' So I played him this other\ntrack and Paul said, 'Give me the headphones. Give me a pair of cans.'\nAnd he went to the mike and he just invented that part where he follows\non my vocal. That was all Paul McCartney, and there could be nothing\nbetter. He makes it bigger and he makes it fuller. It makes the song\nlike a conversation between us, and that was Paul's idea to do his part\none beat behind me. That's why he's a gen-i-us and an incredible bass\nplayer.&quot;\n\nIndeed, there's a whole lot of genius on display throughout Y Not.\nHighpoints here include &quot;Fill In The Blanks,&quot; the album's rocking\nopening track written, played and sung only by Starr and Walsh. Then\nthere's &quot;The Other Side Of Liverpool,&quot; a revealing autobiographical\nsong that explores Starr's earliest and darkest days. &quot;People believe I\nwas born, was a Beatle and lived in a big house,&quot; Starr explains. &quot;And\nwhere I come from was a very dark, damp, violent neighborhood. I wanted\nto write another little snapshot of my life, and I'm going to do this\nevery album. It's better for me than doing it in a book. In two lines I\ncan say what would take five pages. Like the song says, 'The other side\nof Liverpool is cold and damp/Only way out of there/drums, guitar and\namp.'&quot;\n\nStarr was already particularly thrilled with one early review for the\nfirst album he produced that came from someone he helped produce too.\n&quot;I just played it for my son Zak,&quot; Starr explains. &quot;And Zak was so\ngreat. He said, 'Dad, it's great. This rocks! You should have been\ndoing this forever.' It's nice coming from your boy, especially since\nhe's a really good drummer.&quot;\n\nListen for yourself. And hear Ringo Starr -- also a really good drummer\n-- doing exactly what he should be doing today and forever.\n\nWhy?\n\nY Not.\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;b9cad0cbdcf9d1cccad197d8d0&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n","torrent":{"xt":"urn:btih:cbedf445208c597b04c6fc055731f1a3d7b46642","amp;dn":"Ringo_Starr-Y_Not-2010-SiRE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbedf445208c597b04c6fc055731f1a3d7b46642","infoHashBuffer":{"type":"Buffer","data":[203,237,244,69,32,140,89,123,4,198,252,5,87,49,241,163,215,180,102,66]},"announce":[],"urlList":[]}}