{"title":"Christian Kjellvander - The Pitcher [2013][EAC.CUE,LOG.FLAC]","uid":9267469,"size":204384692,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cc305c3a9594e50bd9ae36254a4f4f5be258d86f&amp;dn=Christian+Kjellvander+-+The+Pitcher+%5B2013%5D%5BEAC.CUE%2CLOG.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":12,"time":1385718905,"description":"Artist: Christian Kjellvander\nRelease: The Pitcher\nReleased: 2013\nLabel: Tapete Records\nCatalog#: TR273\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: SW\nStyle: Americana,Rock\n\nimage\n\n\n01. The Mariner\n02. The Zenith Sunset\n03. The Trip\n04. The Woods\n05. THe Field Before\n06. The Crow\n07. The Valley\n08. The Island\n09. The Bloodline \n\n\nSo striking is &quot;The Mariner,&quot; the opening cut on The Pitcher, Christian Kjellvander's fifth solo offering, it's almost difficult to move on. With luxuriant textures caressing his mellifluous, melancholy baritone, adorned by brushed snares, acoustic guitars, and the Gothenburg Symphony Orchestra's chamber strings, it's arresting, haunted, and beautiful. Each succeeding track seems to fit inside a particular crack in a carefully crafted mosaic created from a sumptuous meld of lush, nocturnal pop and Americana. The musical journey moves Odysseus-like -- its images from sea to land and back -- but these locales feel more like metaphors in Kjellvander's poetically rich language than they do physical landmarks. Memory and emotions are evoked as often as terrain. &quot;The Zenith Sunset&quot; is a brooding, swirling web of color, as acoustic guitars, pianos, and brushed snares urgently underscore this desperate love song. Kjellvander's electric guitar hovers dramatically before it kicks loose and unsettles the balance yet never derails its subsequent majesty. &quot;The Trip&quot; shifts gears with a simple country melody and lyric reverie; he is accompanied only by his acoustic guitar and wife Therese on harmony vocals. &quot;The Woods&quot; treks into an underworld where fluid guitars, atmospheric keyboards, a drum kit, strings, winds, and warm reverb wind around the singer as he journeys through his protagonist's emotional twilight. &quot;The Crow&quot; is darkly spiritual in its imagery, as dramatic as a turbulent sea in execution. It's introduced by strummed bass strings, cello, and backdropped acoustic guitars. A Spanish-tinged electric six-string serves to heighten the tension, framing the singer in open, rippling space. &quot;The Valley&quot; is a country-ish rocker, but it's distorted in a sad Americana Gothic fun house mirror that simultaneously reflects Bruce Springsteen's rootsy romantic confusion on Tunnel of Love and Richard Buckner's fragmented experimental sonic isolation and loss on Devotion + Doubt. &quot;The Island&quot; is more akin to &quot;The Mariner,&quot; though its melody and lyric are more settled, open, nearly idyllic. Kjellvander's singing warmly celebrates spiritual and physical belonging. To that conclusion, &quot;The Bloodline&quot; expresses love for a woman. This slow country gospel melody floats out of a nearly alien 21st century spacy backdrop, as haphazardly strummed electric guitars, sonic effects, and distortion frame his and Therese's harmonizing voices, as they offer the final affirmation that &quot;There is nothing wrong/With love.&quot; The Pitcher is rich in drama, musical and production ambition, melodic skill, and deeply emotional poetic imagery. It is no exaggeration to say that it fits comfortably alongside Beck's Sea Change, Brendan Perry's Eye of the Hunter, Mickey Newbury's It Looks Like Rain, and Tim Buckley's Lorca.","torrent":{"xt":"urn:btih:cc305c3a9594e50bd9ae36254a4f4f5be258d86f","amp;dn":"Christian+Kjellvander+-+The+Pitcher+%5B2013%5D%5BEAC.CUE%2CLOG.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc305c3a9594e50bd9ae36254a4f4f5be258d86f","infoHashBuffer":{"type":"Buffer","data":[204,48,92,58,149,148,229,11,217,174,54,37,74,79,79,91,226,88,216,111]},"announce":[],"urlList":[]}}