{"title":"Kriya -biochemistry of Sudarshan Kriya","uid":4356881,"size":96960,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc37c827d381b986b41b403b7bd5b8d9369a5b21&amp;dn=Kriya+-biochemistry+of+Sudarshan+Kriya&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"welovesrisri","files":1,"time":1219451342,"description":"The biochemistry of Sudarshan Kriya\n\nIf we reduce the number of oxygen radicals, we improve the antioxidant status in our body and live longer \n-Manoj Jain\n\nEver wonder what causes us to age resulting in death of our body cells over the years, develop heart disease leading to plaque in the artery, or suffer from cancer causing cells to mutate and grow erratically? The answer may be simpler than we think.\n\nSome researchers say the common denominator in all these conditions is the antioxidant status ÃƒÂ¢?? the level of chemical process that takes place in our cells and genes. Like we measure our cholesterol level, researchers argue, we can measure our antioxidant status and determine how vulnerable we are to diseases.\n\nIn a pilot study, biochemists at All India Institute of Medical Sciences (AIIMS) studied the effect of Sudarshan Kriya on the antioxidant status of individuals. Sudarshan Kriya is a well known rhythmic breathing technique promoted by the Art of Living workshops. It is preceded by Ujjayi Pranayam or long and deep breaths with constriction at the base of throat and Bhastrika or fast and forceful breaths through the nose along with arm movements.\n\nBefore we talk about their findings, letÃƒÂ¢??s step back into our biochemistry class and understand what antioxidant status means. According to the free-radical theory, the cells in our body are being constantly damaged and destroyed by oxygen radicals, similar to what dirt and rust do to our cars. Oxygen radicals are different from oxygen gas in that they are molecules that are highly charged and detrimental byproducts of cell reactions.\n\nOur body has an antioxidant defense system that constantly searches and destroys these oxygen radicals, much like our immune system, which polices our body for foreign agents such as bacteria and viruses and eliminates them. \n\nIf the antioxidant defense system of our body is weak, then the number of oxygen radicals increases, causing our cells to die quickly. This results in inflammation and plaque within our heart vessels or prompts the cells to mutate into cancer cells. If we reduce the number of oxygen radicals, we improve the antioxidant status in our body, and we live longer and lead a disease free life.\n\nIt is important that we try to reduce the level of oxygen radicals and strengthen our defense system. We can increase our antioxidant levels through our diet. A healthy diet of vegetable and fruit increases our intake of\nimportant antioxidants such as Vitamins A, C, E, and beta carotene. Some initial studies have shown the benefit of higher antioxidants in our diet, but larger studies have not detected the benefit ÃƒÂ¢?? so the jury is still out.\nSmoking, alcohol and chronic psycho-social problems like work and family pressures, can increase oxidative\nstress. This stress affects our complex molecules and genes. Yoga and meditation can relieve this stress. Will\nSudarshan Kriya have a similar effect?\nA team lead by Dr Neeta Singh and Dr Vinod Kochupillai, former chief of IRCH and Head of Medical Oncology\nat IRCH ( Institute rotary cancer hospital) at AIIMS, tested the blood of 42 persons who were practicing\nSudarshan Kriya for over 1 year and compared it with the blood of 42 healthy individuals who were not practicing\nany form of physical exercise or stress management techniques. What the researchers found was thought\nprovoking. Clearly, the cellular activity between the two groups was different.\nThe Kriya practitioners had a better antioxidant status at the enzyme and the gene level. Also they had less\nDNA damage and cell aging. It is difficult to know if this change will lead to longer life span, decrease rates of\ncancer, or lessen heart disease, but ÃƒÂ¢??we should practice some type of breathing technique once a day to reduce\nstress,ÃƒÂ¢?? said Dr Neeta Singh, who herself does it twice everyday. Though biochemical science and spirituality may seem miles apart, it is heartening to see ancient practices and modern science converging in manÃƒÂ¢??s endeavour to\nlive a richer and healthier life.\nDr Manoj Jain is an infectious disease physician working in Memphis (US) and Indore (MP)\n\n\nPublication: Times Of India Delhi; Date: Feb 24, 2008; Section: Mind Over Matter; Page: 27\n","torrent":{"xt":"urn:btih:cc37c827d381b986b41b403b7bd5b8d9369a5b21","amp;dn":"Kriya+-biochemistry+of+Sudarshan+Kriya","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc37c827d381b986b41b403b7bd5b8d9369a5b21","infoHashBuffer":{"type":"Buffer","data":[204,55,200,39,211,129,185,134,180,27,64,59,123,213,184,217,54,154,91,33]},"announce":[],"urlList":[]}}