{"title":"More Dirty Debutantes 18 XXX DVDRip","uid":11826190,"size":2049229418,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cdd909536952fb14bff2c5ba91ac5822c9c18c6f&amp;dn=More+Dirty+Debutantes+18+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"B01010000","files":2,"time":1429503181,"description":"        ...::TORRENT NAME::...\nMore Dirty Debutantes 18 XXX DVDRip\n\n    ...::POSTER &amp; SCREENSHOTS::... &lt;a href=&quot;\nhttp://adsreserve.com/?v=MY2X1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adsreserve.com/?v=MY2X1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://adsreserve.com/?v=3K6sk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adsreserve.com/?v=3K6sk.jpg&lt;/a&gt;\n\n        ...::DESCRIPTION::...\nEight Separate Scenes! 6 New exciting Faces! 6 Ladies I in there Debut on DVD and some first time experiences, All for you. All new action More Dirty Debutantes 18 is the answer to all of the fans demands! New faces! Lots of back door action in 3 scenes! Variety! It's all here! This is not just and ordinary DVD its an invitation that's exclusive, a privilege to witness special moment in real people's lives. A new dimension in the genre of amateur adult DVDs. No Script! What happens is with desire and consent! Nobody appears in a Debutantes DVD without full understanding that they can do anything they want or as little! This is their memento be shared with you. The public. Randy West is back==the nasty bros. Reunite. The way you want them nasty but nice. Meet our Debutantes, Micki in a sizzling scene with her friend Pierre as he goes to the rear. Be there when Myria, the star of Ed's Deep inside Dirty Debutantes 3 and 4 goes deeper in her first real life and reel life experience with a woman. Sexy Sabre, Angel returns from Vol. 17 with more close up experience with old Ed. Meet Francesca Lei Before she was ever picked up a script! Go deep behind the scenes! The Bros get Angela Prima for a Primo Moment -- is it a bro-ment? It's all there for you in &quot;More Dirty Debutantes 18&quot;.\n\nScene 1. Angela Prima, Ed Powers, Randy West in an FMM threesome.\n\nScene 2. Myria, Sabre--personal favorite--Myria's first time with a woman, it's sweet &amp; sexy! In my admittedly biased view, THIS SCENE IS THE REASON FOR THE DOWNLOAD!!\n\nScene 3. Micki Watanshi, Pierre Swami in first time in front of the camera sex for this couple.\n\nScene 4. Angel, Ed Powers--Ed gets to fuck Angel in the ass.\n\nScene 5. Francesca Le, Ed Powers--Francesca is credited as Francesca Lei in this *very* early scene where she gives up her ass to Ed.\n\nScene 6. More Myria &amp; Sabre\n\nScene 7. Micki Watanshi, Ed Powers--Ed gets a handjob in this scene. Kinda cool in the bored &amp; ignored sense--you really get the idea that she's had enough of the jerking by the time she makes him pop.\n\nFIN\n\nFile Size : 1954.3 MB\nResolution : 640x480\nDuration : 02:13:36\nVideo : VC-1 (VC-1), 2 048 Kbps, 29.970 fps\nAudio : WMA (WMA2), 64.0 Kbps (CBR), 44.1 KHz, 2 channels, 1 stream","torrent":{"xt":"urn:btih:cdd909536952fb14bff2c5ba91ac5822c9c18c6f","amp;dn":"More+Dirty+Debutantes+18+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdd909536952fb14bff2c5ba91ac5822c9c18c6f","infoHashBuffer":{"type":"Buffer","data":[205,217,9,83,105,82,251,20,191,242,197,186,145,172,88,34,201,193,140,111]},"announce":[],"urlList":[]}}