{"title":"Cultural Atlas of the Viking World (History).pdf","uid":14756370,"size":64563901,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf8829b4ade0605abfddeeeccdfd8641b55295ff&amp;dn=Cultural+Atlas+of+the+Viking+World+%28History%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1464821490,"description":"Cultural Atlas of the Viking World\r\nFacts on File | 1994 | 0816030049 | English | 248 pages | PDF | 61.6 MB\r\n\r\nOne of the &quot;Culural Atlas&quot; series, this is an illustrated history of the Viking Age - Europe's dominant culture for over 300 years from the late 8th century. Centred on Denmark, Norway and Sweden, but reaching westward across the Atlantic, eastward to the Black Sea and southward to the Mediterranean, the Viking Age dominated Europe and was symbolized by networks of sea crossings and river routes, military campaigns and cultural development. The first part of the atlas examines the physical background of the Scandinavian homelands and traces the history of human settlement before the Vikings. Part Two covers the Vikings in Scandinavia, dealing with society and organization, rulers and kings, warfare, daily life of farmers, craftsmen and traders, religion, literature and much more. Next, contributors discuss the Vikings overseas, in the Western World, the Celtic World, the North Atlantic, Russia and the East. This section includes major features on The Danelaw, Repton Winter Camp, York, Jarlshof, The Isle of Man, St Patrick's Isle and Dublin. Lastly, the atlas covers the conversion of the Vikings to Christianity and the foundation of the nation-states of Denmark, Sweden and Norway","torrent":{"xt":"urn:btih:cf8829b4ade0605abfddeeeccdfd8641b55295ff","amp;dn":"Cultural+Atlas+of+the+Viking+World+%28History%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf8829b4ade0605abfddeeeccdfd8641b55295ff","infoHashBuffer":{"type":"Buffer","data":[207,136,41,180,173,224,96,90,191,221,238,236,205,253,134,65,181,82,149,255]},"announce":[],"urlList":[]}}