{"title":"Robert Jordan - Het Rad des Tijds 4 - De komst van de schaduw TB","uid":6464528,"size":1037510610,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d0c2bf44fa510a8563fbb67e69cea097a9c32fee&amp;dn=Robert+Jordan+-+Het+Rad+des+Tijds+4+-+De+komst+van+de+schaduw+TB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Vlinder2","files":-1,"time":1307914839,"description":"Audioboek - Robert Jordan - Het Rad des Tijds Boek 4 - De komst van de schaduw\n\nBeschrijving\n Het Rad des tijds is een meerdelige saga over de vervulling van bijna vergeten voorspellingen. Dit epos staat op een veel hoger peil dan de meeste fantasy: groots en meeslepend, vol subtiele humor, warme menselijkheid en adembenemende spanning, in een betoverende wereld die volledig gaat leven.\n\nDe Steen van Tyr, de burcht van de legenden, is ingenomen door Rhand Altor. Nu is het zeker: hij is de Herrezen Draak, degene die gedoemd is de wereld te redden, en te vernietigen. Terwijl zijn vrienden en vijanden plannen beramen, bestudeert Rhand de Voorspellingen en worstelt hij met de Kracht, de gave die hij nauwelijks kan beheersen. Maar bovenal overweegt hij zijn volgende zet, een keuze voor het onverwachte. Wat Rhand ook besluit, iedereen weet waartoe het zal leiden: oorlog tegen allen die zich verzetten, en uiteindelijk tegen de Duistere, wiens invloed op de wereld onafwendbaar toeneemt. Niemand kan zeggen hoe lang zijn kerker nog zal standhouden...\n\n\n \nRecensie(s)\nNBD|Biblion recensie\n Rhand Altor woont nu in de legendarische Steen van Tyr, de burcht waarin hij met het zwaard Callandor de strijd won tegen Ra'abramon, de Duistere. Rhand aanvaardt dat hij de 'Herrezen Draak' is, maar leert slechts heel gebrekkig de ontzagwekkende mystieke Kracht waarover hij nu beschikt te gebruiken. De Voorspellingen (het is 4000 jaar na het 'Breken' van de wereld toen de Duistere voor het eerst tijdelijk verslagen werd) zeggen dat drie ta'veren het mystieke Patroon dat de wereld regeert naar hun eigen wil zullen schikken: Rhand en zijn twee vrienden (zie de vorige boeken), maar ook dat de Herrezen Draak (Rhand) de wereld zal redden ÃƒÂ©n vernietigen tijdens de Laatste Slag tegen de Duistere. De Schaduw komt eraan: voortekens van de toenemende macht van de Duistere. Afwisselend volgen we Rhand op een zoektocht naar een andere oplossing en de belevenissen van diverse vrienden en vijanden in een reeks fantastische, mystieke en lugubere avonturen en veldslagen met en tegen diverse menselijke en bovennatuurlijke wezens. Interessant maar ingewikkeld fantasy-avontuur in doorgaande reeks. Ondanks inleidende hoofdstukken is kennis der vorige delen noodzakelijk. Voorzien van uitgebreide woorden- en namenlijst. Normale druk.\n\n\nTBS","torrent":{"xt":"urn:btih:d0c2bf44fa510a8563fbb67e69cea097a9c32fee","amp;dn":"Robert+Jordan+-+Het+Rad+des+Tijds+4+-+De+komst+van+de+schaduw+TB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0c2bf44fa510a8563fbb67e69cea097a9c32fee","infoHashBuffer":{"type":"Buffer","data":[208,194,191,68,250,81,10,133,99,251,182,126,105,206,160,151,169,195,47,238]},"announce":[],"urlList":[]}}