{"title":"Georgia_Fox_-_Bondslave.epub","uid":9172749,"size":408279,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d11e348ba2584d5b8ec89291c69eeab70dd466b3&amp;dn=Georgia_Fox_-_Bondslave.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1384098047,"description":"The seven bastard sons of Guillaume d'Anzeray are on a mission to find wives -- women to breed the next generation of a dark dynasty that many wish to see extinct.\nIt won't be easy to find brides from among the powerful Norman nobility, for the d'Anzeray are upstarts, men of war, their family's fortunes raised through bloodshed and violence. As one holy man and chronicler of their times has written, &quot;From the devil they came and to the devil they will return&quot;.\nBut these brothers don't care much for holy men or for what is written about them. Now, with the future of their bloodline at stake these mercenary warriors need wives and they have no scruples when it comes to claiming the women they desire. Nothing and no one stands in their way. Not even a few difficult, quarrelsome wenches who think they can resist capture once these powerful hunters have them in their sights.\nIt's a good thing the d'Anzeray don't mind sharing the spoils of victory with their brothers. It just might take all seven of them to bring this harem to submission.\n\nGenre:Erotic romance ","torrent":{"xt":"urn:btih:d11e348ba2584d5b8ec89291c69eeab70dd466b3","amp;dn":"Georgia_Fox_-_Bondslave.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d11e348ba2584d5b8ec89291c69eeab70dd466b3","infoHashBuffer":{"type":"Buffer","data":[209,30,52,139,162,88,77,91,142,200,146,145,198,158,234,183,13,212,102,179]},"announce":[],"urlList":[]}}