{"title":"Andrew Shaffer - Literary Rogues. A Scandalous History of Waywar","uid":10347789,"size":5606398,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1faddeaf7bab7e298cedc017489ab479ed18c32&amp;dn=Andrew+Shaffer+-+Literary+Rogues.+A+Scandalous+History+of+Waywar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1402630033,"description":"Description\nProduct Details\nBook Title: Literary Rogues: A Scandalous History of Wayward Authors\t\nBook Author: Andrew Shaffer (Author)\nPaperback: 320 pages\nPublisher: Harper Perennial (February 5, 2013)\nLanguage: English\nISBN-10: 0062077287\nISBN-13: 978-0062077288\n\n===================================================================================\nBook Description\nPublication Date: February 5, 2013\nA Wildly Funny and Shockingly True Compendium of the Bad Boys (and Girls) of Western Literature\nRock stars, rappers, and actors haven't always had a monopoly on misbehaving. There was a time when authors fought with both words and fists, a time when poets were the ones living fast and dying young. This witty, insightful, and wildly entertaining narrative profiles the literary greats who wrote generation-defining classics such as The Great Gatsby and On the Road while living and loving like hedonistic rock icons, who were as likely to go on epic benders as they were to hit the bestseller lists. Literary Rogues turns back the clock to consider these historical (and, in some cases, living) legends, including Edgar Allan Poe, Oscar Wilde, Zelda and F. Scott Fitzgerald, Ernest Hemingway, Dorothy Parker, Hunter S. Thompson, and Bret Easton Ellis. Brimming with fascinating research, Literary Rogues is part nostalgia, part literary analysis, and a wholly raucous celebration of brilliant writers and their occasionally troubled legacies.\n\n===================================================================================\nReviews\n&quot;In this rollicking romp through a gallery of writers whose genius came with a price (alcoholism, drug addiction, depression, and other troubles), Shaffer offers a terrific blend of literary history, biography, and witty commentary.&quot; Publishers Weekly\n\n&quot;Entertaining and well-researched.&quot; Kirkus Reviews\n\n===================================================================================\nAbout the Author\nAndrew Shaffer is the author of Great Philosophers Who Failed at Love and, under the pen name Fanny Merkin,Fifty Shames of Earl Grey. His writing has appeared in such diverse publications as Mental Floss and Maxim. An Iowa native, Shaffer currently lives in Lexington, Kentucky, a magical land of horses and bourbon. Visit him online at evilreads.com.\n===================================================================================","torrent":{"xt":"urn:btih:d1faddeaf7bab7e298cedc017489ab479ed18c32","amp;dn":"Andrew+Shaffer+-+Literary+Rogues.+A+Scandalous+History+of+Waywar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1faddeaf7bab7e298cedc017489ab479ed18c32","infoHashBuffer":{"type":"Buffer","data":[209,250,221,234,247,186,183,226,152,206,220,1,116,137,171,71,158,209,140,50]},"announce":[],"urlList":[]}}