{"title":"Language and Sexuality","uid":4723724,"size":1794327,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d29c39d749e5db58991165b7281a0c7b456a8b7b&amp;dn=Language+and+Sexuality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timnehguy","files":2,"time":1234639228,"description":"Language and Sexuality, by Deborah Cameron (Author), Don Kulick (Author)\n\n'A much needed book ... the authors affirm the centrality of language to sexuality, and in doing so map out a vital field of study.' Jeffrey Weeks, author of Making Sexual History 'Using the right word at the right time is also the subject of Deborah Cameron's Language and Sexuality ... one of the questions she poses is 'how do you say no to a sadomasochist'?' Daily Telegraph 'This is a pioneering volume that integrates previous disparate studies and sets out a new and distinctive research agenda ... the result is a brave work, and its authors deserve high praise.' Times Higher Education Supplement '... enviably lucid and erudite ... This is an important book for a wide range of readers because it addresses vital ideas with great clarity. One of the most impressive things about it, in addition to the intelligence of its arguments, is that the authors are always absolutely clear about how they are using terminology as well as about how such vocabulary has changed over time. Concrete examples and effective analogies enable the reader to follow their discussion, and the authors adroitly avoid the murkiness of language and thought that often characterizes such theoretical writing ... this is an extremely useful book for students, teachers and scholars in a range of disciplines as it allows readers to think about how language constructs categories which, without studies such as this, remain intellectual and political straightjackets.' Changing English '... this book is both valuable and unique ... The authors succeed in representing the range and diversity of research on language and should be congratulated in this respect ... the authors more than meet the objectives they set for themselves ... I found this a helpful and enjoyable read which I have no hesitation in recommending.' Feminism &amp; Psychology 'In their brief and lively book Language and Sexuality, Cameron and Kulick synthesize some of this scholarship and put forth a new framework for future research in this dynamic field. ... this ambitious book takes an important first step in ushering in the next stage of language and sexuality research. ... they do not simply summarize previous work but offer fruitful research directions, most notably a greater consideration of desire. ... Both students and scholars will find this highly readable volume provocative and controversial, but never dull.' Journal of the Royal Anthropological Institute \n\nContents:\nPreface \n1 Making connections \n2 Talking sex and thinking sex: the linguistic and discursive construction of sexuality \n3 What has gender got to do with sex? Language, heterosexuality and heteronormativity \n4 Sexuality as identity: gay and lesbian language \n5 Looking beyond identity: language and desire \n6 Language and sexuality: theory, research and politics \nNotes \nBibliography \nIndex \n\nCheck my torrents for more books on language and on sexuality.","torrent":{"xt":"urn:btih:d29c39d749e5db58991165b7281a0c7b456a8b7b","amp;dn":"Language+and+Sexuality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d29c39d749e5db58991165b7281a0c7b456a8b7b","infoHashBuffer":{"type":"Buffer","data":[210,156,57,215,73,229,219,88,153,17,101,183,40,26,12,123,69,106,139,123]},"announce":[],"urlList":[]}}