{"title":"Gay Bareback Neighborhood","uid":4341516,"size":838057644,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d35935e9168df820a2ff557170bd3a8cdc72f8f0&amp;dn=Gay+Bareback+Neighborhood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"nawtynetworx","files":1,"time":1218632584,"description":"I don't know if this video is up here or not, I had a look and couldn't find it...\n\nPlease visit my website http://www.nawtytube.co.uk for free amateur porn. \n\nMy upload speed during the day is not great because my FTP software uses most of it, but I leave my pc on at night so the speed will get better. \n\nEnjoy! xx\n\nProducer: Mike Brady\nDirector: Dan Reece\nYear: 2006\nLength: 90 Minutes\nCondoms: No\n\n\nIt's a hot raw fuck fest featuring 10 sexy young studs taking over a quiet apartment complex and bringing new meaning to the term &quot;being neighborly&quot;. \n\nRyan Jamison is heading home with a 6-pack of beer when he runs into his new next door neighbor, Alan Gregory. After introducing himself, Ryan invites Alan over to join him for a drink. Of course, these boys aren't interested in sucking on a couple of long necks, they want some dick and waste no time getting down to it. Ryan may be a lean dude but he's hung huge and Alan is defiantly the boy to handle such a huge piece. He slobbers all over it, getting it nice and lubed so Ryan can slide that raw monster right up his furry blonde fuck hole. A perfect pairing of ass and meat. \n\n\nJed Pisston is enjoying a quiet moment in his apartment, watching porn and jackin' his dick. He's really getting into it when his room mate, Mark Galfione, comes home and catches him in the act. Jed tries to cover himself up at first but when Mark asks if he needs any help, Jed let's his roomie go for it. Why the hell not? Mark's a cute little fucker with a talented mouth and a very pliable hole that loves getting filled with bare cock. If he was your roommate, wouldn't you fuck him too? \n\nBuddies Parker Johnson and Ty Smith are sitting around, shooting the shit when Parker asks if Ty has seen the new neighbor. Ty jokes about how that slut Ryan has already fucked the hell out of him, which leads Parker to say &quot;I wish someone would fuck me like that&quot;. That's all the encouragement Ty needs and he soon has his bud flat on his back and he gives a nice, hard ass pounding. \n\nBald, goateed Leo Sargent is showing new roomie Diego Carrea the new apartment he's just moved into. When they get to Diego's new room he asks Leo if he comes with the room. There's only one way to find out! Diego pushes Leo back on the bed, yanks down his pants and slides his tongue right up his roomie's hole before slamming his bare meat in balls deep. After fucking that ass for a few, Diego then offers up his sweet brown hole to Leo, who shows that he can give as good as he gets. Looks like these new roommates are going to get along just fine! \n\nJacob Slater needs his heater fixed and the landlord has sent over fuckable little handyman Joey Milano to handle the job. While Joey's on all fours, working on the heater, Jacob can't help but enjoy the view. He starts stroking his meat through his jeans as Joey finishes things up. But you know Joey isn't done yet, once he sees sexy Slater stroking he drops to his knees to give him a hand. After all, he is the handyman. But this little stud doesn't just give Jacob a hand, he gives him a talented mouth and insatiable hole as well. And Jacob is only to happy to take advantage of both! \n\nAnother great bareback fuck flick from Spunk that'll have you asking &quot;Won't you be my neighbor?&quot;","torrent":{"xt":"urn:btih:d35935e9168df820a2ff557170bd3a8cdc72f8f0","amp;dn":"Gay+Bareback+Neighborhood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d35935e9168df820a2ff557170bd3a8cdc72f8f0","infoHashBuffer":{"type":"Buffer","data":[211,89,53,233,22,141,248,32,162,255,85,113,112,189,58,140,220,114,248,240]},"announce":[],"urlList":[]}}