{"title":"The Jealous Sound - A Gentle Reminder (2012) [FLAC]","uid":8942091,"size":328210484,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d3d9827d017478eef9d6c289168a475f722c1d6a&amp;dn=The+Jealous+Sound+-+A+Gentle+Reminder+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1379687327,"description":"\n  The Jealous Sound - A Gentle Reminder (2012) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Post-Grunge, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Beautiful Morning \n  02 Change You \n  03 Promise Of The West \n  04 Your Eyes Were Shining \n  05 This Is Where It Starts\n  06 Here Comes The Ride\n  07 Equilibrium \n  08 Perfect Timing \n  09 A Gentle Reminder \n  10 Waiting For Your Arrival \n\n  What happens over the course of nine years? In the case of the Jealous Sound, simultaneously a lot and a little. That's how long it's been since the band released its full-length debut, Kill Them with Kindness, winning over critics and fans alike with its passionate, powerful, and mature post-grunge melodies. Despite sharing the stage with At the Drive-In, Death Cab for Cutie, and Foo Fighters and generally being poised to make a big breakthrough, after the release of Kill Them with Kindness the band performed a great rock &amp; roll disappearing act. Singer/guitarist Blair Shehan relocated (to Las Vegas and later Florida), and by 2006 rumors circulated that the Jealous Sound had split. On the contrary, two years later the band re-emerged seemingly out of nowhere with the Got Friends EP and the opening slot on Sunny Day Real Estate's reunion tour the following year. \n\n  Enter two more years of silence and we've got the winkingly titled A Gentle Reminder, another collection of thoughtfully crafted, heartfelt songs that recall late-'90s emo bands like Jimmy Eat World, Samiam, and the Appleseed Cast. Recorded at Foo Fighters' Studio 606 by their longtime engineer John Lousteau, A Gentle Reminder raises the production values compared to the Jealous Sound's previous efforts, lending an overall crispness and more solid foundation for Shehan's powerhouse vocals and the rest of the gang (co-founding guitarist Pedro Benito, alternating bassists Nate Mendel [S.D.R.E., Foo Fighters] and Josh Staples [the New Trust, the Velvet Teen], and drummer Bob Penn) while still fitting consistently with their past works. In contrast to their other releases, however, A Gentle Reminder is a bit less upbeat and a bit more rhythmic and layered (&quot;Change You,&quot; &quot;Equilibrium&quot;), but ultimately delivers all of the ringing guitar, pulsing bass, enlightened guy lyrics, and earworm hooks that resonated with listeners in the past. Though not quite worthy of a nine-year wait, A Gentle Reminder does live up to the promise of its title, proving that the wait hasn't compromised the Jealous Sound's quality or vision and, well, reminding listeners why they were so eager for the band to return in the first place.","torrent":{"xt":"urn:btih:d3d9827d017478eef9d6c289168a475f722c1d6a","amp;dn":"The+Jealous+Sound+-+A+Gentle+Reminder+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3d9827d017478eef9d6c289168a475f722c1d6a","infoHashBuffer":{"type":"Buffer","data":[211,217,130,125,1,116,120,238,249,214,194,137,22,138,71,95,114,44,29,106]},"announce":[],"urlList":[]}}