{"title":"I-Doser - Trip - Apple Lossless","uid":4681485,"size":212775198,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d438e9927d60e4fd936458463458728dc031a2df&amp;dn=I-Doser+-+Trip+-+Apple+Lossless&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alvinacres4848","files":1,"time":1233087180,"description":"I-Doser Trip. Highest Quality. Dose converted from .drg to .wav &amp; saved in Apple Lossless format. Read or play from iTunes convert to your favorite format from there. Keep your bitrate up!\n\nIf you prefer another format let me know. (FLAC is BS, IMO)\n\nI'll do one at a time and keep the quality up. Coming from Mac. No virus.\n\n\n\nTrip\nRecreational (Very Strong)\n35 Minutes\n\nThis is a pure model recreation of a hallucinogenic experience. You will feel open-eye visual effects, lights gain auras, star-pattern effects, rainbowing around lighting, lights seem brighter and often more beautiful. You may experience feelings of time-dilation, belonging and connection, and increased emotional sensitivity. Gain a new perspective on current lifestyle and behaviors, feelings of connection with those around you, noticing things which are normally ignored or taken for granted, feelings of wonder, spirit, joy, sadness, despair, religious awakening, contentment and possibly latent psychological feelings can come out. Often referred to as our most powerful and life-altering dose, it is for this reason we DO NOT recommend it for everyone. Treat it as you would any other long trip. One of the most interesting effects is the feeling of awakening for the first time ever from a previous state of sleep, of liberation from what is now seen as a life-long state of bondage. Paradoxically, it is this new awareness, which feels normal and natural, and the previous fog, which is seen to have been unreal all along. The seeker is convinced that, once gained, this awareness is impossible to lose, but inexplicably by the next day it is just a memory. Be very careful - your life may change.","torrent":{"xt":"urn:btih:d438e9927d60e4fd936458463458728dc031a2df","amp;dn":"I-Doser+-+Trip+-+Apple+Lossless","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d438e9927d60e4fd936458463458728dc031a2df","infoHashBuffer":{"type":"Buffer","data":[212,56,233,146,125,96,228,253,147,100,88,70,52,88,114,141,192,49,162,223]},"announce":[],"urlList":[]}}