{"title":"Once Upon A Time S01E01 HDTV NL Subs DutchReleaseTeam","uid":6885390,"size":368621368,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:d477530cde2ae6c20876e5b324cc306ab67ee599&amp;dn=Once+Upon+A+Time+S01E01+HDTV+NL+Subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FijaNL","files":-1,"time":1323806753,"description":"USA\nGenre: Adventure, Drama, Fantasy\nFormaat: XviD\nTaal: Engels\nOndertitels: Vaste Nederlandse ondertiteling\n\nSeizoen 1, Aflevering 1\nEmma does not believe in Henry's stories, and she brings him back to Storybrooke, where she is captivated by an unusual boy. Concerned for the boy, she decides to stay for a while, but soon discovers that Storybrooke is more than a simple town. It's a place where magic has been forgotten, but it's still there, where fairytale characters come alive, even though if they do not remember who they once were, and the Evil Queen, is now Henry's foster mother. An epic battle is beginning, and for the good side to win, Emma will have to accept her destiny and fight for it.\n\n\nSerie Informatie:\nEmma Swan knows how to take care of herself. She's a 28-year-old bail bonds collector who's been on her own ever since she was abandoned as a baby. But when the son she gave up years ago finds her, everything will change. Henry is 10 years old now and in desperate need of Emma's help. Henry believes that Emma actually comes from an alternate world ... and is Prince Charming and Snow White's missing daughter. According to his book of fairytales, they sent her away to protect her from the Evil Queen's curse, which trapped the fairytale world forever, frozen in time. Of course Emma doesn't believe a word, but when she brings Henry back to Storybrooke, she finds herself drawn to this unusual boy and his strange New England town. Concerned for Henry, she decides to stay for a while, but she soon suspects that Storybrooke is more than it seems. It's a place where magic has been forgotten, but is still powerfully close ... where fairytale characters are alive, even though they don't remember who they once were - including the Evil Queen who is now Henry's foster mother. The epic battle for the future of all worlds is beginning, but for good to win, Emma will have to accept her destiny and fight like hell. Brace yourself for a modern fable with thrilling twists and hints of darkness.\n\n\nDeze upload wordt u aangeboden door het DutchReleaseTeam\nvoor de reviews van de nieuwste films, muziek, series , games etc\nga dan eens naar http://www.hetmultimediacafe.nl\n","torrent":{"xt":"urn:btih:d477530cde2ae6c20876e5b324cc306ab67ee599","amp;dn":"Once+Upon+A+Time+S01E01+HDTV+NL+Subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d477530cde2ae6c20876e5b324cc306ab67ee599","infoHashBuffer":{"type":"Buffer","data":[212,119,83,12,222,42,230,194,8,118,229,179,36,204,48,106,182,126,229,153]},"announce":[],"urlList":[]}}