{"title":"Synergy in Supramolecular Chemistry(pdf){Zzzz","uid":11705101,"size":52370764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4a9ec4e0f60cecfbf8964fb63e436c97432908b&amp;dn=Synergy+in+Supramolecular+Chemistry%28pdf%29%7BZzzz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1424097992,"description":"Cooperative and synergistic chemical events have attracted significant attention from many researchers engaged in organic chemistry, inorganic chemistry, biological chemistry, polymer chemistry, medicinal chemistry, and other related materials sciences. Synergistic supramolecular systems could be developed to amplify the functions and integration of molecular devices in ways that cannot be achieved by conventional single molecules. This book introduces basic concepts and examples of supramolecular chemistry in terms of cooperation and synergy, and it surveys recent progress in this field.\n\nPublisher: CRC Press (December 30, 2014)\nLanguage: English\nISBN-10: 1466595027\nISBN-13: 978-1466595026\n\nEditorial Reviews\nAbout the Author\n\nTatsuya Nabeshima was born in 1955 in Kumamoto, Japan. He received his B.S. (1979) from The University of Tokyo, M.S. (1981) from the University of Tsukuba, and Ph. D. degrees (1985) from Kyoto University. In 1985, he joined Stanford University as a postdoctoral fellow. After joining the University of Tsukuba as a research associate in 1986, he became Assistant Professor in 1987. He moved to Gunma University as an assistant professor in 1989 and was promoted to Associate Professor in 1991. He returned to the University of Tsukuba as an associate professor in 1995, and was promoted to Professor in 1999. In 2004 he was a Professor of the Graduate School of Pure and Applied Sciences, University of Tsukuba, and from 2010 to 2012 he was Director of Tsukuba Research Center for Interdisciplinary Materials Science (TIMS), University of Tsukuba. His research interests cover artificial receptors, molecular recognition, artificial allosteric and responding molecular systems, and organic-inorganic supramolecular systems. He received The Chemical Society of Japan Award for Creative Work in 2008","torrent":{"xt":"urn:btih:d4a9ec4e0f60cecfbf8964fb63e436c97432908b","amp;dn":"Synergy+in+Supramolecular+Chemistry%28pdf%29%7BZzzz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4a9ec4e0f60cecfbf8964fb63e436c97432908b","infoHashBuffer":{"type":"Buffer","data":[212,169,236,78,15,96,206,207,191,137,100,251,99,228,54,201,116,50,144,139]},"announce":[],"urlList":[]}}