{"title":"Baxter - Baxter [1998]","uid":9497865,"size":287175687,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d57fe9f789bb534ac185a891918b253f8152f273&amp;dn=Baxter+-+Baxter+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1390155525,"description":"Review by Rick Anderson\nThe Swedish group Baxter is one of the small (but growing) number of bands who are successfully integrating the tense, hyperkinetic rattle and roar of drum'n'bass with pop song structures. And on the evidence of its self-titled debut, Baxter is doing it better than most. Baxter features minimalist but thoroughly attractive melodies that hover uneasily over dark, brooding drum loops and sketchy samples; it's sort of like a pop-techno-illbient fusion, only much more emotionally involving, what with Nina Ramsby's warm voice and lyrics like &quot;I need a friend/I need you.&quot; That's pretty naked writing for this genre, and it contrasts nicely with the chilly electronic accompaniment. Ramsby's voice is always the focal point of the group's sound, which means that the rhythmic intricacies of the accompaniment can sneak up and surprise you, and often do. It's difficult to pick out highlights here, since the formula is quite similar throughout -- &quot;Television&quot; and &quot;Possible&quot; are both particularly well-realized. &quot;Love Again&quot; has a nice little trumpet obligato and slides subtly into a one-drop rhythm on the verse. Very nice. (4/5)","torrent":{"xt":"urn:btih:d57fe9f789bb534ac185a891918b253f8152f273","amp;dn":"Baxter+-+Baxter+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d57fe9f789bb534ac185a891918b253f8152f273","infoHashBuffer":{"type":"Buffer","data":[213,127,233,247,137,187,83,74,193,133,168,145,145,139,37,63,129,82,242,115]},"announce":[],"urlList":[]}}