{"title":"Wiggles - Sing a song of wiggles","uid":4505608,"size":400063866,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d5d20f429917890ed0238127bdcaab5905c048c8&amp;dn=Wiggles+-+Sing+a+song+of+wiggles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mihiratheace","files":-1,"time":1226586069,"description":"VIDEO:  [XVID]  720x416\nAUDIO: [MP3]  128.0 kbit\n\n\nTHE WIGGLES - SING A SONG OF WIGGLES\n\nWarner Home Video / Region 1 / Released 7 October 2008\n\nFeaturing Murray Cook, Jeff Fatt, Anthony Field, Sam Moran\n\nWith three quarters of the Wiggles now in their fifties, are the pre-school fab four finally showing their age - not a bit of it, in fact new boy Sam has acted as a great revitaliser for the rest of the quartet, new release Sing A Song of Wiggles (the second to feature yellow Wiggle Sam, the replacement for Greg who was forced to retire through ill health) is another collection of nursery rhymes and traditional songs given a Wiggles make-over.\n\nOne of the great things about having a fanbase of underfives as your core audience is that once your origanal audience grows out of you then very quickly another set comes along to be enamoured and of course given the fact that the boys recently celebrated their fifteenth anniversary they have already entertained several generation of tots. Like most Wiggles material there is actually a strong emphasis on learning too with simple counting and words based songs and sketches well to the fore and there is also a good emphasis on traditional instruments so on display here are such delights as the Bouzouki and Accordian as well as classic instruments such as the violin and cello.\n\nAlways joining in with the fun of course are the Wiggles co-stars Wags the Dogs, Dorothy the Dinosaur and Captain Feathersword whilst the songs tackled include such classics as Old MacDonald Had a Far, Mary Mary Quite Contrary, I&amp;#039;m A Little Teapot and Old Cole Cole.\n\nThe ultimate question you&amp;#039;ll be asking yourself is though - does it stand up to the repeated viewings that your preschooler is going to subject it to and the answer is yes it does and yes you will find yourself singing along!\n","torrent":{"xt":"urn:btih:d5d20f429917890ed0238127bdcaab5905c048c8","amp;dn":"Wiggles+-+Sing+a+song+of+wiggles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5d20f429917890ed0238127bdcaab5905c048c8","infoHashBuffer":{"type":"Buffer","data":[213,210,15,66,153,23,137,14,208,35,129,39,189,202,171,89,5,192,72,200]},"announce":[],"urlList":[]}}