{"title":"Why New Systems Fail {BBS}","uid":6967562,"size":2044945,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6cdb91d47ef7053cab5b67197eae37b97871f9c&amp;dn=Why+New+Systems+Fail+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1326934022,"description":"___________________________________________________________________________\n    ____                   ____                            __              \n    /   )    ,             /   )    /                    /    )            \n---/__ /---------__-------/__ /----/-----------__--------\\--------__----__-\n  /    )   /   /   )     /    )   /   /   /  /___)        \\     /___) /   )\n_/____/___/___(___/_____/____/___/___(___(__(___ _____(____/___(___ _(___(_\n                 /                                                         \n             (_ / \n___________________________________________________________________________\n\n***************************************************************************                                                         \n\nA Fortune 500 manufacturing company spent millions attempting to implement a new enterprise resource planning (ERP) system. Across the globe, a 150-employee marketing firm built and tried to implement a proprietary customer relationship management (CRM) system. For two very different companies doing two very different things, the outcomes were identical. In each case, the organization failed to activate and utilize its system as initially conceived by senior management. And these two organizations are hardly alone. On the contrary, research indicates that more than three in five new IT projects fail. Many miss their deadlines. Others exceed their initial budgets, often by ghastly amounts. Even systems activated on time and under budget often fail to produce their expected results and almost immediately experience major problems. Although the statistics are grim, there is at least some good news: these failures can be averted. Organizations often lack the necessary framework to minimize the chance of system failure before, during, and after beginning IT projects. Why New Systems Fail provides such a framework, with specific tools, tips, and insight from the perspective of a seasoned, independent consultant with more than a decade of related experience. The book examines in great detail the root causes of system failures. Detailed case studies, examples, and lessons from actual system implementations are presented in an informative, straightforward, and very readable manner. More than a theoretical or technical text, this book offers pragmatic advice for organizations both deploying new systems and maintaining existing ones.\n\n# Paperback: 351 pages\n# Publisher: Course Technology PTR; 1 edition (February 23, 2010)\n# Language: English\n# ISBN-10: 1435456440\n# ISBN-13: 978-1435456440","torrent":{"xt":"urn:btih:d6cdb91d47ef7053cab5b67197eae37b97871f9c","amp;dn":"Why+New+Systems+Fail+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6cdb91d47ef7053cab5b67197eae37b97871f9c","infoHashBuffer":{"type":"Buffer","data":[214,205,185,29,71,239,112,83,202,181,182,113,151,234,227,123,151,135,31,156]},"announce":[],"urlList":[]}}