{"title":"FSX Lionheart Creations Piper Pacer","uid":7939344,"size":279372658,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d761d309e1dcee614735ea5cdc74cab48722e920&amp;dn=FSX+Lionheart+Creations+Piper+Pacer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hydrah","files":1,"time":1355943731,"description":"New from the studios of Lionheart Creations Ltd. is the Piper Pacer 180, a very elegant aircraft born in the 1950's. This package includes an 'Era' theme Owners Manual in PDF format.\n\nThis package is for Prepar3D and Flight Simulator X (FSX) only.\n\nFeatures\nHigh resolution exterior 2048 textures\n33 Total Variants\n4 versions of landing gear models;\nRegular Classic Tail Dragger comes with 3 versions of main gear\n--- Early Wheel Fairings\n--- Modern Wheel Fairings\n--- No Wheel Fairings\nTri-Pacer Landing Gear comes with 2 versions of gear\n--- Modern Wheel Skirts\n--- No Wheel Fairings\nModern Bush plane features Tundra large diameter tires\nFloat Plane\n3 Versions of 'Instrument Panels'.\n--- Classic early Pacer era with disappearing radios for early versions\n--- Tri-Pacer era panel with dual panel sides\n--- Bush version modern aircraft carbon fiber addon with more modernized avionics\nDisappearing Magnetic Whiskey compass on older version panels\n'Clean Your Plexi!' cleaning system; click to rotate through 3 modes of plexi, dirty to clean\nClasssic version aircraft features vintage instrumentation\nGlass over the gauges which includes the 'Clean Your Plexi!' system\nAppear-able vintage airspeed 'horn' on lower left side (click Mic socket, bottom left on instrument panel)\nClick and hide control yokes\nOverhead dome light, and overhead instrument lights are clickable to activate lighting modes\nNight time soft glow internal illumination on instrumenation\nAwesome Krinkle black on some instrument panels; some also feature high wear chipping\nCertain Bush Plane paint schemes are well 'weathered' and feature a nice coat of mud under the wings from muddy / damp tundra landings in the wilderness. (For mud lovers, I recommend the Blue Stripe paint scheme).\nBush Plane version has high impact reinforced landing gear for rough, drop fast landings.\n\n**This aircraft package uses the Maule stock sound package in FSX and Prepar3D\n\n***Includes scenery upgrades to several airports in and around Hope Alaska, south of Anchorage as well as small lake ports, remote cabin locations in forests and on lakes, camp sites on Glaciers, and a crashed UFO site up high on a Glacier. Please activate your addon scenery by going into the FS Addon Scenery library and activating the LHC_Alaska folder to view this. See the manual for GPS locations of the various 30 sites added into the scenery.\n\nSpecial Features\n\n'Clean your Plexi!' system (Click pink plexi cleaning bottle on floor, right side of cabin to clean plexi, or click windscreen as well).\n\nVarious wheel skirts. Click 'Skirt Selector' to rotate through Old, New, and None selections.\n\nScenery in Alaska; object addons; from remote cabins, to airport improvements to fishing and boat traffic in the inlets and major lakes.\n","torrent":{"xt":"urn:btih:d761d309e1dcee614735ea5cdc74cab48722e920","amp;dn":"FSX+Lionheart+Creations+Piper+Pacer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d761d309e1dcee614735ea5cdc74cab48722e920","infoHashBuffer":{"type":"Buffer","data":[215,97,211,9,225,220,238,97,71,53,234,92,220,116,202,180,135,34,233,32]},"announce":[],"urlList":[]}}