{"title":"Handbook of Transition Metal Polymerization Catalysts","uid":12081165,"size":47817001,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d771dfca637a8e147a6fa101f2d3c416d180a6b2&amp;dn=Handbook+of+Transition+Metal+Polymerization+Catalysts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435773121,"description":"Handbook of Transition Metal Polymerization Catalysts - Ray Hoff, Robert T. Mathers (Wiley, 2010).pdf\n\nISBN 978-0-470-13798-7\n\nA one-stop resource for understanding and applying polymerization catalystsAn edited volume featuring contributions from leading researchers, the &quot;Handbook of Transition Metal Polymerization Catalysts&quot; covers the design and synthesis of catalysts, and their applications in synthesis of polymers. Dealing with those polymerization catalysts that afford commercially acceptable yields of polymer with respect to catalyst mass and promising newer catalysts, this practical reference provides polymer and organic chemists with a comprehensive overview of the known methods for developing and applying these important catalysts.\n\nWith both recent advances and historically important catalysts, the subjects covered in this text include: \nMetal alkyls and other compounds that function as co-catalysts with a large number of catalysts\nThe varieties of porous silica either necessary or valuable in certain catalyst formulations\nCatalyst scale-up and commercialization\nCopper catalysts for olefin polymerizationMorphology control\n\nAlong with the above topics, the &quot;Handbook of Transition Metal Polymerization Catalysts&quot; provides tables of valuable data to assist in reproducing a synthesis or applying the knowledge to a new problem. Polymerization reactivities, polymer properties, monomer and solvent purity requirements, molecular weights, distribution, and reactivity ratios are also covered. The &quot;Handbook of Transition Metal Polymerization Catalysts&quot; offers an excellent one-stop resource for understanding and applying polymerization catalysts","torrent":{"xt":"urn:btih:d771dfca637a8e147a6fa101f2d3c416d180a6b2","amp;dn":"Handbook+of+Transition+Metal+Polymerization+Catalysts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d771dfca637a8e147a6fa101f2d3c416d180a6b2","infoHashBuffer":{"type":"Buffer","data":[215,113,223,202,99,122,142,20,122,111,161,1,242,211,196,22,209,128,166,178]},"announce":[],"urlList":[]}}