{"title":"Jason Isbell - Southeastern [2013][ FLAC]","uid":8717074,"size":283471071,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d7edce580747cd98b3a2e1f3c11725871585a7c1&amp;dn=Jason+Isbell+-+Southeastern+%5B2013%5D%5B+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1374347215,"description":"Artist:Jason Isbell\nRelease:Southeastern\nReleased: 2013\nLabel: Relativity / Southeastern \nCatalog#: SER 9984\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: americana\n\n01. Cover Me Up 4:52\n02. Stockholm 2:49\n03. Traveling Alone 4:27\n04. Elephant 3:37\n05. Flying Over Water 3:58\n06. Different Days 3:34\n07. Live Oak 3:35\n08. Songs That She Sang In The Shower 3:56\n09. New South Wales 3:53\n10. Super 8 3:25\n11. Yvette 4:28\n12. Relatively Easy 4:45\n\nJason Isbell was one of three first-class songwriters in the Drive-By Truckers, along with Patterson Hood and Mike Cooley, and each of them had (and has) his own spin on the kind of raucous Southern soul-country that band specialized in. When Isbell left in 2007 to pursue a solo career, there was every reason to believe he would continue in the same vein. Instead, Isbell produced work that still had some Alabama country twang, but was really closer to the folky singer/songwriter side of the spectrum, full of graceful melodies with thoughtful and literate lyrics. On this outing, Isbell strips things back even more, going with, for the most part, sparse, moody arrangements and songs that muse on the responsibilities of his newfound sobriety, an atonement of sorts, and they tell of lost weekends, drinking mouthwash when the alcohol ran out, and other sordid personal tragedies, all with an eye to how it seems to work out when problems are embraced, addressed, and finally owned. As such, this is an ultimately positive set that doesn't pull punches. Highlights include the beautiful opening love song &quot;Cover Me Up,&quot; the elegant and sort of baroque country-rocker &quot;Stockholm,&quot; the blast-along &quot;Super 8&quot; (which wouldn't sound out of place on any of the Truckers albums), and the love ballad &quot;Relatively Easy,&quot; which closes things out here. The overall tone of this fine set is one of quiet and thoughtful honesty with one's life and past and the knowledge that personal redemption has to be earned again and again each and every day. It is, quite frankly, Isbell's best solo album thus far.","torrent":{"xt":"urn:btih:d7edce580747cd98b3a2e1f3c11725871585a7c1","amp;dn":"Jason+Isbell+-+Southeastern+%5B2013%5D%5B+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7edce580747cd98b3a2e1f3c11725871585a7c1","infoHashBuffer":{"type":"Buffer","data":[215,237,206,88,7,71,205,152,179,162,225,243,193,23,37,135,21,133,167,193]},"announce":[],"urlList":[]}}