{"title":"Illegal Procedure by Josh Luchs and James Dale (ePUB/Mobi)","uid":7884304,"size":3682661,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8229d9da73b1c0d9449718624621bb78f99debb&amp;dn=Illegal+Procedure+by+Josh+Luchs+and+James+Dale+%28ePUB%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"azizex666","files":-1,"time":1354576961,"description":"Illegal Procedure: A Sports Agent Comes Clean on the Dirty Business of College Football \n\n\nFor fifteen years, sports agent Josh Luchs made illegal deals with numerous college athletes, from top-tier, nationally recognized phenoms to late-round draft picks. Flagrantly flaunting NCAA and NFL Players Association rules, he made no-interest loans to players in exchange for the promise of representation on their lucrative pro contracts. After cleaning up his act in 2003, he moved to a new agency, only to be targeted and pushed out of the business for a new violation-one he arguably did not commit. Then, in October 2010, Luchs wrote a confessional article in Sports Illustrated, telling the truth about what he did and didn't do.\n\n\nSince then he has taken on a new role: whistle-blowing, truth-telling reformer. And in telling his own story, Luchs pulls back the curtain on the real economy of college football: how agents win players legally and otherwise, the staggering sums colleges make from an unpaid workforce, the shortfalls of supposed full-ride scholarships, and the myth of a college education given to scholarship jocks. Including new information about major players and scandalized programs such as USC, Auburn, and Ohio State, this book pulls no punches. It's a stunning and necessary read for anyone who loves the game, and the first step toward fixing a broken system.\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                          Published - March 27th 2012\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:d8229d9da73b1c0d9449718624621bb78f99debb","amp;dn":"Illegal+Procedure+by+Josh+Luchs+and+James+Dale+%28ePUB%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8229d9da73b1c0d9449718624621bb78f99debb","infoHashBuffer":{"type":"Buffer","data":[216,34,157,157,167,59,28,13,148,73,113,134,36,98,27,183,143,153,222,187]},"announce":[],"urlList":[]}}