{"title":"Food For Thought by Lorilyn Roberts","uid":10628876,"size":2440342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d876f42e3229f1b5e6cf057964adfa3cc8902deb&amp;dn=Food+For+Thought+by+Lorilyn+Roberts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ONLYMOBI","files":1,"time":1406285568,"description":"How do you combine Tim Tebow and Crockpot Chili or Pigs in a Blanket and JRR Tolkien? And what do these heroes of the Christian faith have in common with homeschooling, feeding the poor, or buying cows and chickens? Food for Thought: Quick and Easy Recipes for Homeschooling Families can stimulate thoughtful discussion while cooking. By creating delicious recipes to be eaten and shared with others, we bring glory to God, our Creator, to whom we give thanks in our blessings.\nHomeschooling does not have to be limited to sitting at a table poring over books-- that's BORING. As a homeschooling mother for fifteen years, I mixed things up a bit. Enjoy cooking while teaching math, philosophy, history, economics, geography, sociology, reading, and the Bible.\nFood for Thought contains a spice of variety for the young and the young at heart. Take the drudgery out of cooking and make homeschooling fun. Your kids will love you as they &quot;cook&quot; Worms in Dirt or stir up Crazy Cupcakes. Food for Thought: Quick and Easy Recipes for Homeschooling Families contains delicious recipes, famous quotes, and homeschooling activities that will create warm memories for YOU AND YOUR FAMILY for years to come.","torrent":{"xt":"urn:btih:d876f42e3229f1b5e6cf057964adfa3cc8902deb","amp;dn":"Food+For+Thought+by+Lorilyn+Roberts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d876f42e3229f1b5e6cf057964adfa3cc8902deb","infoHashBuffer":{"type":"Buffer","data":[216,118,244,46,50,41,241,181,230,207,5,121,100,173,250,60,200,144,45,235]},"announce":[],"urlList":[]}}