{"title":"Philips HDTV wirelessconnect WIN PC v1.6.44 &amp; Mac OS X v1.19","uid":9903890,"size":13898401,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d957b9bb0d3e7588bfb17efc5153793f6a14255a&amp;dn=Philips+HDTV+wirelessconnect+WIN+PC+v1.6.44+%26amp%3B+Mac+OS+X+v1.19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maseta","files":1,"time":1396813245,"description":"ver: win-XP-7-8.0-8.1 v1.6.44 &amp; mac OS X v1.19\n\nDo you have one of the Philips HDTV and it's connected to Wifi and\nYoutube works but you want to watch a movie that, of course, YT\nwont allow since it's personal or private.\n\nWith this app you can show your entire desktop on a compatible\nPhilips HDTV.  The HDTV needs to at least have a wireless or wired(best quality and performance) connection.  No internet required to project desktop from laptop to HDTV.  Minimum of a wireless router or corporate router &amp; wireless AP.  Some HDTVs CANT do a directconnect to your laptop.\n\nThis copy already has unlimited installs.\n\nIn Full 1080P HD mode: slow Lag time of up to a minute is normal on cheap equipment. I have only slow 5 sec on my corporate equipment.\n\n  Your experience may vary, if you have the cheap end or old wifi tech then lower the bitrate. If the audio is not in sync with your movie lower the resolution.  Even Cisco/Lynksys has to sell crap to break even.  You get what you pay for, a $50 network setup will crap out compared to a $800 setup with corporate tiered router and AP.\n\nLong story short, the app works great, even inside a virtual machine.\n\n\nIf your HDTV redirects you to: http://www.philips.com/e/wirelessconnect/\n\nthen it's compatible but every download from Philips counts against your 10 maximum downloads when it asks for your HDTV media code.\n\nGreat to try before you buy or if you lost your own copy.\n\nI'm using a biglist blocklist in Transmission. If you have trouble downloading then makeshure your not on any blocklist.","torrent":{"xt":"urn:btih:d957b9bb0d3e7588bfb17efc5153793f6a14255a","amp;dn":"Philips+HDTV+wirelessconnect+WIN+PC+v1.6.44+%26amp%3B+Mac+OS+X+v1.19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d957b9bb0d3e7588bfb17efc5153793f6a14255a","infoHashBuffer":{"type":"Buffer","data":[217,87,185,187,13,62,117,136,191,177,126,252,81,83,121,63,106,20,37,90]},"announce":[],"urlList":[]}}