{"title":"Master Topology Files for iXtreme LT+3.0","uid":6911249,"size":61287,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:da312b4573517ffbf4adb571a52383abe6de74f4&amp;dn=Master+Topology+Files+for+iXtreme+LT%2B3.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"boobsman","files":14,"time":1324824428,"description":"[IMG]http://www.freeimage.us/image-37A9_4EF6F4E1.jpg[/IMG]\n\nMaster Topology Files for iXtreme LT+3.0\n\nAfter an exhaustive development process we are pleased to release these disc \nprofile topology patches for the iXtreme LT+ v3.0 firmware. \n\nThese patches are based on millions of angle measurements spanning hundreds of \nhours to get the most accurate values possible. \n\n\nThere are currently two patches available: \n\n\n1) \nXGD2.COD-BO.COD-MW2.Halo-Reach.top.data.v1.bin \n\nSUITABLE FOR THE FOLLOWING GAMES ONLY: \n\na) Call of Duty: Black Ops \n\nb) Call of Duty: Modern Warfare 2 \n\nc) Halo: Reach (XGD2 ONLY, don't use this on backups of the XGD3 beta) \n\nThese games have the exact same topology and therefore can share the same \nprofile data. This was confirmed by doing at least 35 iterations of profile \ndata for each game and analyzing the results. Over millions of measurements, \nnot a single one deviated from the median by more than 1 degree, and there \nwere no cumulative effects at all. These games are identical in the way they \nwere mastered. \n\n2) \nXGD3.Profile.ID.F87A804E.top.data.v1.bin \n\nSuitable for all XGD3 games with this disc profile ID: \n\n0C3DF524599094E6CB87ECC8-F87A804E \n\nThis covers all current XGD3 releases (at the time of writing) except for \nthe Halo: Reach XGD3 beta. \n\nCheckand stay up to date with the latest news on the usual \nsites so you don't end up patching and burning the wrong data if a new XGD3 \ngame comes out with a different disc profile ID (there are several more \nalready waiting in dae.bin). \n\n\n\nMedia ID shouldn't matter since we always check our data against all foreign \nversions of games in DAE.bin using the targets from the v12 table and several \nunique per-Xbox v8 tables. Again, stay up to date with the latest news in case \nthis situation changes. \n\nP.S. You may be thinking that it's better to use topology data taken from a \nspecific title or pressing... and that may be true... but only if you do a \nmultitude of iterations and take the average values. You would most likely \nend up with extremely similar data to ours (if your drive and disc are OK), \nwith only very small deviations where measurements were right in between two \nintegers, and could effectively go either way. \n\nWe certainly don't want to discourage people from doing their own measurements, \nbut please be aware that it is very easy for some drives to screw up an angle \nmeasurement, and even small screw ups or a general bias in timing can have a \ngreat impact on LT+ responses. \n\nP.P.S We've included an example of how we process our multitudes of iterations \nin case you think this is all a bunch of BS. It's a massive html file so be \ncareful if you don't think your system or browser can handle it. \n\n[img]http://www.freeimage.us/image-5ECA_4D9E15E0.gif[/img]\n\n[img]http://torrent-stats.info/b571/1305487b3.png[/img]","torrent":{"xt":"urn:btih:da312b4573517ffbf4adb571a52383abe6de74f4","amp;dn":"Master+Topology+Files+for+iXtreme+LT%2B3.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da312b4573517ffbf4adb571a52383abe6de74f4","infoHashBuffer":{"type":"Buffer","data":[218,49,43,69,115,81,127,251,244,173,181,113,165,35,131,171,230,222,116,244]},"announce":[],"urlList":[]}}