{"title":"The Alan Parsons Project - Alan Parsons Songbook [1993]  FLAC","uid":6622729,"size":427328141,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:da73deeea447d2d25104396ee734f80ac2258ea6&amp;dn=The+Alan+Parsons+Project+-+Alan+Parsons+Songbook+%5B1993%5D++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"keeybee","files":29,"time":1314056212,"description":"Please seed!\n\nThe Alan Parsons Project was a British progressive rock band, active between 1975 and 1990, consisting of Eric Woolfson and Alan Parsons surrounded by a varying number of session musicians. Behind the revolving lineup and the regular sidemen, the true core of the Project was the duo of Parsons and Woolfson.\nWoolfson was a lawyer by profession, but also a composer and pianist. Parsons was a successful producer and accomplished engineer. Almost all songs on the band's albums are credited to &quot;Woolfson/Parsons&quot;. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Alan_Parsons_Project#Discography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Alan_Parsons_Project#Discography&lt;/a&gt;\n\nThere's no info on this release on AMG.\nHowever you can find futher info here: &lt;a href=&quot;\nhttp://www.roadkill.com/cgi-ajy/enc.cgi?album=Alan+Parsons+Songbook,+The&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.roadkill.com/cgi-ajy/enc.cgi?album=Alan+Parsons+Songbook,+The&lt;/a&gt;\n\n\nThe Alan Parsons Project - Alan Parsons Songbook\nThis compilation 1993 \nLabel, Arcade\n\n01  The Alan Parsons Project - Alan Parsons Songbook - Don't Answer Me \n02  The Alan Parsons Project - Alan Parsons Songbook - Old &amp; Wise \n03  The Alan Parsons Project - Alan Parsons Songbook - Eye In The Sky \n04  The Alan Parsons Project - Alan Parsons Songbook - Time \n05  The Alan Parsons Project - Alan Parsons Songbook - Mamma Gamma \n06  The Alan Parsons Project - Alan Parsons Songbook - Prime Time \n07  The Alan Parsons Project - Alan Parsons Songbook - I Wouldn't Want To Be Like You \n08  The Alan Parsons Project - Alan Parsons Songbook - Let's Talk About Me \n09  The Alan Parsons Project - Alan Parsons Songbook - The Golden Bug \n10  The Alan Parsons Project - Alan Parsons Songbook - Psychobabble \n11  The Alan Parsons Project - Alan Parsons Songbook - The Turn Of A Friendly Card \n12  The Alan Parsons Project - Alan Parsons Songbook - Snake Eyes \n13  The Alan Parsons Project - Alan Parsons Songbook - Lucifer \n14  The Alan Parsons Project - Alan Parsons Songbook - Days Are Numbers \n15  The Alan Parsons Project - Alan Parsons Songbook - The Raven \n16  The Alan Parsons Project - Alan Parsons Songbook - Pipeline \n17  The Alan Parsons Project - Alan Parsons Songbook - What Goes Up \n18  The Alan Parsons Project - Alan Parsons Songbook - I Robot \n19  The Alan Parsons Project - Alan Parsons Songbook - Genesis CH.1 V. 32 \n","torrent":{"xt":"urn:btih:da73deeea447d2d25104396ee734f80ac2258ea6","amp;dn":"The+Alan+Parsons+Project+-+Alan+Parsons+Songbook+%5B1993%5D++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da73deeea447d2d25104396ee734f80ac2258ea6","infoHashBuffer":{"type":"Buffer","data":[218,115,222,238,164,71,210,210,81,4,57,110,231,52,248,10,194,37,142,166]},"announce":[],"urlList":[]}}