{"title":"El Mentalista 1x01 HDTV DVB Spanish","uid":4633102,"size":356962465,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dbfb2476a41d26b2afeaeecca77469e16c4ea940&amp;dn=El+Mentalista+1x01+HDTV+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":4,"time":1231457851,"description":"Simon Baker (El guardiÃƒÂ¡n) da vida a Patrick Jane, un psÃƒÂ­quico muy conocido por sus populares apariciones en televisiÃƒÂ³n quien, despuÃƒÂ©s de ser descubierto como un verdadero fraude, decide empezar a ayudar a la Oficina de InvestigaciÃƒÂ³n de California a resolver los crÃƒÂ­menes que se les presenta, ya que como mentalista, Patrick puede usar sus extremadamente desarrolladas habilidades para la observaciÃƒÂ³n, la deducciÃƒÂ³n y la manipulaciÃƒÂ³n para conseguir echar una mano a esta unidad criminal.\nEs carismÃƒÂ¡tico y le gusta considerarse como un moderno Sherlock Holmes cuyos controvertidos mÃƒÂ©todos a menudo cruzan la lÃƒÂ­nea, pero que siempre se revelan como los adecuados para su trabajo. Dentro de la Oficina de InvestigaciÃƒÂ³n de California (CBI) trabaja como asesor independiente y en los ÃƒÂºltimos tiempos ha logrado acumular un destacable rÃƒÂ©cord de casos solucionados, gracias a sus dotes para la observaciÃƒÂ³n. Su habilidad para leer a la gente, al igual que a todos los que les rodean, ha convertido a Patrick en un valor incalculable para el departamento de policÃƒÂ­a de California, aunque sus propios compaÃƒÂ±eros se nieguen a creer a menudo que las respuestas a crÃƒÂ­menes tan complicados estÃƒÂ©n a la vista de forma tan fÃƒÂ¡cil.\nPero a pesar de tener la increÃƒÂ­ble habilidad de conseguir solucionar los casos mÃƒÂ¡s complicados, Patrick es conocido en el cuerpo por su falta de disciplina, ya que raramente actÃƒÂºa segÃƒÂºn las normas y opta por romper constantemente el protocolo marcado, lo que le enfrenta frecuentemente con sus superiores. Y para empeorar aÃƒÂºn mÃƒÂ¡s las cosas, Patrick suele intentar mantener su reputaciÃƒÂ³n como mentalista al tiempo que se esfuerza por ganar un poco mÃƒÂ¡s de la notoriedad que perdiÃƒÂ³ en los ÃƒÂºltimos aÃƒÂ±os, despuÃƒÂ©s de reconocer pÃƒÂºblicamente que simulÃƒÂ³ tener habilidades paranormales.","torrent":{"xt":"urn:btih:dbfb2476a41d26b2afeaeecca77469e16c4ea940","amp;dn":"El+Mentalista+1x01+HDTV+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbfb2476a41d26b2afeaeecca77469e16c4ea940","infoHashBuffer":{"type":"Buffer","data":[219,251,36,118,164,29,38,178,175,234,238,204,167,116,105,225,108,78,169,64]},"announce":[],"urlList":[]}}