{"title":"Step On A Crack by James Patterson","uid":8738062,"size":43854,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc1f53da12274a84e11388a1722bd7b94fef7bca&amp;dn=Step+On+A+Crack+by+James+Patterson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OrajelJunkie","files":-1,"time":1374718361,"description":"THE FIRST BOOK IN JAMES PATTERSON'S #1 BESTSELLING MICHAEL BENNETT SERIES!\n\nDuring a state funeral for a beloved former First Lady in New York City's largest cathedral, the unthinkable occurs. Armed men disguised as monks seize the church and seal themselves inside, along with more than one hundred of the most powerful people in America. The captives include world leaders, actors, TV stars, athletes, and politicians, and the kidnappers are armed with enough C4 explosives to blow a crater in the middle of Manhattan. \nNYPD officer Michael Bennett is pulled into the standoff as lead negotiator. Despite the escalating danger, Michael faces an even more terrifying crisis at home. His wife has been diagnosed with a devastating disease, and Michael faces the prospect of losing the love of his life and having to raise their ten children alone. With his own life teetering and the lives of thousands suddenly his responsibility, Michael struggles to diffuse the tense situation fast. Yet the kidnappers' moves are impossible to predict, and they block every attempt to break into the cathedralmost as if they are privy to their deliberations.","torrent":{"xt":"urn:btih:dc1f53da12274a84e11388a1722bd7b94fef7bca","amp;dn":"Step+On+A+Crack+by+James+Patterson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc1f53da12274a84e11388a1722bd7b94fef7bca","infoHashBuffer":{"type":"Buffer","data":[220,31,83,218,18,39,74,132,225,19,136,161,114,43,215,185,79,239,123,202]},"announce":[],"urlList":[]}}