{"title":"Building with Logs - B. Allan Mackie","uid":4774667,"size":7334722,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dce65ac668c917ecc8bac8024a9f0869e76a25a9&amp;dn=Building+with+Logs+-+B.+Allan+Mackie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philmccrevice","files":1,"time":1237167547,"description":"This classic is still considered the best book ever written on making a full sized log home. , is filled with numerous major construction improvements, and clearly shows the novice and experienced log builder how to select logs, plan both the site and financing, and then build a handsome log structure from the foundation to the ridge cap. \n\nThe concept of modern log building was born 25 years ago with the first edition of Building with Logs. All who loved log homes could, for the first time, learn how to build one. With over 100,000 copies sold, this book inspired thousands of owner-built homes. \n\nBuilding with Logs covers: financing, the site, planning a good home, acquisition of logs, how to fall a tree and trim it, storage of logs, safety, foundations and basements, first logs and floor joists, hewing and the broad axe, cutting a round notch, sealing between the logs, setting allowance, gable ends, electrical wiring, finishing touches and much more. \n\nThe author has continued to teach, design and build. His schools have trained thousands of good craftsmen, some of whom formed companies to build internationally, with the result that the world-wide standard for excellence in log building is now a &quot;Mackie&quot; log house. \n\n","torrent":{"xt":"urn:btih:dce65ac668c917ecc8bac8024a9f0869e76a25a9","amp;dn":"Building+with+Logs+-+B.+Allan+Mackie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dce65ac668c917ecc8bac8024a9f0869e76a25a9","infoHashBuffer":{"type":"Buffer","data":[220,230,90,198,104,201,23,236,200,186,200,2,74,159,8,105,231,106,37,169]},"announce":[],"urlList":[]}}