{"title":"Aldo Nova - Aldo Nova (1991)","uid":4188171,"size":50761947,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dcf6a37297e72867a0142e99f28c62d5365ed397&amp;dn=Aldo+Nova+-+Aldo+Nova+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alexjul64","files":11,"time":1210793768,"description":"Aldo Nova&amp;#039;s 1982 self-titled debut is a blueprint for the pop metal, or sometimes deridely called hair metal, music that would become tremendously popular throughout the 80&amp;#039;s. The album is built around double tracked guitar riffs, sledgehammer drums and crisp melodies. The songs are either rocking anthems or power ballads. Mr. Nova spent three years as George Harrison in a Canadian version of Beatlemania, so he brought a strong sense of melody to the power chords. The album&amp;#039;s open track and first single is the superb &quot;Fantasy&quot;. The song opens to the sounds of helicopters and then kicks in with a searing guitar riff. The lyrics are pure 80&amp;#039;s hedonism with talk of street girls and white powder. Mr. Nova was also one of the first artists to embrace MTV and his video for the song is a classic and peaked at number 23 on the charts. &quot;Ball &amp; Chain&quot; and &quot;You&amp;#039;re My Love&quot; are strong power ballads. &quot;Foolin&amp;#039; Yourself&quot; has a strong pop sound and was a small hit peaking at 65. &quot;Heart To Heart&quot; &amp; &quot;See The Light&quot; heavily incorporate synthesizers into the mix. The album had a strong influence on Bon Jovi (whose cousin engineered the album) and he practically copies the album&amp;#039;s format on his first few releases (Mr. Nova plays guitar on Bon Jovi&amp;#039;s first hit &quot;Runaway&quot;). The album peaked at number 8 in early 1982, but Mr. Nova would never again crack the top 50 on the charts. He would later go on to big success as a songwriter and producer mostly notable for fellow French-Canadian Celine Dion for which he would win a Grammy for his production. This is a superb remastering of the album. The sound is a marked improvement over the original CD release which contained alot of hiss. Their is one bonus track, a demo version of the album&amp;#039;s second single, &quot;Foolin&amp;#039; Yourself&quot;, but the overall sound improvement is reason enough to buy the album. ","torrent":{"xt":"urn:btih:dcf6a37297e72867a0142e99f28c62d5365ed397","amp;dn":"Aldo+Nova+-+Aldo+Nova+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcf6a37297e72867a0142e99f28c62d5365ed397","infoHashBuffer":{"type":"Buffer","data":[220,246,163,114,151,231,40,103,160,20,46,153,242,140,98,213,54,94,211,151]},"announce":[],"urlList":[]}}