{"title":"VA - Golden Age of Country (Time Life 10 Disc 158 Hits Collectio","uid":7359503,"size":397619357,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dd5ea365246b08bd2b13e682a6d58c396e2d42b4&amp;dn=VA+-+Golden+Age+of+Country+%28Time+Life+10+Disc+158+Hits+Collectio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"CoNrIsSiO","files":168,"time":1339903491,"description":"Time Life proudly presents Golden Age of Country the most comprehensive collection devoted to the country music of the '50s and '60s. This collection brings together the most influential country &amp; western artists of the decades that truly represented the &quot;golden age&quot; in country music history. You'll get 158 hits from country legends like Johnny Cash, Patsy Cline, George Jones, Kitty Wells and more! Plus, get a special bonus volume, 2 CDs of &quot;hard to find hits.&quot; These songs were popular in their time but rarely anthologized, a true find for any classic country fan! ABOUT THIS ERA: Early country music originated in the Appalachian mountains in the 1930's and was primarily acoustic, orchestrated with banjos and fiddles. The genre moved into the &quot;golden age&quot; as then-called &quot;mountain music&quot; moved out of the mountains and into the mainstream, popularized by institutions such as the Grand Ole Opry. Traditional country music of the golden age blended the sound of mountain music with new instrumentation, such as the pedal steel guitar. Johnny Cash, Porter Wagoner and Loretta Lynn were all artists that epitomized this era. The golden age of country music continued into the late 1960's, it's longevity attributed to the explosion of the &quot;Nashville sound&quot; in country music. Here, traditional country artists were combining honky-tonk lyrics with big-band orchestration, backed by strings and horns. Artists like Patsy Cline, Ray Price, Eddy Arnold and George Jones were best known for this type of sound. Much of the success of the crossover country music of today can be attributed to the golden age of this era, where artists first experimented with merging traditional sounds with popular music trends of the time to generate a wider appeal. ","torrent":{"xt":"urn:btih:dd5ea365246b08bd2b13e682a6d58c396e2d42b4","amp;dn":"VA+-+Golden+Age+of+Country+%28Time+Life+10+Disc+158+Hits+Collectio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd5ea365246b08bd2b13e682a6d58c396e2d42b4","infoHashBuffer":{"type":"Buffer","data":[221,94,163,101,36,107,8,189,43,19,230,130,166,213,140,57,110,45,66,180]},"announce":[],"urlList":[]}}