{"title":"Democracy Now - 23 nov 2011","uid":6838029,"size":452056868,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ddd4c2a2d94f0a9ba0fc6def8fc622c10dafbf78&amp;dn=Democracy+Now+-+23+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1322074025,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 23, 2011\n\n-  Egyptian Protesters Reject Military's Refusal to Cede Power\n-  Yemeni President to Step Down in Return for Immunity\n-  Clashes in Bahrain Ahead of Release of Crackdown Probe\n-  Occupy Protesters Heckle Obama in New Hampshire\n-  Oregon Governor Halts &quot;Morally Wrong&quot; Death Penalty\n-  Justice Dept. Challenges Utah Anti-Immigrant Law\n-  Gingrich: GOP Immigration Policies Shouldn't &quot;Destroy Families&quot;\n-  Occupy, South Korean Activists Protest Trade Deal\n-  ICC Backs Trial for Gaddafi Son in Libya\n-  U.N. Human Rights Council Condemns Syrian Crackdown\n-  South Africans Protest &quot;State Secrets&quot; Law\n\n\nSpecial reports\n\n- Egypt Protesters Defy Mounting Crackdown As Military Refuses to Step Down\n\nEgyptian protesters continue to fill Cairo's central Tahrir Square over the ruling military council's refusal to immediately transfer power to a civilian government. In a televised address on Tuesday, the head of Egypt's military council, Field Marshal Mohamed Hussein Tantawi, said he has accepted the prime minister's resignation and that the military is ready to relinquish power if Egyptians call for that in a referendum. But protests only intensified after Tantawi's speech and security forces unleashed a barrage of tear gas. Over the past five days at least 38 people have been killed, thousands injured, and at least 15 journalists attacked as Egypt has witnessed the largest protests since the fall of Hosni Mubarak. Kouddous has been on the ground reporting from in Egypt since the revolution began in January. &quot;[Tantawi] essentially offered some minor concessions that were not demanded by any of the protesters in Tahrir,&quot; says Democracy Now! correspondent Sharif Abdel Kouddous reporting from Cairo. &quot;Many compared the speech to Mubarak's second speech on February 1st where he made some kinds of concessions and used this kind of the tone in the hope of ending the revolution. But the response then and the response now were very similar. ... But the response then and the response now were very similar. Tahrir yesterday was packed with people, really a massive, massive protest. And after the speech ended, you heard this huge reverberation from the crowd, this huge echo of Irhal, which means &quot;leave&quot;.\n\n\n- Sonia Jacobs and Peter Pringle on Their Journey From Death Row to the Wedding Altar\n\nSonia Jacobs and Peter Pringle each served years on death row - Jacobs here in the United States and Pringle in Ireland. Both were exonerated after their convictions were overturned for murders that they steadfastly maintained they did not commit. They began dating shortly after meeting while both publicly campaigning against the death penalty. Their wedding earlier this month was perhaps the first of its kind - the union of two exonerated death row inmates. Joining us from their home in Ireland, Sunny Jacobs and Peter Pringle recount their remarkable story from death row to the wedding altar.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:ddd4c2a2d94f0a9ba0fc6def8fc622c10dafbf78","amp;dn":"Democracy+Now+-+23+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddd4c2a2d94f0a9ba0fc6def8fc622c10dafbf78","infoHashBuffer":{"type":"Buffer","data":[221,212,194,162,217,79,10,155,160,252,109,239,143,198,34,193,13,175,191,120]},"announce":[],"urlList":[]}}