{"title":"Titanic(multi Subs)(2Lions-Team)","uid":5366026,"size":4683071109,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:de7945d25b63acd7c64ddaf5b8b22a6c1050fa49&amp;dn=Titanic%28multi+Subs%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUULTJE","files":-1,"time":1266263890,"description":"Titanic (1997) \n\nVerenigde Staten\nDrama / Romantiek\n194 minuten\n\ngeregisseerd door James Cameron\nmet Leonardo DiCaprio, Kate Winslet en Billy Zane\n\nDe 17-jarige rijke Rose DeWitt Bukater wordt door haar familie gedwongen om zich met Cal Hockley te verloven en binnenkort te gaan trouwen. Tijdens de eerste tocht over de Atlantische zee van de Titanic, een gigantisch passagiersschip dat onzinkbaar wordt geacht, besluit ze zelfmoord te plegen. Ze wordt echter gered door Jack Dawson, een derde klasse-passagier. Ondanks hun totaal verschillende afkomst worden ze vrienden en al snel groeit de liefde tussen hen allebei.\n\nEngels\n\nAfter winning a trip on the RMS Titanic during a dockside card game, American Jack Dawson spots the society girl Rose DeWitt Bukater who is on her way to Philadelphia to marry her rich snob fiancÃƒÂ© Cal Hockley. Rose feels helplessly trapped by her situation and makes her way to the aft deck and thinks of suicide until she is rescued by Jack. Cal is therefore obliged to invite Jack to dine at their first-class table where he suffers through the slights of his snobbish hosts. In return, he spirits Rose off to third class for an evening of dancing, giving her the time of her life. Deciding to forsake her intended future all together, Rose asks Jack, who has made his living making sketches on the streets of Paris, to draw her in the nude wearing the invaluable blue diamond Cal has given her. Cal finds out and has Jack locked away. Soon after wards, the ship hits an iceberg and Rose must find Jack while both must run from Cal even as the ship sinks deeper into the freezing water.\n\n\nWeblink http://www.moviemeter.nl/film/316\nWeblink http://www.imdb.com/title/tt0120338/\n\nOriginele   Bioscooptrailer ... Winnaar van 11 Oscars Waaronder de beste Film\nVideo                : DVD Rip\nAudio                : Engels\nSubs                 : Nederlands Noors Deens Fins Portugees Hebreeuws Pools Tjechisch Hongaars IJslands Grieks \n                     : Engels voor slechthorenden\nID                   : 0xE0\nFormat               : MPEG Video\nFormat version       : Version 2\nBit rate mode        : Variable\nWidth                : 720 pixels\nHeight               : 576 pixels\nDisplay aspect ratio : 4:3\nFrame rate           : 25.000 fps\nStandard             : PAL\nCover                : Yes\nMenu                 : Yes\n\n\n***************************************** \n\nBrought to you by Juultje\n\n\n2Lions Team \n\n          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n \n\n\n","torrent":{"xt":"urn:btih:de7945d25b63acd7c64ddaf5b8b22a6c1050fa49","amp;dn":"Titanic%28multi+Subs%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de7945d25b63acd7c64ddaf5b8b22a6c1050fa49","infoHashBuffer":{"type":"Buffer","data":[222,121,69,210,91,99,172,215,198,77,218,245,184,178,42,108,16,80,250,73]},"announce":[],"urlList":[]}}