{"title":"The Mary Onettes - Self-titled","uid":4087817,"size":63927011,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:de8b2dde1ad9cfc39986df152f09c41bc36604fd&amp;dn=The+Mary+Onettes+-+Self-titled&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"80zforever","files":10,"time":1205913125,"description":"The Mary Onettes - The Mary Onettes\n\n\nBy now people downloading my torrents are aware I am kind of lost in the 80s but it does not mean I don't listen to new materials, though I gotta admit I get disappointed most of the times. This was not the case with The Mary Onettes, all the way from Jonkoping, Sweden. I was so thrilled when I first listened to the CD after a friend recommended it. Actually whenever you hear these guys for the first time, more likely than not, you would guess the band to be British. Certainly while I listened to The Mary Onettes I couldn?t help to think of bands like Echo &amp; The Bunnymen, New Order, and the Cure. \n\nThe Mary Onettes sure did pick a hell of an opening track in the ?Pleasure Songs.? The song doesn?t have the synths like the rest of the album, but has a fantastic sing-a-long feel. Second track ?Lost? is the crowning achievement on the record, a powerful mixture of sounds that recall New Order's Power &amp; Corruption &amp; Lies? era synths, The Cure?s ?Boy?s Don?t Cry? era guitars &amp; bass, and vocals in the range of sir Ian Mcculloch. Next track ?Void,? reminds me a lot of the Cure's Jumping Someone Else's Train, but goes off into a different tangent somewhere where the chorus starts to kick in. \n \nThe Mary Onettes brings back the sounds of the mid 80s/early 90s without sounding totally derivative. More than likely the band will make fans of that era [like myself] smile often when hearing their songs and at their finest (Pleasure Songs / Lost) make people jump and down with excitement. Although the Mary Onette?s debut album falls into a lull somewhere in the middle portion of the record, the album does feature some amazing songs, packaged in a refreshingly well (but not over) produced manner. Recommended especially for fans of Echo &amp; The Bunnymen / New Order / The Cure/Joy Division.\n\n\n\nTracklisting:\n\n01 Pleasure Songs (4:26)\n02 Lost (4:03)\n03 Void (3:28)\n04 The Laughter (5:25)\n05 Slow (4:25)\n06 The Companion (3:56)\n07 Explosions (3:57)\n08 Henry (4:06)\n09 Under The Guillotine (3:23)\n10 Still (3:39)\n","torrent":{"xt":"urn:btih:de8b2dde1ad9cfc39986df152f09c41bc36604fd","amp;dn":"The+Mary+Onettes+-+Self-titled","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de8b2dde1ad9cfc39986df152f09c41bc36604fd","infoHashBuffer":{"type":"Buffer","data":[222,139,45,222,26,217,207,195,153,134,223,21,47,9,196,27,195,102,4,253]},"announce":[],"urlList":[]}}