{"title":"Saying Goodbye to Someone You Love","uid":6520082,"size":1031176,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfc74392db09c7a3388b364cf2682e10c99891ff&amp;dn=Saying+Goodbye+to+Someone+You+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309962073,"description":"Norine Dresser, &quot;Saying Goodbye to Someone You Love: Your Emotional Journey through End-Of-Life and Grief&quot;\n Publisher: Demos Health | 2010 | ISBN: 1932603859 | PDF | 202 pages | 1.0 MB\n\n Saying Goodbye to Someone You Love consists of moving narratives about end of life and grief. These personal histories are complemented by practical guidelines for those caring for their loved ones through the last stages of life. For those who are grieving, the true-to-life-stories demonstrate how others have navigated through the tidal wave of emotions and reactions that characterize the grief process. For health care professionals and those who are offering support to grievers, Saying Goodbye to Someone You Love provides a new perspective on the challenges of caring for the dying and living with grief. Hundreds of poignant, touching, loving, humorous personal experiences address readers' concerns and curiosity about how others have faced life's final chapter with love and dignity. Specific issues include talking about death, hospice, funerals, grieving, and celebrating life. The book empowers readers by bringing compassion and awareness to end of life issues, providing examples of loving care at the moment of death, illuminating uncharted territory, demonstrating how others cope, demystifying the grief process, and inspiring hope.","torrent":{"xt":"urn:btih:dfc74392db09c7a3388b364cf2682e10c99891ff","amp;dn":"Saying+Goodbye+to+Someone+You+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc74392db09c7a3388b364cf2682e10c99891ff","infoHashBuffer":{"type":"Buffer","data":[223,199,67,146,219,9,199,163,56,139,54,76,242,104,46,16,201,152,145,255]},"announce":[],"urlList":[]}}