{"title":"The Beatles -  Please Please Me [original promo].VOB","uid":8699921,"size":66627584,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dfdc1a75387ee22b80ff74e84297295558874348&amp;dn=The+Beatles+-++Please+Please+Me+%5Boriginal+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1374038756,"description":"The Beatles -  Please Please Me [original promo].VOB\n\n\nHQ very rare promo music video. &quot;Please Please Me&quot; is a song and the second single released by the Beatles in the United Kingdom, and the first to be issued in the United States. It was also the title track of their first LP, which was recorded to capitalise on the success of the single. It was originally a John Lennon composition, although its ultimate form was significantly influenced by George Martin.\n\nThe single was released in the UK on 11 January 1963 and on 22 February 1963 reached number one on the singles charts compiled by the New Musical Express (the most recognised chart at the time) and the Melody Maker where it was Number 1 for two weeks. It only reached number two on the Record Retailer chart, which subsequently evolved into the UK Singles Chart and because of this it was not included on the multi-million selling Beatles compilation, 1.\n\nThe single, as initially released with &quot;Ask Me Why&quot; on the B-side, failed to make much impact in the US, but when re-released there on 3 January 1964 (this time with &quot;From Me to You&quot; on the B-side), it reached number three on the Hot 100.\n\nRolling Stone ranked the song at number 184 on its list of the 500 Greatest Songs of All Time, placing it 15th among Beatles songs on that list.\n\n&quot;Please Please Me&quot; was chosen for The Beatles' first national UK television appearance, on Thank Your Lucky Stars on 19 January 1963.\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Please_Please_Me_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Please_Please_Me_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/KANLbaAeM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/KANLbaAeM&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 4000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:01:58\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.8\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:dfdc1a75387ee22b80ff74e84297295558874348","amp;dn":"The+Beatles+-++Please+Please+Me+%5Boriginal+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfdc1a75387ee22b80ff74e84297295558874348","infoHashBuffer":{"type":"Buffer","data":[223,220,26,117,56,126,226,43,128,255,116,232,66,151,41,85,88,135,67,72]},"announce":[],"urlList":[]}}