{"title":"Nafeez Mosaddeq Ahmed - The war on freedom.How &amp; why America was","uid":3630348,"size":1171607,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1a54e99d17641cda013bb3f235d10933235e929&amp;dn=Nafeez+Mosaddeq+Ahmed+-+The+war+on+freedom.How+%26+why+America+was&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sampooran","files":1,"time":1172857142,"description":"Book Description\nIn The War on Truth - the long-awaited sequel to The War on Freedom - Nafeez Ahmed provides the most comprehensive and controversial critique of the government&amp;#039;s official version of what happened on 9/11. In this extensive new analysis, Ahmed doubles the data and investigates the worldwide web of terrorist networks across space and time. Deconstructing the findings of the 9/11 Commission Report and the Joint Congressional Inquiry, he exposes disturbing liaisons between American, British and European intelligence services and al-Qaeda operatives in the Balkans, Caucasus, North Africa, Middle East, Central Asia and Asia-Pacific - liaisons linked not only to 9/11, but also to prior terrorist attacks including the 1993 World Trade Center bombing and the 1998 US embassy bombings. \nAgainst this background, Ahmed accomplishes the most detailed and wide-ranging study to date of the powerful vested interests and intrigues responsible for the collapse of US national security in the years and months leading to 9/11. Government documents, whistleblower testimony, and the findings of official inquiries are scrutinized to trace the innermost workings of the intelligence community, revealing precisely which government policies and operations facilitated the 9/11 intelligence failure, and pinpointing the specific agencies, individuals and decisions that emasculated the US air defense system. Finally, Ahmed unlocks the underlying geostrategy of the War on Terror - the culmination of a decades-long plan to secure and expand an increasingly unstable system. For anyone who remains uneasy about government policies on, and after, 9/11, The War on Truth is an invaluable resource that will radically alter perceptions of international terrorism, national security, and the clandestine machinery of Western power. \n\n&quot;Nafeez Ahmed&amp;#039;s understanding of the post 9/11 power game, its lies, illusions and dangers, is no less than brilliant. Everyone should read this wise and powerfully illuminating book.&quot; --John Pilger \n\n&quot;The new book by Nafeez Ahmed, based on very extensive and deep research, is by far the best on the 9/11 syndrome. Articulating and documenting what many feel, and empowering them into action, the book will have an impact on entrenched US empire elites unwilling and unable to take it on. Votes of thanks to Ahmed, and to Interlink!&quot; --Johan Galtung, Professor of Peace Studies; Director TRANSCEND \n\nAbout the Author\nNafeez Mosaddeq Ahmed is executive director of the Institute for Policy Research &amp; Development in Brighton, and the bestselling author of The War on Freedom: How &amp; Why America was Attacked: September 11, 2001, which won him the Naples Prize, Italy&amp;#039;s most prestigious literary award. He has a first-class Masters degree in Contemporary War and Peace Studies from the University of Sussex, where he is currently a PhD candidate in International Relations. A regular political commentator on BBC Southern Counties Radio, Ahmed has been named a Global Expert on War, Peace and International Affairs by The Freedom Network of the International Society for Individual Liberty in California. His latest book is Behind the War on Terror: Western Secret Strategy and the Struggle for Iraq. \n\n\n\n(911-WTC-Bush-Neocons-Terrorism-Fascism-Iraq)","torrent":{"xt":"urn:btih:e1a54e99d17641cda013bb3f235d10933235e929","amp;dn":"Nafeez+Mosaddeq+Ahmed+-+The+war+on+freedom.How+%26+why+America+was","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1a54e99d17641cda013bb3f235d10933235e929","infoHashBuffer":{"type":"Buffer","data":[225,165,78,153,209,118,65,205,160,19,187,63,35,93,16,147,50,53,233,41]},"announce":[],"urlList":[]}}