{"title":"Sexually Broken--Hot blond,natural body, huge tits Cherry Torn  ","uid":9165070,"size":852788068,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e255e005c61f02a75626bd14cc8a5c99bd025c9f&amp;dn=Sexually+Broken--Hot+blond%2Cnatural+body%2C+huge+tits+Cherry+Torn++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":-1,"time":1383957678,"description":"Hot blond with natural body and huge tits gets destroyed by cock and bondage, Throat trained hard! | Cherry Torn | Matt Williams\n\nNovember 8, 2013\n\n\nMP4 only.\n\n \nWe are always pleased to welcome Cherry Torn back to our stage. This is the type of girl who should actually be nominated for performer of the year. She does the regular vanilla stuff but can also do the hardcore bondage and rough sex that many of the so called performers of the year couldn't do on their best day. With an all Natural body, huge tits, an amazing ass and a hungry throat, Cherry is the complete package. Best of all she's not a &quot;full of herself&quot; little princess, she is one of the nicest people we have met in this industry to date.\n\nWe have Cherry tied in a unique (guaranteed you have not seen this tie before) arm bind with cross stick across the back of the neck. She is completely helpless, exposed and at our mercy. Her huge tits are bound up to the stick, legs spread and blindfolded with a custom leather blind fold we made ourselves. Even Cherry is not prepared for the can of sexual whoop ass we are about to unleash upon her throat and pussy. \n\nWe start slowly getting her throat used to the cock, we build her up, play her like a fine tune musical instrument, then we pick up the tempo. Soon Cherry is a drooling mess, as the cock fucks her pretty face into subspace she struggles for air. We keep her on the edge, deeply fucking and destroying her throat with cock. And then it's on.\n\nCherry is just a bound helpless rag doll, we toss her around and fuck her throat with her head upside down and off the bed. Spit and drool cover her face and eyes and plug up her nose, she is completely owned by the hard cock. We flip her again and the cock slides balls deep into her tight shaved pussy, lubed from her own deep throat spit, in seconds we cause her to cum, the first of many brutal orgasms we fuck out of our helpless toy. \n\nWords will never do the action proud, we can't ever properly explain how sexually destroyed Cherry gets from the brutal onslaught of hard cock. Back and forth use, abused and used again. For the love of god simply watch the free preview to understand how completely owned Cherry is. In the end we morph the tie into a category 5 hogtied by bending Cherry back into an almost impossible back arch. We use the vibrator and make Cherry scream out an intense series of orgasms that leaves Cherry starring off into subspace not even aware of her own surroundings. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_08ctorn8/SexuallyBroken-Cherry-Torn-Hot-blond-with-natural-body-and-huge-tits-gets-destroyed-by-cock-and-bondage-Throat-trained-hard.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_08ctorn8/SexuallyBroken-Cherry-Torn-Hot-blond-with-natural-body-and-huge-tits-gets-destroyed-by-cock-and-bondage-Throat-trained-hard.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:e255e005c61f02a75626bd14cc8a5c99bd025c9f","amp;dn":"Sexually+Broken--Hot+blond%2Cnatural+body%2C+huge+tits+Cherry+Torn++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e255e005c61f02a75626bd14cc8a5c99bd025c9f","infoHashBuffer":{"type":"Buffer","data":[226,85,224,5,198,31,2,167,86,38,189,20,204,138,92,153,189,2,92,159]},"announce":[],"urlList":[]}}