{"title":"The End of the Affair - Graham Greene  (Unabridged)","uid":6059025,"size":92792939,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e3c6088fab41ae40608a557906a5e95e8e81572c&amp;dn=The+End+of+the+Affair+-+Graham+Greene++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucy1948","files":8,"time":1293034396,"description":"Unabridged and read by Michael Kitchen. 6 hours 26 mins duration. 6 CD's. (Fraunhofer CBR 32 kbit/s 22050 Hz Mono).\n\n\nAnyone who has lived in London could place the Common that forms a geographical centrepiece in this novel by Graham Greene. It doesn't really matter if it's the particular place one thinks it is, because it's what happens in the houses at or near its periphery that is central to the book. And the relationships between man and woman, between classes, between interests could be anywhere.\n\n\nMaurice Bendrix is a resident of the suburban, unfashionable, southern extremity of the open space. He has rented rooms in which he labours over his writing. He is a novelist with several books and some critical acclaim to his name. He is a passionate man, a sceptic, perhaps in every sense, and he is nothing less than scheming in the way that he manipulates friends, acquaintances and probably anyone in order to conduct his research, and perhaps to secure his other interests as well. It was during one such foray into the mind of a fictional civil servant he was trying to invent that he began to see Sarah Miles. She was the wife of a real civil servant and the affair was constructed to enter her husband's mind, though it took a more conventional initial route.\n\n\nSarah and Henry, her ministry mandarin husband, live in a large freehold on the fashionable north side of the Common. One feels that, left entirely to his own devices, Maurice would not have a great deal in common with the lifestyle of the Miles household. But when he meets Sarah, he finds a passionate woman whose devotion to the institution of her marriage is not matched by the satisfaction she derives from it. Sarah's frustrations are great, her needs are obvious, and the affair with Maurice ignites.\n\n\nTheir passionate, highly physical affair lasts some years. One day in 1944, however, a robot bomb lands outside Maurice's house and he is injured in the blast. Initially Sarah thinks he is dead. Then, somehow, their relationship ends, maybe because she seems almost disappointed that he has survived. They see nothing of one another for two years.\n\n\nMaurice, of course, assumes she has moved on to richer pastures, to another more novel lover, who can satisfy her demands in new, less committed ways. He hires a private detective to check on her. He talks to her husband and others with whom she has been acquainted. What he discovers is a surprising change of direction in her life and her priorities, a change that neither he nor Sarah's husband can either explain or accept. ","torrent":{"xt":"urn:btih:e3c6088fab41ae40608a557906a5e95e8e81572c","amp;dn":"The+End+of+the+Affair+-+Graham+Greene++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3c6088fab41ae40608a557906a5e95e8e81572c","infoHashBuffer":{"type":"Buffer","data":[227,198,8,143,171,65,174,64,96,138,85,121,6,165,233,94,142,129,87,44]},"announce":[],"urlList":[]}}