{"title":"Quincy S01E01 Pilot Go Fight City Hall -- To the Death!  DVDRip ","uid":4347917,"size":734476647,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e3d4f279dd196ccd6cd21a4dc8673f04d35d021f&amp;dn=Quincy+S01E01+Pilot+Go+Fight+City+Hall+--+To+the+Death%21++DVDRip+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lee.ka","files":4,"time":1218986897,"description":"Quincy, M.E.\nNBC 1976 - 1983\nStarring Jack Klugman\nQuincy was a man with a strong sense of principle.  He had given up a lucrative private medical practice to join the Los Angeles County Coroner&amp;#039;s Office as a medical examiner. His understanding of forensic medicine led him to conclude that many of the supposed &quot;normal&quot; deaths that he was assigned to investigate were actually murders.  This caused him endless problems as he battled with bureaucrats, his boss, the police, and anyone else who stood in the way of uncovering the truth.  Early seasons&amp;#039; episodes focused on criminal investigation; later seasons&amp;#039; episodes began to introduce themes of social responsibility - it is sometimes interesting to see that some of the things highlighted still have not changed even now.\n\nQuincy, M.E. (1976)\nS01E01 Pilot Go Fight City Hall -- To the Death!\nFirst aired: 10/3/1976\nA young woman is raped and strangled on a Los Angeles beach. Further down the coastline a young boy is shot and arrested for her murder. Quincy doesn&amp;#039;t think that it would have been possible for the boy arrested to strangle the woman and decides that he is going to go out and begin a little investigation of his own. He visits City Hall where the woman worked to ask some questions and, after a little checking, finds out that there seem to have been a rash of unexplained deaths there.\n\nCast: Jack Klugman (Quincy, M.E.), Garry Walberg (Lt. Frank Monahan), Robert Ito (Sam Fujiyama), Lynette Mettey (Lee Potter), Val Bisoglio (Danny Tovo), John S. Ragin (Dr. Robert Astin), Joseph Roman (Sgt. Brill)\n \nGuest cast: James Rosin (Police Officer), Woodrow Parfrey (Commissioner Bower), Dimitra Arliss (Shirley), Rick Podell (Peter Gordon), Harry Rhodes (Deputy Mayor Collins), Marjorie Battles (Marilyn), Fay DeWitt (Nurse Audrey), Lou Peralta (Carlos), John Furlong (1st Reporter), Martha Smith (Dianne Johnson), Jerry Daniels (2nd Reporter), Richard Sarradet (Stone), George Wyner (Harold Marcus) \n\nDVD&gt;DivX/640x480/970kbps/23.976fps/mp3/48KHz/stereo/103Kbps/73min/400Mb","torrent":{"xt":"urn:btih:e3d4f279dd196ccd6cd21a4dc8673f04d35d021f","amp;dn":"Quincy+S01E01+Pilot+Go+Fight+City+Hall+--+To+the+Death%21++DVDRip+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3d4f279dd196ccd6cd21a4dc8673f04d35d021f","infoHashBuffer":{"type":"Buffer","data":[227,212,242,121,221,25,108,205,108,210,26,77,200,103,63,4,211,93,2,31]},"announce":[],"urlList":[]}}