{"title":"RL Vision Flash Renamer 6.53 [ak]","uid":6416143,"size":3137141,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e492562bc06e325ec9408b8025914b4a858bda03&amp;dn=RL+Vision+Flash+Renamer+6.53+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1306167917,"description":"RL Vision Flash Renamer 6.53\n\nFlash Renamer renames many files at once by applying rules such as case convert, sequential numbering and seach / replace. It's a time saver for people with large amount of files, eg digital camera users, webmasters &amp; mp3 collectors. Flash Renamer renames many files at once, so called batch or bulk renaming (or &quot;en masse&quot;). With Flash Renamer you can automate thousands of file renames in a single click!\n\nUse Flash Renamer to set your filenames to UPPERCASE, lowercase or First Letter Case. Extract &amp; rename with Mp3 ID3 tags to tidy up your music collection.\n\nFind &amp; replace strings within the filenames. Set the file date &amp; attributes. Remove unwanted spaces. Add &amp; remove characters at certain positions.\n\nSequential renaming gives you the chance to add number sequences to your filenames. You can also extract useful information, such as width/height, length, bitrate &amp; framerate from movie, music &amp; image files, and put this in the filename.\n\nAnd if that wasn't enough, Flash Renamer can detect the format of files without proper extension. You can even organize your music collection according to eg artist &amp; album!\n\nFlash Renamer handles both files &amp; directories and works with all versions of Windows. The realtime preview instantly shows you what the new filenames will look like, so you don't have to worry about making any mistakes. Don't spend your time renaming files by hand. Use Flash Renamer - the essential file utility!\n\nKey features of &quot;Flash Renamer&quot;:\nÃ‚Â· Fast as lightning! Renames thousands of files in a matter of seconds\nÃ‚Â· Set casing to UPPER CASE, lower case or First Letter Case\nÃ‚Â· Rename Mp3s using their tags and properties\nÃ‚Â· Read data from jpeg Exif tags. Excellent for digital camera users\nÃ‚Â· Search and replace strings within filenames\nÃ‚Â· Set or clear file attributes, such as 'read only' and 'hidden'\nÃ‚Â· Set date &amp; time using various sources, such as image Exif date\nÃ‚Â· Add or Remove strings from specified positions\nÃ‚Â· Add counters to files that are related, such as photo sessions\nÃ‚Â· Extract meta-data from media, such as width/height and duration\nÃ‚Â· Realtime preview shows the new filenames before you rename\nÃ‚Â· Works on files, folder and sub-folders\nÃ‚Â· Easily manage your photo collection by using the thumbnail mode\nÃ‚Â· Add zeros to numbers to make files sort correctly in every situation\nÃ‚Â· Re-order parts within filenames the way you want it\nÃ‚Â· Context menus allows you to quickly launch FR when you need it\n\nHome Page - http://www.rlvision.com\n","torrent":{"xt":"urn:btih:e492562bc06e325ec9408b8025914b4a858bda03","amp;dn":"RL+Vision+Flash+Renamer+6.53+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e492562bc06e325ec9408b8025914b4a858bda03","infoHashBuffer":{"type":"Buffer","data":[228,146,86,43,192,110,50,94,201,64,139,128,37,145,75,74,133,139,218,3]},"announce":[],"urlList":[]}}