{"title":"BLUE DRAGON (j-TAG/RGH ONLY) XBOX360","uid":10280976,"size":19786508091,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:e516c631b8343bfee8926b56d61655749a33e8b8&amp;dn=BLUE+DRAGON+%28j-TAG%2FRGH+ONLY%29+XBOX360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"exdous69","files":1,"time":1401696742,"description":"THIS FILE IS FOR J-TAG/RGH ONLY!! THIS FILE DOES NOT CONTAIN AN ISO!!!!\n\nBlue Dragon (Japanese: ãƒ–ãƒ«ãƒ¼ãƒ‰ãƒ©ã‚´ãƒ³ Hepburn: BurÅ« Doragon?) is a role-playing video game developed by Mistwalker and Artoon and published by Microsoft Game Studios exclusively for the Xbox 360. Blue Dragon is based on a design by Final Fantasy series creator Hironobu Sakaguchi, who also supervised development and wrote the plot.[4] It is both Mistwalker's debut title and the first title to be helmed by Sakaguchi outside of Square Enix. The game was released in Japan on December 7, 2006, where it was sold both as a standalone title and as part of a bundle with the Xbox 360 (including the game, the Xbox 360 system itself, and a Blue Dragon console skin).[5] Other regions received only the game itself, with a release in Europe on August 24, 2007, and in North America on August 28, 2007.\n\nTaking place in a fictional open-world environment, the story of Blue Dragon focuses on five friends (Shu, Jiro, Kluke, Zola, and Marumaro) as they travel across the world to confront Nene, the evil ruler of the Grand Kingdom. The setting inspired separate anime and manga adaptations, although these follow the story to different degrees and feature a different cast of characters. The game follows a traditional role-playing design, based around exploration and turn-based combat.\n\nBlue Dragon is the first Xbox 360 title to make use of multiple discs, spanning three discs in total.[6] Overall, the game has received a positive reception, with an average score of 77.48% on the review aggregator website Game Rankings.[7] Blue Dragon was both applauded and criticized for its adaptation of the traditional elements of role-playing games","torrent":{"xt":"urn:btih:e516c631b8343bfee8926b56d61655749a33e8b8","amp;dn":"BLUE+DRAGON+%28j-TAG%2FRGH+ONLY%29+XBOX360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e516c631b8343bfee8926b56d61655749a33e8b8","infoHashBuffer":{"type":"Buffer","data":[229,22,198,49,184,52,59,254,232,146,107,86,214,22,85,116,154,51,232,184]},"announce":[],"urlList":[]}}