{"title":"The Thirty Years War","uid":8120590,"size":572375690,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e5402b852c01c667e222ab03c51cd350403b7c18&amp;dn=The+Thirty+Years+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sulla_felix","files":44,"time":1360396160,"description":"Initially, the Thirty Years War was precipitated in 1618 by religious \nconflicts between Protestants and Catholics in the Holy Roman Empire. \nBut the conflict soon spread beyond religion to encompass the internal \npolitics and balance of power within the Empire, and then later to the \nother European powers. By the end, it became simply a dynastic struggle \nbetween Bourbon France and Habsburg Spain. And almost all of it was \nfought out in Germany. After 30 years of conflict, entire regions of \nGermany and Bohemia were depopulated and destroyed by marching armies, \nfire, famine, and disease. It bankrupted most of the participants while \nleaving thousands of German villages, towns, and even cities in smoldering \nruin.\n\nBecause of the political and geographical complexity of the early 17th \ncentury, an understanding of The Thirty Years War can be difficult to \ngrasp in the beginning. Listeners will be rewarded by patience. As an \naid to comprehension, we recommend the online Wikipedia article &quot;The \nThirty Years War&quot; for maps and overviews of the geography, principle \nleaders, and major battles.\n\n-----------------------------------------------------------------------------------\n\nPirates, sharing is caring! Please do your part to show support and combat copyright everywhere! Seed the torrents you download, and upload your own!\n\nAnd remember... &quot;If Sulla did it, why can't I?&quot;\t","torrent":{"xt":"urn:btih:e5402b852c01c667e222ab03c51cd350403b7c18","amp;dn":"The+Thirty+Years+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5402b852c01c667e222ab03c51cd350403b7c18","infoHashBuffer":{"type":"Buffer","data":[229,64,43,133,44,1,198,103,226,34,171,3,197,28,211,80,64,59,124,24]},"announce":[],"urlList":[]}}