{"title":"The Six Shooter (James Stewart western radio series)","uid":10204432,"size":142470562,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e540bc619850bc41ca294c7d0e34ae7f931f02fa&amp;dn=The+Six+Shooter+%28James+Stewart+western+radio+series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"praeriedog1","files":44,"time":1400825257,"description":"&quot;The Six Shooter was a weekly old-time radio program in the United States. It was created by Frank Burt, who also wrote many of the episodes, and lasted only one season of 39 episodes on NBC (Sept. 20, 1953-June 24, 1954).\n\nJames Stewart starred as Britt Ponset, a drifting cowboy in the final years of the wild west. Episodes ranged from straight western drama to whimsical comedy. A trademark of the show was Stewart's use of whispered narration during tense scenes that created a heightened sense of drama and relief when the situation was resolved.\n\nSome of the more prominent actors to perform on the program included Parley Baer, Virginia Gregg, Harry Bartell, Howard McNear, Jeanette Nolan, Dan O'Herlihy, Alan Reed, Marvin Miller and William Conrad (often credited as &quot;Julius Krelboyne&quot; because he was also the star of CBS' Gunsmoke at the time). Some did multiple episodes playing different characters.\n\nEach episode opened with the announcer (Hal Gibney; John Wald in later episodes) stating: The man in the saddle is angular and long-legged. His skin is sun-dyed brown. The gun in his holster is gray steel and rainbow mother-of-pearl, its handle unmarked. People call them both &quot;the Six Shooter&quot;.\n\nThe final episode, &quot;Myra Barker&quot;, provided a satisfying (if melancholy) finale to the series.&quot;  -- from Wikipedia\n\nAll 39 episodes are included, in mp3 format.","torrent":{"xt":"urn:btih:e540bc619850bc41ca294c7d0e34ae7f931f02fa","amp;dn":"The+Six+Shooter+%28James+Stewart+western+radio+series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e540bc619850bc41ca294c7d0e34ae7f931f02fa","infoHashBuffer":{"type":"Buffer","data":[229,64,188,97,152,80,188,65,202,41,76,125,14,52,174,127,147,31,2,250]},"announce":[],"urlList":[]}}