{"title":"Schiff - How Anyone Can Stop Paying Income Taxes (IRS hoax expos","uid":8428557,"size":5232042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5965a6f89c18e8d0f5aa63738a27e919d3e3ed2&amp;dn=Schiff+-+How+Anyone+Can+Stop+Paying+Income+Taxes+%28IRS+hoax+expos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1367426421,"description":"This is Irwin Schiff's explosive book How Anyone Can Stop Paying Income Taxes (1982) which  exposes the fraud and deception by which the IRS extracts income taxes from uninformed Americans and shows how to put a stop to it. That millions of supposedly intelligent Americans could be thoroughly convinced that they are legally required to file and pay income taxes each year, when such is not the case, must rank as the greatest and most spectacular hoax of all time. Governments have always cheated taxpayers into believing they are required to file an income tax return. See for yourself how our rights to have property and privacy are violated by a well oiled government scam. The author asserts that: (1) no American is legallly required to file an income tax return; (2) no American is legally required to submit to a tax audit; and (3) no American is legally required to have income taxes taken out of his pay. If you think goverment was on your side, this book will awake you up! How Anyone Can Stop Paying Income Taxes will convince you that the federal income tax system is the greatest hoax of all time. 165 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:e5965a6f89c18e8d0f5aa63738a27e919d3e3ed2","amp;dn":"Schiff+-+How+Anyone+Can+Stop+Paying+Income+Taxes+%28IRS+hoax+expos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5965a6f89c18e8d0f5aa63738a27e919d3e3ed2","infoHashBuffer":{"type":"Buffer","data":[229,150,90,111,137,193,142,141,15,90,166,55,56,162,126,145,157,62,62,210]},"announce":[],"urlList":[]}}