{"title":"Aus Liebe zum Volk / I love you all /Pour l'amour du peuple 2004","uid":13195018,"size":1014818474,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e623de53a443d46984b6cb4fb79a7273408b4b13&amp;dn=Aus+Liebe+zum+Volk+%2F+I+love+you+all+%2FPour+l%27amour+du+peuple+2004&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dreckigersowjet","files":1,"time":1452472793,"description":"IMDB: http://www.imdb.com/title/tt0404794/\r\nDVD Rip, h264 599 x 480 px\r\nAudio: 2 tracks German, French\r\nSubtitles: English\r\n\r\nENGLISH description:\r\nTrust is good – control is better..... Mr B has worked for twenty years as a public servant &quot;in service of the people&quot;. Out of love. An unconditional and absolute love for &quot;his people&quot;. A blind and destructive love.  When the times change and the regime he adheres to is defeated, he becomes a social reject and life as he has always known it falls apart.  Fired from his job, his &quot;House&quot;, Mr B. is left with nothing, no perspective, no future. He sits alone in this office which is no longer his. Once he walks out that door, he will never come back.\r\n\r\nIn February 1990, a few weeks after the fall of the Berlin Wall, the Ministry for State Security of the GDR is dismantled. This marks the end of the &quot;Stasi&quot;, the East German secret police. Major B. was a Stasi officer.  Relieved of his duties, he delivers a detailed account of twenty years of his life and work within this institution.\r\n\r\nI love you all is based on this extraordinary personal testimony, supported by never seen before archive footage. This is a film about surveillance and blindness, about faith and disillusion.\r\n\r\nGERMAN description:\r\nHerr S. arbeitet zwanzig Jahre lang als Beamter im „Dienst der Gesellschaft“. Aus Liebe. Einer bedingungslosen, absoluten Liebe fuer „sein Volk“. Einer blinden und zerstoererischen Liebe.\r\nDann dreht der Wind, und das Regime, dem er dient, findet sein Ende. Herr S. steht vor der Entlassung. Sein soziales Umfeld bricht zusammen.\r\nOhne seinen Arbeitsplatz, sein eigentliches Zuhause, sieht er weder Zukunft noch Perspektive. Er sitzt alleine in seinem Buero, das bald nicht mehr ihm gehoert. Wenn er durch die Tuer geht, wird er nicht mehr zurueckkehren.\r\nIm Februar 1990, einige Wochen nach dem Fall der Berliner Mauer, wird das Ministerium fuer Staatssicherheit aufgeloest. Das Ende der Stasi ist gekommen.\r\nMajor S. war einer ihrer Offiziere.\r\nAn seinem letzten Tag im Buero berichtete er detailliert über sein Leben und ueber die zwanzig Jahre, die er im Herzen dieser Institution gearbeitet hat.\r\nIm Film von Eyal Sivan und Audrey Maurion wird die Zeugenaussage des Herrn S. zur Folie für eine verstoerende Montage. Der Bericht ist verbunden mit einzigartigen Originalaufnahmen aus den Kellern der Gauck-Behoerde, aus privaten und oeffentlichen Archiven.\r\nEin Film über Ueberwachung und Blindheit, über Glauben und Desillusion","torrent":{"xt":"urn:btih:e623de53a443d46984b6cb4fb79a7273408b4b13","amp;dn":"Aus+Liebe+zum+Volk+%2F+I+love+you+all+%2FPour+l%27amour+du+peuple+2004","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e623de53a443d46984b6cb4fb79a7273408b4b13","infoHashBuffer":{"type":"Buffer","data":[230,35,222,83,164,67,212,105,132,182,203,79,183,154,114,115,64,139,75,19]},"announce":[],"urlList":[]}}