{"title":"Knitting in the Details: Charming Designs to Knit and Embellish","uid":9253386,"size":60471317,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e692e22a0680aa1a768bb3437387548d29bd10ea&amp;dn=Knitting+in+the+Details%3A+Charming+Designs+to+Knit+and+Embellish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KnitLady","files":-1,"time":1385503360,"description":"Learn from best-selling author and knitwear designer Louisa Harding unique and creative ways to bring big appeal to your knitting using only the tiniest of elements. The 24 projects in Knitting in the Details showcase small, quick-to-knit patterns in Louisa's romantic, feminine, and cherished signature style, from a beret with ribbon embroidery or a beaded scarf to a simple knitted vest with eyelets or a tank top with applique hearts.\n\nEach of the four chapters in Knitting in the Details explores a different set of embellishment methods, offering clear technique instruction accompanied by illustrations. Add your own personality by customizing projects and find fresh inspiration to create a unique piece of knitwear with additional design tips and ideas. Filled with inspiring images and photographs from the coast of France, Knitting in the Details evokes fashionable femininity and enchantment and showcases projects transformed by creative and well-placed embellishment.","torrent":{"xt":"urn:btih:e692e22a0680aa1a768bb3437387548d29bd10ea","amp;dn":"Knitting+in+the+Details%3A+Charming+Designs+to+Knit+and+Embellish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e692e22a0680aa1a768bb3437387548d29bd10ea","infoHashBuffer":{"type":"Buffer","data":[230,146,226,42,6,128,170,26,118,139,179,67,115,135,84,141,41,189,16,234]},"announce":[],"urlList":[]}}