{"title":"[Thomas_Strothotte]Non-Photorealistic Computer Graphics  Modelin","uid":11034380,"size":13575708,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7319279b1dda2cf9cdcf066849cdc319781cbac&amp;dn=%5BThomas_Strothotte%5DNon-Photorealistic+Computer+Graphics++Modelin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":2,"time":1410769082,"description":"Even as developments in photorealistic computer graphics continue to affect our work and leisure activities, practitioners and researchers are devoting more and more attention to non-photorealistic (NPR) techniques for generating images that appear to have been created by hand. These efforts benefit every field in which illustrations-thanks to their ability to clarify, emphasize, and convey very precise meanings-offer advantages over photographs. These fields include medicine, architecture, entertainment, education, geography, publishing, and visualization.\n\nNon-Photorealistic Computer Graphics is the first and only resource to examine non-photorealistic efforts in depth, providing detailed accounts of the major algorithms, as well as the background information and implementation advice readers need to make headway with these increasingly important techniques.\n\nAlready, an estimated 10% of computer graphics users require some form of non-photorealism. Strothotte and Schlechtweg's important new book is designed and destined to be the standard NPR reference for this large, diverse, and growing group of professionals.\n\n*Hard-to-find information needed by a wide range and growing number of computer graphics programmers and applications users.\n*Traces NPR principles and techniques back to their origins in human vision and perception.\n*Focuses on areas that stand to benefit most from advances in NPR, including medical and architectural illustration, cartography, and data visualization.\n*Presents algorithms for two and three-dimensional effects, using pseudo-code where needed to clarify complex steps.\n*Helps readers attain pen-and-ink, pencil-sketch, and painterly effects, in addition to other styles.\n*Explores specific challenges for NPR-including &quot;wrong&quot; marks, deformation, natural media, artistic technique, lighting, and dimensionality.\n*Includes a series of programming projects in which readers can apply the book's concepts and algorithms.\n\nPublisher: Morgan Kaufmann; 1 edition (April 26, 2002)\nLanguage: English\nISBN-10: 1558607870\nISBN-13: 978-155860787\n\nEditorial Reviews\nFrom the Back Cover\nIn the past decade, the field of non-photorealistic computer graphics (NPR) has developed as the product of research marked by diverse and sometimes divergent assumptions, approaches, and aims. This book is the first to offer a systematic assessment of this work, identifying and exploring the underlying principles that have given the field its cohesion. In the course of this assessment, the authors provide detailed accounts of today's major non-photorealistic algorithms, along with the background information and implementation advice you need to put them to productive use. As NPR finds new applications in a broadening array of fields, Non-Photorealistic Computer Graphics is destined to be the standard reference for researchers and practitioners alike.\nFeatures\nTraces NPR principles and techniques back to their origins in human vision and perception.\nEmphasizes areas that stand to benefit most from advances in NPR, including medical and architectural illustration.\nPresents algorithms for both 2D and 3D effects, using pseudo-code where needed.\nExamines the techniques behind distinct styles, including pen-and-ink, pencil sketch, and painterly effects.\nExplores specific challenges for NPR-including simulation of natural media, artistic techniques, deformations, illustrations, and lighting.\nConcludes each chapter with a set of hands-on exercises.\nVia a companion Web site, provides additional information on NPR, including a forum in which to interact with other NPR professionals.\nAbout the Author\n\nThomas Strothotte is professor of computer science at the University of Magdeburg (Germany), where he founded undergraduate and graduate degree programs in computational visualistics. He studied at Simon Fraser University, the University of Waterloo, and McGill University. He has held teaching and research appointments at INRIA Rocquencourt, the University of Stuttgart, Free University of Berlin, and the former IBM Scientific Center in Heidelberg.\n\nStefan Schlechtweg is assistant professor at the University of Magdeburg (Germany), where his teaching and research areas are computer graphics and interactive systems. He received his Ph.D. from the University of Magdeburg in 1999. ","torrent":{"xt":"urn:btih:e7319279b1dda2cf9cdcf066849cdc319781cbac","amp;dn":"%5BThomas_Strothotte%5DNon-Photorealistic+Computer+Graphics++Modelin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7319279b1dda2cf9cdcf066849cdc319781cbac","infoHashBuffer":{"type":"Buffer","data":[231,49,146,121,177,221,162,207,156,220,240,102,132,156,220,49,151,129,203,172]},"announce":[],"urlList":[]}}