{"title":"THE ELDER SCROLLS V: SKYRIM - P2P - XBOX360 - PAL / NTSC-U {BOOB","uid":6788106,"size":8738847353,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:e75f280494ec9537a6229955bb41084c64751db7&amp;dn=THE+ELDER+SCROLLS+V%3A+SKYRIM+-+P2P+-+XBOX360+-+PAL+%2F+NTSC-U+%7BBOOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"boobsman","files":7,"time":1320172815,"description":"THIS IS AN XGD3 ISO AND IS ONLY BE PLAYABLE WITH LT+2.0!!!\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-293A_4EB01075.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-293A_4EB01075.jpg&lt;/a&gt;\n\nThe next installment in the critically acclaimed Elder Scrolls series is finally coming: The Elder Scrolls 5: Skyrim.\n\nSkyrim is the homeland of the Nords, a fierce and proud warrior people who are used to the bitter cold and mountanous terrain that mark the lands of Skyrim.\n\nWracked by civil war, and threatened by the return of the legendary dragons, Skyrim faces its darkest hour.\n\nYou must make sense of this maelstrom, explore the frozen tundra and bring hope to the people.\n\nEpic fantasy reborn: Skyrim reimagines the open-world fantasy epic, pushing the gameplay and technology of a virtual world to new heights\n\nLive another life, in another world: Play any type of character you can imagine, and do whatever you want the legendary freedom of choice, storytelling, and adventure of The Elder Scrolls is realized like never before\n\nAll new graphics and gameplay engine: Skyrim's new game engine brings to life a complete virtual world with rolling clouds, rugged mountains, bustling cities, lush fields, and ancient dungeons\n\nYou are what you play: Choose from hundreds of weapons, spells, and abilities. The new character system allows you to play any way you want and define yourself through your actions\n\nDragons return: Battle ancient dragons like you've never seen. As Dragonborn, learn their secrets and harness their power for yourself\n\nTHIS IS A SCENE RELEASE, ALL CREDIT GOES TO THE ORIGINAL RIPPER!!!\n","torrent":{"xt":"urn:btih:e75f280494ec9537a6229955bb41084c64751db7","amp;dn":"THE+ELDER+SCROLLS+V%3A+SKYRIM+-+P2P+-+XBOX360+-+PAL+%2F+NTSC-U+%7BBOOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e75f280494ec9537a6229955bb41084c64751db7","infoHashBuffer":{"type":"Buffer","data":[231,95,40,4,148,236,149,55,166,34,153,85,187,65,8,76,100,117,29,183]},"announce":[],"urlList":[]}}