{"title":"Armageddon:  2001; The Alien Agenda; Inferno  (Complete)","uid":7666957,"size":358524549,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e7bc0a8af4cf2d398f311610a3a675e68842e376&amp;dn=Armageddon%3A++2001%3B+The+Alien+Agenda%3B+Inferno++%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1348470503,"description":"Armageddon 2001 was a 1991 crossover event published by DC Comics.  It ran through a self-titled, two issue limited series which sandwiched most of the annuals DC published that year.  Following the event, there were two more series, both comprised of four issues:  the direct sequel, Armageddon:  The Alien Agenda; and the tangentially related, Armageddon:  Inferno.  ALL three storylines, in their entireties, are included in this torrent for your downloading/perusing pleasures.\n\nArmageddon 2001 introduced the readers of DC to a bleak, dystopian future where a villain named Monarch has murdered the heroes of Earth, and taken control of the entire world.  A scientist named Matthew Ryder, an expert on temporal studies, discovered that in the late 20th century one of the superheroes of Earth had become evil.  In the year 2001, this hero had killed all of his comrades; assumed the identity of Monarch; and began his rise to global domination.  Because Monarch always appeared in a suit of full body armor his previous identity could not be discerned.  Matt Ryder was convinced he could use his technology to travel back in time and prevent the maniacal ruler from ever coming to power. \n\nA storyline in JSA would later reveal that the ending of Armageddon 2001 had been faked by Mordru.  He had created an illusion of Dove being murdered by a future Hawk/Monarch in order to drive the current Hawk insane.  Mordru then took control of Hawk and used him to impregnate Dove so she would give birth to a child that would inherit all the powers of The Lords of Chaos and Order.  Mordru cast a spell on Dove that kept her in a comatose state for years.  She did give birth to a child but before Mordru could possess the body of the child, it was inhabited by a reincarnated Hector Hall (who aged the body to adulthood and became the new Doctor Fate.)  Much later while searching for his wife Lyta, Hector would discover Dove and bring her out of the spell of Mordru, and reveal the truth of these events.  She would then discover that her sister had inherited the Hawk powers after the death of Hank Hall.\n","torrent":{"xt":"urn:btih:e7bc0a8af4cf2d398f311610a3a675e68842e376","amp;dn":"Armageddon%3A++2001%3B+The+Alien+Agenda%3B+Inferno++%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7bc0a8af4cf2d398f311610a3a675e68842e376","infoHashBuffer":{"type":"Buffer","data":[231,188,10,138,244,207,45,57,143,49,22,16,163,166,117,230,136,66,227,118]},"announce":[],"urlList":[]}}