{"title":"Monkeys in the Sky [Collector's Edition]","uid":13852687,"size":4468925714,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e9d1633673a654902544d5b03cc326118136ef47&amp;dn=Monkeys+in+the+Sky+%5BCollector%27s+Edition%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"corey588","files":6,"time":1457995670,"description":"Monkeys in the Sky\r\nThe Latest in a Series of Aviation Adventure Films!\r\n\r\nOlivier Aubert and Mike Blyth present: Monkeys in the SkyFilm making is not in the genes, nor is flying when it comes down to it. Both are, however, possible if you put your mind to it.\r\nOlivier Aubert and Mike Blyth are both well known figures in the world of adventure aviation. Their contagious sense of humor leaves us no doubt of their motivation and capabilities when it comes to successfully completing yet another unbelievable adventure. The two pilots are like two peas in a pod (albeit an airborne one) and the boundless esteem in which they hold each other is well known.\r\nAny lack of experience they may have as filmmakers, is largely made up for by their natural ability to laugh at themselves. What could simply have been &quot;the making of… &quot; has been carefully distilled down to the very essence of the spirit of adventure, showing us the comedy of everyday situations and regaling us with a series of interwoven stories. The richness of the images, wrapped in haunting melodies that seem to have been composed by the drifting winds through which they trace their journey, are enough to make us take flight ourselves.\r\nPaths that cross and uncross, chance encounters: each portrait is drawn with the skill of a master draftsman with a steady touch that brings each story to life and makes them unforgettable. As a new day dawns on the African bush, new horizons open up for these two « Monkeys »that have made the sky their playground. The message written in the wake of their propellers is one of optimism and freedom.\r\n=======================================\r\n\r\nOlivier Aubert and Mike Blyth Present\r\nMonkeys in the Sky\r\nDVD - PAL/NTSC format\r\n72 mins\r\nISO\r\nURL: _http://www.trike-expeditions.com/Videos/videos.html\r\n=======================================\r\n\r\nLanguage: English\r\nSubtitles available: French, Spanish, Italian, German, English","torrent":{"xt":"urn:btih:e9d1633673a654902544d5b03cc326118136ef47","amp;dn":"Monkeys+in+the+Sky+%5BCollector%27s+Edition%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9d1633673a654902544d5b03cc326118136ef47","infoHashBuffer":{"type":"Buffer","data":[233,209,99,54,115,166,84,144,37,68,213,176,60,195,38,17,129,54,239,71]},"announce":[],"urlList":[]}}