{"title":"The Health Wyze Report - Episode 33","uid":10282769,"size":19624219,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ea445276ab84bb61ed36b48a6373437d831603a9&amp;dn=The+Health+Wyze+Report+-+Episode+33&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mandalasarah","files":-1,"time":1401729523,"description":"How 2,000 Architects Can Be Wronged\n\nWe were guests on the Field Interference show for this episode, with host Ryan G. Banister. The interview exposes the inner workings of the truther organization, AE911Truth.org. It is based upon our own experiences as insiders of this cult-like sect. This report autopsies an organization that has become detrimental to its own truth-seeking principles, due to its lack of principled leadership. We catalog how the organization betrays the people who attempt to support it, and peers alike. We likewise discuss how the group thwarts its very mission, and whether that is intentional, or the product of incompetence. We express our belief that their drive for a new investigation is a farce, and that their petition has merely become a watchlist for the potential troublemakers, who could actually do a legitimate investigation. We name names and call them out on the details of their activities. We expect for this to be riveting, even for listeners who are not normally interested in the truther movement.\n\n\nFor more information, or to browse the complete audio archive, then visit us at: http://healthwyze.org","torrent":{"xt":"urn:btih:ea445276ab84bb61ed36b48a6373437d831603a9","amp;dn":"The+Health+Wyze+Report+-+Episode+33","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea445276ab84bb61ed36b48a6373437d831603a9","infoHashBuffer":{"type":"Buffer","data":[234,68,82,118,171,132,187,97,237,54,180,138,99,115,67,125,131,22,3,169]},"announce":[],"urlList":[]}}