{"title":"Handbook of thermoset plastics 2nd ed","uid":12426506,"size":24922608,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eac17c09352d6c181ae31b76cc684bc2260cc4bb&amp;dn=Handbook+of+thermoset+plastics+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442386828,"description":"Handbook of thermoset plastics 2nd (Sidney H. Goodman) (1998).pdf\n\nISBN 0815514212\n\nOnce occupying a lesser, yet significant, role in the plastics' industry, thermoset plastics technology has increasingly become important to designers and users who work in specialty applications. Everything from toys to medical devices, and from automotive to sports and recreation products, are being manufactured using thermoset plastics. An increased understanding of thermoset plastics technology and processes has broadened their use exponentially over the last few years. In fact, the importance and contributions of unsaturated polyesters, urethanes, and epoxy thermosets have driven unprecedented sales and production figures that approach the definition of commodity materials. \nAs a survey of the technology, the handbook provides the reader with the practical implications of crosslinking, as well as establishing relationships between time, temperature, and mass, often ignored in the general overviews allotted to thermoset plastics in other handbooks. The Handbook of Thermoset Plastics offers the most complete collection of general and technical details available for this important subject","torrent":{"xt":"urn:btih:eac17c09352d6c181ae31b76cc684bc2260cc4bb","amp;dn":"Handbook+of+thermoset+plastics+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eac17c09352d6c181ae31b76cc684bc2260cc4bb","infoHashBuffer":{"type":"Buffer","data":[234,193,124,9,53,45,108,24,26,227,27,118,204,104,75,194,38,12,196,187]},"announce":[],"urlList":[]}}