{"title":"Star Wars Republic Commando Trilogy + 2 Shortstories","uid":4074767,"size":3827037,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb4fb6c365b023cb4e4f898421ff4d4aba568fb2&amp;dn=Star+Wars+Republic+Commando+Trilogy+%2B+2+Shortstories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DarthVader20","files":15,"time":1205248882,"description":"*******************************************************************************\n               Star Wars Republic Commando Trilogy + 2 Shortstories\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\nType.................: E-Books\n\n\n\n\n-------------------------------------------------------------------------------\n                               Post Information\n-------------------------------------------------------------------------------\nPosted by............: DarthVader20\nPosted on............: 3/11/2008\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\nThis torrent contains the following:\n\nStar Wars Republic Commando #1 - Hard Contact\n\n[IMG]http://img387.imageshack.us/img387/8936/repubiccommando01hardcopl0.jpg[/IMG]\n\nStar Wars: Republic Commando: Hard Contact is a tie-in novel to the video game Star Wars: Republic Commando. It was written by Karen Traviss. It tells the story of a squad of clone commandos on a mission to destroy a Separatist bioweapons lab. The commandos (Niner, Fi, Atin, and Darman) are aided by the Gurlanins Jinart and Valaqil, along with an inexperienced Padawan named Etain Tur-Mukan.\n\nPublisher&amp;#039;s summary\n\nAs the Clone Wars rage, victory or defeat lies in the hands of elite squads that take on the toughest assignments in the galaxy,stone-cold soldiers who go where no one else would, to do what no one else could. \n\nOn a mission to sabotage a nanovirus research facility on a Separatist-held planet, four clone troopers operate under the very noses of their enemies. The commandos are outnumbered and outgunned, deep behind enemy lines with no backup and working with strangers instead of trusted teammates. Matters don&amp;#039;t improve when Darman, the squad&amp;#039;s demolitions expert, gets cut off from the others during planetfall. Even Darman&amp;#039;s apparent good luck in meeting a Jedi Padawan vanishes once she admits to her woeful inexperience. \n\nFor the isolated clone commandos and stranded Jedi, a long, dangerous journey lies ahead, through hostile territory brimming with Trandoshan slavers, Separatists , and suspicious natives. A single misstep could mean discovery and death. It&amp;#039;s a virtual suicide mission for anyone except Republic Commandos.\n\n\nStar Wars Republic Commando #2 - Triple Zero\n\n[IMG]http://img387.imageshack.us/img387/2004/repubiccommando02triplelk5.jpg[/IMG]\n\nStar Wars: Republic Commando: Triple Zero is a novel written by Karen Traviss and set one year after the Battle of Geonosis. It tells the story of Omega Squad, Delta Squad, a unit of Null ARC troopers, and their Jedi Generals Etain Tur-Mukan and Bardan Jusik as they pursue a Separatist terror group along the skylanes and underworld of Coruscant, known to clone troopers as Triple Zero for its galactic chart coordinates.\n\nPublisher&amp;#039;s summary\n\nFollowing the eruption of the bloody Clone Wars at the battle of Geonosis, both sides remain deadlocked in a stalemate that can be broken only by elite warrior teams like Omega Squad, clone commandos with terrifying combat skills and a lethal arsenal. \n\nFor Omega Squad, deployed deep behind enemy lines, it&amp;#039;s the same old special ops grind: sabotage, espionage, ambush, and assassination. But when Omega Squad is rushed to Coruscant, the war&amp;#039;s most dangerous new hotspot, the commandos discover they&amp;#039;re not the only ones penetrating the heart of the enemy. \n\nA surge in Separatist attacks has been traced to a network of Sep terror cells in the Republic&amp;#039;s capital, masterminded by a mole in Command Headquarters. To identify and destroy a Separatist spy and terror network in a city full of civilians will require special talents and skills. Not even the leadership of Jedi generals, along with the assistance of Delta squad and a certain notorious ARC trooper, can even the odds against the Republic Commandos. And while success may not bring victory in the Clone Wars, failure means certain defeat.\n\nStar Wars Republic Commando #3 - True Colors\n\n[IMG]http://img389.imageshack.us/img389/5260/truecolorsau9.jpg[/IMG]\n\nStar Wars Republic Commando: True Colors is the third novel in the Republic Commando series. It was released on October 30, 2007.The title was officially announced on January 10, 2007.\n\nPublisher&amp;#039;s summary\n\nAs the savage Clone Wars rage unchecked, the Republic&amp;#039;s deadliest warriors face the grim truth that the Separatists aren&amp;#039;t their only enemy or even their worst. \n\nIn the Grand Army&amp;#039;s desperate fight to crush the Separatists, the secret special ops missions of its elite clone warriors have never been more critical or more dangerous. A growing menace threatens Republic victory, and the members of Omega Squad make a shocking discovery that shakes their loyalty. \n\nAs the lines continue to blur between friend and enemy, citizens from civilians and sergeants to Jedi and generals find themselves up against a new foe: the doubt in their own hearts and minds. The truth is a fragile, shifting illusion and only the approaching inferno will reveal both sides in their true colors.\n\nStar Wars Insider 87 - Republic Commando - Odds\n\n[IMG]http://img389.imageshack.us/img389/2336/oddsre1.jpg[/IMG]\n\nOdds is a short story which appeared in Star Wars Insider 87, written by Karen Traviss and illustrated by Robert Hendrickson. It is set 65 to 67 standard days after the end of Republic Commando: Triple Zero, 460 standard days after the Battle of Geonosis, and features N-7, Atin, Kal Skirata, and Prudii. It was reprinted as a bonus story in Republic Commando: True Colors.\n\nStar Wars Insider 81 - Republic Commando - Omega Squad:Targets\n\n[IMG]http://img377.imageshack.us/img377/4839/insider81omegasquadsnv1.jpg[/IMG]\n\nOmega Squad: Targets is a short story written by Karen Traviss and illustrated by Robert Hendrickson for Star Wars Insider 81. It was also included in Republic Commando: Triple Zero. It takes place in 22 BBY.\n\nPublisher&amp;#039;s summary\n\nA group of terrorists have taken a senator hostage on Coruscant, and its up to a crack team of clone commandos to diffuse the dangerous situation.\n\n\nMay the Force be with you and remember to seeeed ;)","torrent":{"xt":"urn:btih:eb4fb6c365b023cb4e4f898421ff4d4aba568fb2","amp;dn":"Star+Wars+Republic+Commando+Trilogy+%2B+2+Shortstories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb4fb6c365b023cb4e4f898421ff4d4aba568fb2","infoHashBuffer":{"type":"Buffer","data":[235,79,182,195,101,176,35,203,78,79,137,132,33,255,77,74,186,86,143,178]},"announce":[],"urlList":[]}}