{"title":"0rbitalis (Orbitalis) Alpha 6","uid":11549965,"size":75404076,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eb51257fc8a82bf09b05cc7c053ef00617c189cd&amp;dn=0rbitalis+%28Orbitalis%29+Alpha+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1416770068,"description":"&quot;0RBITALIS is a gravity simulator with a retro-puzzle flavor: explore stars, dodge asteroids and destroy planets. Launch your satellite into orbit and face the force which keeps the Universe together: Gravity. Study it. Trick it. Defeat it. All with a single click.&quot;\n\nAlpha 6 changelog:\nDaily challenges:\n- If you are familiar with games such as Spelunky, you'll know that they have a featured called daily challenge. A new level is procedurally generated every day, in such a way that it will be the same for all the players across the world. 0RBITALIS has now such a feature and it can be accessed directly from the title screen.\n- At the moment, a daily system can be chosen out of these four:\n- Standard systems: Similar to the first level of the game with a single star and multiple planets orbiting around it.\n- Multiple systems: Several stars, orbiting around each other. They have a high chance of turning into pulsars.\n- Planetary graveyards: Big asteroids orbiting in a dead system. Much like Koronis\n- Asteroid fields: Stranded asteroids flying in the interstellar medium. Similar to Sedna.\nNew interface:\n- The game has a new title screen, which is starting to look like a real menu. There have been lot of improvements to make the navigation between levels easier.\n- Title screen: It links directly to the last unsolved level, to the starmap and to the daily level.\n- ESC button: After so many requests, 0RBITALIS FINALLY uses the ESC button. Its effect depends on the context:\n- Title screen: Toggles the fullscreen mode.\n- Starchart: Returns to the title screen.\n- In game: Pops up the leaderboard screen.\n- Leaderboard screen: Returns to the starchart.\n- Mouse lag: YES! The long lasting issue which affects so many users has been finally fixed! Now the mouse clicks do not depends any more on the framerate... which make the control so much responsive. The game will still run slow on outdated machines, so you might want to select a lower quality with [Q] if that's your case.\nNew music:\n- It is a tradition that every update brings new music pieces. Alpha 6 is not an exception, including new tracks from the amazing Doseone! They are all featured in daily challenges, so let's go play them.\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttp://store.steampowered.com/app/278440/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/278440/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.0rbitalis.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.0rbitalis.com/&lt;/a&gt;\n\nSupport the people whose products you like!","torrent":{"xt":"urn:btih:eb51257fc8a82bf09b05cc7c053ef00617c189cd","amp;dn":"0rbitalis+%28Orbitalis%29+Alpha+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb51257fc8a82bf09b05cc7c053ef00617c189cd","infoHashBuffer":{"type":"Buffer","data":[235,81,37,127,200,168,43,240,155,5,204,124,5,62,240,6,23,193,137,205]},"announce":[],"urlList":[]}}