{"title":"Portable MFA in Creative Writin - New New York Writers Workshop","uid":9396234,"size":526535,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb63a0cc0d130118da621d1480bebf0dc3a12df3&amp;dn=Portable+MFA+in+Creative+Writin+-+New+New+York+Writers+Workshop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1387988759,"description":"Get the core knowledge of a prestigious MFA education without the tuition.\n\nHave you always wanted to get an MFA, but couldn't because of the cost, time commitment, or admission requirements?\n\nWell now you can fulfill that dream without having to devote tons of money or time. The Portable MFA gives you all of the essential information you would learn in the MFA program in one book. Covering fiction, memoirs, personal essays, magazine articles, poetry, and playwriting, this book provides you with:\n\nInspiration and tips on revision, stamina, and productivity\nClear instruction on the craft behind the art\nDetailed reading lists to expand your literary horizons\nExercises to improve your writing endeavors\nBy heeding the advice in The Portable MFA, you will gain the wisdom and experience of some of today's greatest teachers, all for just the price of a book.\n\nAbout the Author\n\nThe New York Writers Workshop is the only teacher-founded, teacher-run writing collective in New York City. It offers writing courses to writers of all levels on short stories, novels, non-fiction and other disciplines. The rapidly growing group also co-hosts a webzine at www.ducts.org and runs a monthly reading series.","torrent":{"xt":"urn:btih:eb63a0cc0d130118da621d1480bebf0dc3a12df3","amp;dn":"Portable+MFA+in+Creative+Writin+-+New+New+York+Writers+Workshop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb63a0cc0d130118da621d1480bebf0dc3a12df3","infoHashBuffer":{"type":"Buffer","data":[235,99,160,204,13,19,1,24,218,98,29,20,128,190,191,13,195,161,45,243]},"announce":[],"urlList":[]}}