{"title":"NuruMassage - Vanessa Cage, Kenzie Taylor (Once A Cheater Always","uid":12866831,"size":491316576,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:eba29d9e87105fe362facc60fb870cdeb25ec90f&amp;dn=NuruMassage+-+Vanessa+Cage%2C+Kenzie+Taylor+%28Once+A+Cheater+Always&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EndYou","files":1,"time":1448814059,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/g7\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Vanessa Cage, Kenzie Taylor\r\nName movie: Once A Cheater Always A Cheater\r\nNPP site and the site: NuruMassage.com / FantasyMassage.com\r\n\r\nYear: 2015\r\nGenre: Big Tits, Blowjob, Cum in Mouth, Deepthroat, Threesome, Hardcore, Massage, Nuru Gel, Family Roleplay, Step Sister\r\nDuration: 00:32:56\r\n\r\nKenzie Taylor is so in love with her new boyfriend Tyler Nixon, she can not stop talking about him to her step sister, Vanessa Cage. Things turn somewhat sour when both girls realize that they are actually dating the same guy! They know what they have to do, and that is to completely fuck with his head. Kenzie calls Tyler, letting him know she is at home alone and wants to give him a Nuru Massage like the last time. Tyler is so down with it, he hurries out of his bed and hits the road. Kenzie greets him at the door, wearing nothing but her sensual lingerie, and with her massive boobs popping out of her shirt. She removes his clothes, shoes and just when Tyler thinks all is perfect and ready for the massage, Vanessa makes her presence known, busting the cheating scalawag. He plays stupid, pretending to not know Kenzie's sister, but the jig is up, and he knows he is busted.\r\n\r\nHis punishment is to watch the two step sisters fuck one another, but he can not get in on the action, a true punishment for his unruly behavior. Vanessa and Kenzie lock lips, kissing their boobs, fondling their asses with Tyler in the background begging to be apart of the threesome but the sisters shut him up, not in any need of his help. Vanessa lays herself down on the Nuru bed, spreads her legs wide open for Kenzie to drench her in massage oil. Kenzie plays with her sister's pussy, teasing the poor boy as he watches in agony.Tyler feels useless and has no idea why hes even here in the first place taking so much of their crap. Vanessa orders him to stay, and throws him on the bed, unready to let him get off that easy. Their plan is so take full advantage of his cock just like he took advantage of them!\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 960x544 (16: 9) 29.97fps 1789kbps\r\nAudio: AAC 44100Hz stereo 192kbps","torrent":{"xt":"urn:btih:eba29d9e87105fe362facc60fb870cdeb25ec90f","amp;dn":"NuruMassage+-+Vanessa+Cage%2C+Kenzie+Taylor+%28Once+A+Cheater+Always","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eba29d9e87105fe362facc60fb870cdeb25ec90f","infoHashBuffer":{"type":"Buffer","data":[235,162,157,158,135,16,95,227,98,250,204,96,251,135,12,222,178,94,201,15]},"announce":[],"urlList":[]}}