{"title":"Islam.and.the.West.All.Episodes.HDTV.MVGroup","uid":10411534,"size":4529965711,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ec1a1f4435dc2fdd93c6d0481682c62a3e1525f3&amp;dn=Islam.and.the.West.All.Episodes.HDTV.MVGroup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1403542825,"description":"Islam and the West (2009)\n\nInformation:\nFor centuries, Islamic and Christian civilizations have coexisted, often peacefully. Yet recent factors have given rise to misunderstandings and have aroused animosities between the Middle East and the West. Through dramatic reenactments and interviews with theologians, historians and statesmen, this three-part series investigates the complex and dynamic relationships between these cultures. Discover how these warring faiths once coexisted and even thrived together and how they may one day chart a path towards a peaceful future.\n\nPart 1: A Prophet Changes the World\nMore than 14 centuries ago, a new religion was born when the Prophet Muhammad gave the world the Koran. But after his death, Muhammad could no longer influence how people would interpret his book nor the route it would take in history. Travel back in time to witness the early days of Islam, the fall of the Persian and Byzantine empires, and the wars that raged from within the Muslim community.\n\n\nPart 2: War and Wisdom\nFor 800 years, the Middle East owned the Middle Ages. Muslims' advances in medicine, machinery, philosophy and flight placed their culture head and shoulders above any other civilization on Earth. During this Islamic Golden Age, a short-lived time of peace and tolerance, the Middle East shared its inventions and innovations with the West. But war would soon be waged on the Islamic empire, as Christian Europeans invaded in the name of faith\n\n\nPart 3: The Challenge\nBy the 16th century, the Age of Discovery marked the end of Islam's 800-year rule over Europe. Islamic knowledge, art and science vanished in the centuries that followed, but not Islamic power. Explore the turbulent relationship between Islam and the West during the last 500 years, from the rise and fall of the Ottoman Empire to battles and betrayals involving historic icons such as Napoleon and Lawrence of Arabia. We end with the vibrant Islamic culture of today as it struggles to coexist in a world rife with mistrust and misconception.\n\nTechnical Specs\nVideo Codec: x264 ,AVC-1\nVideo Bitrate: CRF 20\nVideo Resolution: 1280x720\nVideo Aspect Ratio: 16:9\nAudio Codec: AC3\nAudio BitRate: 384 kbps\nAudio Streams: 2.0\nAudio Languages: English\nRunTime Per Part: 46 min\nNumber Of Parts: 1\nPart Size: 1.4 GB\nSource:","torrent":{"xt":"urn:btih:ec1a1f4435dc2fdd93c6d0481682c62a3e1525f3","amp;dn":"Islam.and.the.West.All.Episodes.HDTV.MVGroup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec1a1f4435dc2fdd93c6d0481682c62a3e1525f3","infoHashBuffer":{"type":"Buffer","data":[236,26,31,68,53,220,47,221,147,198,208,72,22,130,198,42,62,21,37,243]},"announce":[],"urlList":[]}}