{"title":"Pendragon Rising","uid":12922130,"size":30727662,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ec1a553fc3f524a25d3e1437ef494582057b7e00&amp;dn=Pendragon+Rising&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1449427369,"description":"Seize the throne in the age of King Arthur! Lead an army of Britons against the darkest of enemies in this epic interactive medieval fantasy novel.\r\n\r\n&quot;Pendragon Rising&quot; is a thrilling 112,000-word interactive novel by Ian Thomas, where your choices control the story. It's entirely text-based--without graphics or sound effects--and fueled by the vast, unstoppable power of your imagination.\r\n\r\nAs the bastard offspring of the aging ruler Pendragon, you’ll fight to save Britain from a demon-tainted enemy and claim the crown you deserve. Command an army as Arthur, brave son of Uther, or Arta, fearless daughter of Utta.\r\n\r\nCharge heroically to the front of battle, or use tricks to defeat your foes. Dally with your childhood companion, or seek romance elsewhere. Hold the line with your closest friends against foreign invaders and their sinister magics. Find friendship, forge alliances, uncover plots, and triumph over creatures of nightmare to win a future for your people and your kingdom.\r\n\r\nWill you be mercenary or merciful? Seductive or solitary? Most importantly, can you lead your allies to drive back the darkness, and seize your place as Pendragon of Britain?","torrent":{"xt":"urn:btih:ec1a553fc3f524a25d3e1437ef494582057b7e00","amp;dn":"Pendragon+Rising","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec1a553fc3f524a25d3e1437ef494582057b7e00","infoHashBuffer":{"type":"Buffer","data":[236,26,85,63,195,245,36,162,93,62,20,55,239,73,69,130,5,123,126,0]},"announce":[],"urlList":[]}}