{"title":"Anti-Higher Criticism - L.W. Munhall","uid":11773454,"size":16983302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ec9a2a2ec1b5b0b80d9ba05a43c27c8be8425f9c&amp;dn=Anti-Higher+Criticism+-+L.W.+Munhall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427168627,"description":"\nPreface:\n\nFor the past six years I have conducted a Bible Conference each summer by the seaside. It has been interdenominational in its character. The object has been the promotion of prayerful, critical, exegetical study of the Holy scriptures. God has given the Conference most signal tokens of his gracious favor. Because of the audacious and persistent assaults made upon the integrity of the Bible by many pastors, editors, theological professors, and other educators belonging to orthodox Churches, and because of the impudent assumption of these gentlemen that scholarship is almost wholly with them in their methods, work, and conclusions, I decided that the testimony of the last Conference should be directed against these assaults and assumptions.\nAfter careful and protracted consultation with a large number of brethren prominent in the councils and work of the Churches in this country, who without an exception approved of my plan.\n\nThe Conference met in Educational Hall, Asbury Park, N. J., August 1 1, 1893, and continued its sessions ten days. The sessions were attended by from two hundred to two thousand persons. First and last between three and four thousand persons, a large number being clergymen, were present.\nMany of the addresses were so scholarly, comprehensive, convincing, and satisfactory to honest and reverent minds that numerous requests were made by those who heard them that they should be published in book form.\n\nThis book is the result.\n\nThe volume is sent on its way with the sincere desire and earnest prayer that it may be owned of God in confirming many in their belief that the Bible is the infallible, life-imparting, hope-inspiring, unfailing word of the living God, and that many wavering and doubting ones may be helped to hereafter speak and teach &quot;as one that had authority, and not as the scribes.&quot;\n- L. W. MUNHALL\n\n\nAbout the author:\nSon of David Munhall and Abigail Rice Moore, Munhall was a Methodist evangelist. He married Mary Emily Thomas and had five children. Munhall did a fair amount of moving: In 1850 he was still in Zanesville, but he was in Mill Creek Township, Ohio, by 1860; Indianapolis, Indiana, by 1880; and from 1910 to 1930 he was in Philadelphia, Pennsylvania","torrent":{"xt":"urn:btih:ec9a2a2ec1b5b0b80d9ba05a43c27c8be8425f9c","amp;dn":"Anti-Higher+Criticism+-+L.W.+Munhall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec9a2a2ec1b5b0b80d9ba05a43c27c8be8425f9c","infoHashBuffer":{"type":"Buffer","data":[236,154,42,46,193,181,176,184,13,155,160,90,67,194,124,139,232,66,95,156]},"announce":[],"urlList":[]}}