{"title":"Aurelrtinez Garifuna Soul","uid":6076425,"size":334763474,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ed43e9878de2bee3ebd731041d4e9513bdb9c0d1&amp;dn=Aurelrtinez+Garifuna+Soul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ocnrf","files":14,"time":1293842913,"description":"Top 10 album and Afropop newcomer of the year award. \\&quot;Soul\\&quot; IS the word. The lead track, \\&quot;Santo Negro,\\&quot; sets the mood with a passionate a capela opener that goes into a percussion heavy mix of Garifuna drums and turtleshells. The sung Garifuna language sounds like nothing you\\'ve heard before. And for good reason. Garifuna is a unique creole mix of indigenous and African tongues. Several songs are set in clave rhythm, reflecting the Caribbean coastal Garifunas\\' intersection with Latin Central America. Half the songs are credited as \\&quot;traditional.\\&quot; Martinez\\'s international debut delivers a deeply satisfying and consistently superb set of songs that range from melancholy and langor to joyful uplift. --Afropop Worldwide\n\n\n\nThere s something very fresh and exciting about Aurelio Martinez take on the paranda music of the Garifuna people from Central America\\'s Caribbean coast. The haunting a capella intro of Santo Negro , with its simple call-and-response vocal owes a clear debt to Africa, especially the buzzing sound of the garaon (the Garifuna hand drums fitted with two metal strings over the head). Other tracks, meanwhile, highlight the Spanish-American influences on the music. Yau , with its slinky tenor sax and clave is a bolero that could feature in a Robert Rodriguez flick if it was sung in Spanish. All the traditional paranda elements are here tortoise-shell percussion, West African drum rhythms and acoustic guitar but Martinez manages to bring a contemporary twist to the mix. Martinez, a Honduran Garifuna, is the latest star to emerge from the stable of Stonetree Records, Belize s leading label. Stonetree was behind the launch of Andy Palacio, the king of punta rock, who brought electrified backing to souped-up versions of traditional punta rhythms. Palacio adds some of his own sparkle on Lumalali Limanga , a saxed-up dance track that comes on like a Dominican bachata. But that s part of the magic of this music, which evokes the Garifuna people s origins in the 17th century meeting of shipwrecked African slaves and Carib Indians on the island of Saint Vincent. The drums sound straight out of Africa and yet the language is basically Amerindian with a few African French, Spanish and English words thrown in. It really is like nothing you\\'ve ever heard before. \n\nSonglines Magazine ","torrent":{"xt":"urn:btih:ed43e9878de2bee3ebd731041d4e9513bdb9c0d1","amp;dn":"Aurelrtinez+Garifuna+Soul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed43e9878de2bee3ebd731041d4e9513bdb9c0d1","infoHashBuffer":{"type":"Buffer","data":[237,67,233,135,141,226,190,227,235,215,49,4,29,78,149,19,189,185,192,209]},"announce":[],"urlList":[]}}