{"title":"Uncle Al Capone - The Untold Story from Inside His Family","uid":8683278,"size":1857947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed7d9f3d39eece598ce0328523d3c6c41ae9a05b&amp;dn=Uncle+Al+Capone+-+The+Untold+Story+from+Inside+His+Family&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1373742393,"description":"The untold story from inside his family. Dramatic, unyielding, and provocative, Uncle Al Capone by Deirdre Marie Capone, Al Capone's grandniece, is a fascinating memoir and engaging biography. This moving, highly readable portrait of the Capone family and its mob trade examines what it has meant to survive the storied legacy of the family's forbearers. As Capone traces the arc of regret and what fuels the Capone myth, she finds redemption and a way to coexist with her legacy. In seventeen chapters with titles like &quot;The Making of the Mafioso,&quot; &quot;Trading the Chicago Outfit for the Chicago Cubs,&quot; and &quot;The Saint Valentine's Day Truth,&quot; Capone outlines organized crime in Chicago and offers vignettes of American history during the early and mid-twentieth century. Using years of research and exhaustive interviews with her aunts, uncles, and cousins, she weaves an engaging anecdotal narrative of what it meant to be a Capone, what it meant to lose her father to suicide, and what it meant to have a mother who lived in constant fear. She offers compelling evidence that Al Capone was specifically targeted for prosecution by law enforcement agencies assisted by the media, which made gross exaggerations of her uncle's exploits and fueled a phenomenon of half-truths and utter falsehoods. From the family's roots in Angri, Italy to the author's ongoing investigations today, this debut offers a comprehensive and moving portrait of an iconic American family and one woman's efforts to make peace with the past.\n &lt;a href=&quot;\nhttp://www.amazon.com/Uncle-Al-Capone-Untold-Inside/dp/0982845103/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373735044&amp;sr=1-1&amp;keywords=uncle+al+capone&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Uncle-Al-Capone-Untold-Inside/dp/0982845103/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373735044&amp;sr=1-1&amp;keywords=uncle+al+capone&lt;/a&gt;","torrent":{"xt":"urn:btih:ed7d9f3d39eece598ce0328523d3c6c41ae9a05b","amp;dn":"Uncle+Al+Capone+-+The+Untold+Story+from+Inside+His+Family","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed7d9f3d39eece598ce0328523d3c6c41ae9a05b","infoHashBuffer":{"type":"Buffer","data":[237,125,159,61,57,238,206,89,140,224,50,133,35,211,198,196,26,233,160,91]},"announce":[],"urlList":[]}}