{"title":"ClearRecord Premium - Noise Free Recorder with Play Speed Contro","uid":7761425,"size":1003811,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:edb58a19fa8292cac8fbb26488229cbad921ce1c&amp;dn=ClearRecord+Premium+-+Noise+Free+Recorder+with+Play+Speed+Contro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1351239922,"description":"ClearRecord is the ultimate voice recorder that features suppression of ambient noise during recording. ClearRecord also provides the ability to control playbackspeed without modifying pitch. ClearRecord uses AAC compression technology to allow for efficient storage of recordings (on iPhone 3GS, iPod touch 2G and later devices)\n\nThe advanced Ambient Noise Reduction (ANR) technology incorporated in ClearRecord allows the user to record conversations in typical everyday environments with a high level of background noise (street, train, airplanes, classrooms). A sophisticated signal processing algorithm reduces background noise levels in the recording, ensuring higher intelligibility even under harsh noise scenarios. Slow playbackspeeds makes it easier for transcription users and new language learners to slow down and listen clearly to a fast speaker, while Fast playbackspeeds cut short the time required to listen to a long recording without missing any part. Unique algorithms allow the application to retain the natural pitch of the recording even under slow and fast playback.\n\nThese unique features, along with the ability to use AAC audio compression to optimize disk memory space, make ClearRecord a must have for anyone interested in recording.\n\n\nHighlights\n\n* Noise free recordings in noisy environments such as traffic, airplanes, restaurants.\n* Play your recordings fast to quickly listen to a long lecture or speech, without missing any part\n* Play slow to suit your comfort level, while listening to fast speakers\n* Track repeat mode and Selective repeat mode [A-B] or Study mode\n* Save disk space using AAC audio compression. A one hour recording in less than 20 MB.\n\n-------------------------------------\nEdutige i-Microphone: EIM-001\n\nBoost recording performance on your iPhone/iPod/iPad with the Edutige i-Microphone!\ni-Microphone provides up to a 12dB increase in signal levels!\n\n[www.edutige.kr]\n[www.smartphonemics.com]\n-------------------------------------\n\nFeatures\n\n* Ambient Noise Reduction [ANR]: Suppresses ambient noise captured during recording\n* Play Speed Control: Playback recordings at speeds of 0.5x, 0.75x, 1.25x or 1.5x without modifying pitch quality\n* Track repeat mode\n* Selective repeat mode [A-B] or Study mode for listening selective part repeatedly\n* Sampling frequency of 16 kHz for voice recordings and 48 kHz for music recordings for high fidelity recording\n* AAC audio compression and uncompressed WAV: With AAC, a one hour recording requires only 20 MB of storage, as compared to 100 MB with uncompressed WAV - when recording at 16 kHz. Note that AAC recording is available on iPhone 3GS, iPod touch 2G and later devices.\n* Intuitive user interface for easy usage.\n* Transfer recordings to a computer through Wi-Fi using a simple web-browser interface.\n* Save recordings to computer through iTunes File Sharing section with devices using iOS 4 or later\n* E-mail recordings. Note that every device has an upper limit on the size of e-mail attachment.\n* Quick Record mode to start recording immediately on launch\n* Essential features like pause a recording, rename, seek and delete a recording\n* Volume level indicator while recording\n* Add recordings done with ClearRecord Lite or ClearRecord on other phones and devices into your app through iTunes.\n\n\nPremium version\n\n* Supports play speeds of 0.5x and 1.5x in addition to 0.75x and 1.25x speeds\n* ANR can be turned ON during recording to get noise-free recordings.\n* Track repeat mode and Selective repeat mode [A-B] or Study mode\n\n\nSystem Requirements\n\n* iPod Touch requires a separate microphone for recording\n* AAC recording available on iPhone 3GS and iPod touch 2G and later devices\n* For Wi-Fi transfers of recordings, the computer and the mobile device need to be on the same LAN.\n* Tested with iOS 4.x","torrent":{"xt":"urn:btih:edb58a19fa8292cac8fbb26488229cbad921ce1c","amp;dn":"ClearRecord+Premium+-+Noise+Free+Recorder+with+Play+Speed+Contro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edb58a19fa8292cac8fbb26488229cbad921ce1c","infoHashBuffer":{"type":"Buffer","data":[237,181,138,25,250,130,146,202,200,251,178,100,136,34,156,186,217,33,206,28]},"announce":[],"urlList":[]}}