{"title":"Harbinson-Projekt Saucer 3-Genesis (nazi flying saucers)","uid":4480785,"size":2037574,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee828e1a387b12dece10c20e343aca5dad2d4732&amp;dn=Harbinson-Projekt+Saucer+3-Genesis+%28nazi+flying+saucers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1225559455,"description":"This is W.A. Harbinson&amp;#039;s mindblowing SF novel Projekt Saucer Book 3 - Genesis (1995) which continues the epic story of the American-Nazi secret flying saucer project into the years after World War II, uncovering in the process a nightmare web of secret scientific experimentation and the collusion of the super-power governments with the horrific organization responsible. The core idea of Projekt Saucer (spanning 5 books in total) revolves around an Earth-based source for flying saucers or UFOs. Rather than blaming them on aliens, the flying saucers are created by an awesome conspiracy, created by a doctor named Wilson (as people used to nickname first UFOs that appeared throughout USA). In Inception and Phoenix, the first two novels of the astounding Projekt Saucer sequence, Harbinson traced the origins of the alarming global conspiracy behind the sinister UFO phenomenon. Now, in Genesis, the reader is plunged into icy new dimensions of terror as he exposes the next moves of this horrific cabal to enslave and subvert humanity as we know it and turn life on Earth into a chilling nightmare of living death. You will enter a world of nightmarish global conspiracy and perverted super-science that will both horrify and fascinate you as you will see the hidden forces of technological evil massing to obliterate those who threaten to expose their appalling existence. And, in the novel&amp;#039;s totally unexpected and chilling climax, you will witness one of the most powerful testaments to the strength of the human spirit in adversity ever to appear in a work of fiction. If you can imagine H.G. Wells&amp;#039; War of the World combined with Jules Verne&amp;#039;s captain Nemo-like personalities and super-duper technology then you simply can&amp;#039;t afford to miss this mindblowing series. The Projekt Saucer series has become a cult favourite through the years although no movie was ever made about it. Probably because it&amp;#039;s simply too close to the chilling reality. If you have ever seen movies like X-Files, War of the worlds and others this book series easily dwarfs them all as facts and fiction blend together to create an unique and above all - nightmarish world of the future. 605 pages. A must read for everyone. More info on the whole series: http://www.inkdigital.org/harbinson/project.htm\n","torrent":{"xt":"urn:btih:ee828e1a387b12dece10c20e343aca5dad2d4732","amp;dn":"Harbinson-Projekt+Saucer+3-Genesis+%28nazi+flying+saucers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee828e1a387b12dece10c20e343aca5dad2d4732","infoHashBuffer":{"type":"Buffer","data":[238,130,142,26,56,123,18,222,206,16,194,14,52,58,202,93,173,45,71,50]},"announce":[],"urlList":[]}}