{"title":"Idiot's Guides - Algebra I - Carolyn Wheater","uid":11996432,"size":20106030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efb2ae39604790d97ef13bcd8c3bde854202b3bd&amp;dn=Idiot%27s+Guides+-+Algebra+I+-+Carolyn+Wheater&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433636471,"description":"Perhaps no subject strikes so much fear in the hearts of high school and college students as algebra, the complex but mandatory math discipline that seems to bear little relevance to everyday life. Starting with the very basics and reinforcing concepts with practice and tips along the way, Idiot's Guides: Algebra I makes a complex subject easier to grasp and helps students and adult learners clear the hurdle that can stand between them and their academic goals. With Common Core instruction in mind, readers get:\n\n-- A natural transition from basic math to algebra, with a review of relevant concepts and operations.\n\n-- An introduction to linear equations and functions, including graphing and inequalities.\n\n-- Explanations of how to solve absolute-value equations and radical equations.\n\n-- Instructions on how to perform operations on polynomials, and factoring.\n\n-- An exploration of how to work with quadratic equations and quadratic functions; and rational expressions, equations, and functions.\n\n-- Special sidebars pointing out the reasoning behind the techniques, which is an essential part of Common Core instruction.\n\n-- Separate workbook section of extra Algebra practice problems-like getting two books in one!","torrent":{"xt":"urn:btih:efb2ae39604790d97ef13bcd8c3bde854202b3bd","amp;dn":"Idiot%27s+Guides+-+Algebra+I+-+Carolyn+Wheater","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efb2ae39604790d97ef13bcd8c3bde854202b3bd","infoHashBuffer":{"type":"Buffer","data":[239,178,174,57,96,71,144,217,126,241,59,205,140,59,222,133,66,2,179,189]},"announce":[],"urlList":[]}}