{"title":"EnigmaT Set Rips { Cuts } - November 26th, 2013","uid":9251084,"size":748161934,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f0178c2e293865bac05e278799a0bbdfcdee2288&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+26th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":91,"time":1385461412,"description":"2 Brothers on the 4th Floor - Fly (Jaz von D Remix) (Cut From Bolier Set)-enTc.mp3\n3rd Moon - DNA (Amir Hussain &amp; Alan Ruddick Remix) (Cut From Photographer Set)-enTc.mp3\n3rd Moon - DNA (Amir Hussain &amp; Alan Ruddick Remix) (Cut From Saux Set)-enTc.mp3\n8 Mirrors - Breeze (Project Re-Beat Remix) (Cut From Above Clouds Set)-enTc.mp3\nAbandoned Rainbow - Ethereal (BluSkay Remix) (Cut From Above Clouds Set)-enTc.mp3\nAbandoned Rainbow - Forgotten Dreamer (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nAbandoned Rainbow - When I Saw You (Original Mix) (Cut From Sty Set)-enTc.mp3\nAeden - Memorable feelings (K-narf Remix) (Cut From Sty Set)-enTc.mp3\nAeden - Nothing (Original Mix) (Cut From El Jay Set)-enTc.mp3\nAgnelli &amp; Nelson pres. AN Project - New Light (Protoculture Remix) (NEW Cut From Shah Set)-enTc.mp3\nAlex Ender - Phoria (Original Mix) (Cut From GO Set)-enTc.mp3\nAlexey Ryasnyansky - Paper Flower (Andy Elliass Remix) (NEW Cut From Saux Set)-enTc.mp3\nAllen &amp; Envy - The Cry Within (A &amp; Z Remix) (Cut From Taylor Set)-enTc.mp3\nAlter Future - The Night Sky (Alex Ender Remix) (-OvErSpAmMeD- Cut From Feel Set)-enTc.mp3\nAnden State - Unizus (BluSkay Remix) (Cut From Sty Set)-enTc.mp3\nAnxess - Faith (Original Mix) (Cut From El Jay Set)-enTc.mp3\nAnxess - Shake It (Original Mix) (Cut From Feel Set)-enTc.mp3\nArmin van Buuren feat. Richard Bedford - Love Never Came (Skytech Remix) (Cut From Driftmoon Set)-enTc.mp3\nAruna - Reason To Believe (Aruna's Chill Out Mix) (Cut From Estiva Set)-enTc.mp3\nAruna - Reason to Believe (Red Room Acoustic Mix) (Cut From Tydi Set)-enTc.mp3\nAruna - Reason To Believe (Speed Limits Remix) (Cut From Moor Set)-enTc.mp3\nAvail - The Awakening (UDM Euphoric Remix) (Cut From Above Clouds Set)-enTc.mp3\nAWD - Summer's End (Original Mix) (Cut From Holland Set)-enTc.mp3\nAzima feat. Victoria Ray - Not The Same (Ucast Dub Mix) (Cut From Feel Set)-enTc.mp3\nBastian Salbart - Run (Original Mix) (Cut From Ried Set)-enTc.mp3\nBeat Anatomy - Black Hole (Cut From Haig Set)-enTc.mp3\nBobina &amp; Vigel - Rave One (Cut From Bobina Set)-enTc.mp3\nBram Troost - Tagomago (Cut From Estiva Set)-enTc.mp3\nBrutal Kids feat. Aline - Stones (Cut From Tydi Set)-enTc.mp3\nCarl Fath - Humans Cry (Starchaser Dub Mix) (Cut From Datt Set)-enTc.mp3\nCedric Gervais &amp; CID - Never Come Close (Original Mix) (Cut From Vegas Set)-enTc.mp3\nChicane - Windbreaks (Walsh &amp; McAuley Remix) (Cut From Datt Set)-enTc.mp3\nChuckie &amp; Glowinthedark - NRG (Original Mix) (Cut From Vegas Set)-enTc.mp3\nCurtis Young - Second Attempt (Matt Skyer Remix) (Cut From Fady Set)-enTc.mp3\nDaniel Wanrooy - That Moment (Cut From Bolier Set)-enTc.mp3\nDanny Avila - Poseidon (Cut From W&amp;W Set)-enTc.mp3\nDanny Avila - Poseidon (Original Mix) (Cut From Vegas Set)-enTc.mp3\nDanny Berland - Finale (Original Mix) (Cut From Imagin Set)-enTc.mp3\nDemi Lovato - Neon Lights (Cole Plante with Myon &amp; Shane54 Dub Mix) (ABGT 054 Rip)-enTc.mp3\nDimension &amp; Ultimate - Corazon (Original Mix) (Cut From Ried Set)-enTc.mp3\nDimitri Vegas &amp; Like Mike - Chattahoochee (Tomorrowland 2013 Anthem) (DubVision Remix) (Cut From Vegas Set)-enTc.mp3\nDJ Feel - It Comes (Violin Version) (Cut From Feel Set)-enTc.mp3\nDJ Ghost - Are You Ready (Original Mix) (Cut From Vegas Set)-enTc.mp3\nDmitry Bulakov - The Storm (Aikos remix) (Cut From Defcon Set)-enTc.mp3\nDriftmoon - Cama (Original Mix) (Cut From Driftmoon Set)-enTc.mp3\nDyro feat. Radbound - You Got To Know (Cut From W&amp;W Set)-enTc.mp3\nEDX &amp; Leventia - The Tempest (Cut From Bolier Set)-enTc.mp3\nEDX - Reckless Ardor (ABGT 054 Rip)-enTc.mp3\nEtasonic - Wonder Of This Planet (Rapid Dissension Remix) (Cut From Above Clouds Set)-enTc.mp3\nEximinds - Good Morning (Original Mix) (Cut From Photographer Set)-enTc.mp3\nHesham Watany - Juggernaut (Original Mix) (Cut From GO Set)-enTc.mp3\nIllitheas pres. Mavi - Blue Dragonfly (Robbie Seed Remix) (Cut From Sty Set)-enTc.mp3\nIncipit Q - The Contrary (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nInvalyd feat. Polina - Never Coming Down (Rafael Frost Dub) (Cut From Moor Set)-enTc.mp3\nJarkko S - Futurisco (Cut From Ost Set)-enTc.mp3\nJAXXON - Hoodrat (Cut From W&amp;W Set)-enTc.mp3\nJoop &amp; Sherano feat. MC Stretch - Right Here, Right Now (Cut From Bolier Set)-enTc.mp3\nJustin Prime &amp; Sidney Samson - Thunderbolt (Original Mix) (Cut From Vegas Set)-enTc.mp3\nKiran M Sajeev - Dear For You (Alexsey Ryanyansky Remix) (Cut From Defcon Set)-enTc.mp3\nKross &amp; Fader - Road To Rome (Original Mix) (Cut From Sty Set)-enTc.mp3\nLee Osborne - TEO (Cut From Ost Set)-enTc.mp3\nLee Osborne - Tunnel Vision (Original Mix) (Cut From Sherry Set)-enTc.mp3\nMaestro Mix - Epical Lava (Original Mix) (Cut From Shah Set)-enTc.mp3\nMarcus Schossow, Mike Hawkins, Pablo Oliveros - Ulysses (Original Mix) (Cut From Vegas Set)-enTc.mp3\nMark Bester &amp; Love Dimension- The Voice (Sunset Remix) (Cut From OzzyXPM Set)-enTc.mp3\nMat Zo - Lucid Dreams (The M Machine Remix) (Cut From Estiva Set)-enTc.mp3\nMichael Woods - The Pit (The Zombie Kids Remix) (Cut From Kihlom Set)-enTc.mp3\nMindset - Jakarta 2013 (Cut From Moor Set)-enTc.mp3\nMindset - Luv Connection (Cut From Datt Set)-enTc.mp3\nMindset - Paragon (Cut From Datt Set)-enTc.mp3\nMiquel - Dreams of the Titans (Christian Cambas Remix) (Cut From Sherry Set)-enTc.mp3\nNERVO &amp; Ivan Gough featuring Beverley Knight - Not Taking This No (Yves Larock Remix) (Cut From Vegas Set)-enTc.mp3\nNX-Trance - XCite (Several Spirits Remix) (Cut From Spirits Set)-enTc.mp3\nOpus III - Fine Day (Leon Bolier 2013 Bootleg) (Cut From Bolier Set)-enTc.mp3\nParis Blohm - Goliath (Cut From W&amp;W Set)-enTc.mp3\nPaul Surety - Influence (O.B.M Notion Remix) (Cut From Above Clouds Set)-enTc.mp3\nRon Alperin - Sands Of Time (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nRon Alperin - Sands Of Time (Original Mix) (Cut From Shah Set)-enTc.mp3\nRonny K. &amp; Michael Flint - La Luna (Andy Elliass Remix) (Cut From Saux Set)-enTc.mp3\nSean Mathews - Crossroads (Original Mix) (Cut From Feel Set)-enTc.mp3\nSmartrunner - Back In The Love (George Kamelon Remix) (Cut From Feel Set)-enTc.mp3\nSoulu - Suprema (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nStarkillers &amp; Inpetto - Game Over (Original Mix) (Cut From Vegas Set)-enTc.mp3\nT.O.M. - Highway Red (P.H.A.T.T. Remix) (Cut From GO Set)-enTc.mp3\nTictoes feat. Debbie-Ellen - Burn My Soul (Burak Harsitlioglu Remix) (Cut From Bonsall Set)-enTc.mp3\ntyDi feat. Carmen Kiegans - Live This Lie (Cut From Tydi Set)-enTc.mp3\nVato Gonzalez - Triplets Riddim (Original Mix) (Cut From Vegas Set)-enTc.mp3\nVitodito - Menorca (ABGT 054 Rip)-enTc.mp3\nWiwek &amp; Cesqeaux - Ritual (Original Mix) (-Sample- Cut From Vegas Set)-enTc.mp3\nZiggy &amp; Dave Till - Venom (Original Mix) (Cut From Vegas Set)-enTc.mp3\nZuubi - Miss You (Original Mix) (Cut From Velden Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:f0178c2e293865bac05e278799a0bbdfcdee2288","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+26th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0178c2e293865bac05e278799a0bbdfcdee2288","infoHashBuffer":{"type":"Buffer","data":[240,23,140,46,41,56,101,186,192,94,39,135,153,160,187,223,205,238,34,136]},"announce":[],"urlList":[]}}