{"title":"Gramophone magazine - April 2014 [classical music]","uid":9863177,"size":36927943,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f05dd182eda32cdb132dcff79963b3956e90f2bb&amp;dn=Gramophone+magazine+-+April+2014+%5Bclassical+music%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1396316173,"description":"Gramophone magazine (April 2014)\n\nISSN: 0017-310X | 164 pages | PDF\n\n\nGRAMOPHONE is a magazine published monthly in London and devoted to classical music, particularly recordings. Packed with features across all classical music genres, its globally acclaimed writers inform and entertain you with independent and intelligent editorial and more than 150 reviews in every issue. Gramophone's reputation is founded on its acclaimed critical analyses of the latest CD releases, in-depth features and interviews with classical stars, and its comprehensive coverage of recorded and live music.\n\nIN THE APRIL ISSUE: As Decca releases a box-set of Luciano Pavarotti's first decade of recordings, Pulitzer Prize-winning writer Philip Kennicott charts the tenor's progress from callow artist to self-sustaining singer; Philip Clark meets the team behind the recording of a new reduced arrangement of Bruckner's Second Symphony by Antony Payne; James Jolly speaks to conductor David Zinman about his 20 years at the helm of Zurich's Tonhalle Orchestra; Jennifer Pike illuminates the score of Sibelius's fearsome Violin Concerto; Jeremy Nicholas surveys the career of the one-of-a-kind organ phenomenon Virgil Fox; Van Cliburn's 1958 recording of Tchaikovsky's First Piano Concerto is the cause of a difference of opinion between Jed Distler and Jeremy Nicholas; and Gramophone's annual Summer Festivals Guide -- the perfect introduction to the best classical and opera festivals worldwide in 2014!\n\n________________________________________________________________________\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:f05dd182eda32cdb132dcff79963b3956e90f2bb","amp;dn":"Gramophone+magazine+-+April+2014+%5Bclassical+music%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f05dd182eda32cdb132dcff79963b3956e90f2bb","infoHashBuffer":{"type":"Buffer","data":[240,93,209,130,237,163,44,219,19,45,207,247,153,99,179,149,110,144,242,187]},"announce":[],"urlList":[]}}