{"title":"Pharmacology (three books)","uid":5402889,"size":74582863,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1396021fa4e3b8abf0954259cd83dc343bd2ffd&amp;dn=Pharmacology+%28three+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timnehguy","files":4,"time":1267486330,"description":"These are all in PDF format:\n\nPharmacology for the Health Care Professions - 385 pp.\nThis is an accessible introduction to the pharmacology necessary for health care professionals training to be non-medical prescribers. The book covers the pharmacology necessary for accredited training program in non-medical prescribing and certification in access and supply of prescription-only medicines and will be useful as an ongoing reference for future use in practice. \n\nPharmacotherapy - 2597 pp.\nThis remains a gold standard pharmacotherapy text and is an important resource for teaching or practicing optimal pharmacotherapy. Educators and students will find it indispensable. Practitioners can rely on it as a reference and to advance their knowledge and skills. The authors have created a definitive scholarly resource designed to provide optimal pharmacotherapy.\n\nThe Goodman and Gilman Manual of Pharmacology and Therapeutics - 1230 pp.\nThis manual extracts the essential core drug information from the eleventh edition of the parent book, referring the reader to the online version of the parent book for historical aspects, many chemical and clinical details, and additional figures and references. This makes G &amp; G a very useful book. Readers can use this easy to handle and read manual for essential information along with the online version of the parent book as a reference for more in-depth specific information on drugs. \n\nCheck my torrents for other medical reference works.  Please seed.","torrent":{"xt":"urn:btih:f1396021fa4e3b8abf0954259cd83dc343bd2ffd","amp;dn":"Pharmacology+%28three+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1396021fa4e3b8abf0954259cd83dc343bd2ffd","infoHashBuffer":{"type":"Buffer","data":[241,57,96,33,250,78,59,138,191,9,84,37,156,216,61,195,67,189,47,253]},"announce":[],"urlList":[]}}