{"title":"Open Sea! Go Down Mo! v2.1.2","uid":8951821,"size":20802282,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:f262d66874ee2888d55adc5520e8c42844db6786&amp;dn=Open+Sea%21+Go+Down+Mo%21+v2.1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1379902580,"description":"\nMo works as a prophetic leader in Pharao's Egypt. He urges the people to flee accross the sea... by foot.\nTouch the sea to part it open, swipe, shake your smartphone to flood everything, and tap the screen to strike lightning bolts!\n\nJourney through the whole country to the promised land, on sixty paced, smart, action-packed, or puzzle missions, and five unlockable Challenge games... Lead hilarious people: panicked girls, sleepy sloths, slower elders, zigzaging drunkards, dumbs who turn back... Repel evil ships and shock mummies and wicked wizards!\n\nYour adventure will let you cross heroes' path, who will join the people and help them with miracles, like Jess who allows people to walk on water... And Abe, the Lovers, or El, whose miracle will allow you to turn villains back to ashes! And last but not least, take control of the legendary Nono's Ark...\n\nA unique and highly addictive action/puzzle/timing game for everyone, easy to grasp, but it will challenge your dexterity and tickle your brain the more you progress in the adventure.\n\nFantastic stylized graphics, refreshing addictive gameplay both simple and deep, funny and cute characters, humor, and catchy soundtracks, are what you will get in this game... of biblical dimension!\n\nGame features:\n\n- Acclaimed game design, graphics, and sfx\n- Innovative, intuitive and addictive game mechanics designed for hand-held touch screens\n- 60 original missions\n- Crisp HD visuals\n- 6 hilarious kinds of people\n- 5 Heroes with exciting miracles and upgrades to help the people\n- 3 kinds of foes, each requiring specific strategy to deal with\n- Campaign mode evolving through the map of your People's journey, with stars collecting and optional paths\n- 5 Challenge games: &quot;Crossing of the Dead&quot;, &quot;Save 'Em All&quot;, &quot;Sacred Land&quot;, &quot;Time Trial&quot; and &quot;Time Trial Extreme&quot;\n- Online leaderboards with Scoreloop (requires two authorizations)\n- Win real gifts with all new Giftiz!\n\nFun fact: God is friendly and stars as is in Open Sea! (Only once, when He had a very bad day He wreaked havoc upon Sodom and Gomorrah and the tower of Babel, rising too close.)\n\nFun disclaimer: Open Sea! is an original creation from indie studio The Pixelizers. Any similarity to actual religious prophets like Moses, Jesus, Abraham, Eli, or to Bible events and legends known as Adam and Eve, Noah, the Exodus or the crossing of the Red Sea, is purely coincidental...\nor quite.\n\nWhat's New:\n\n2.1:\n- Vox Populi Vox Dei\n- Worldmap Tune Hast Been Reorchestrated: No Flute Anymore\n- Gates Shall Demand Less Stars\n2.1.2:\n- Icon issue fixed on Nexus 10\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.thepixelizers.android.opensea.ui&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.thepixelizers.android.opensea.ui&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f262d66874ee2888d55adc5520e8c42844db6786","amp;dn":"Open+Sea%21+Go+Down+Mo%21+v2.1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f262d66874ee2888d55adc5520e8c42844db6786","infoHashBuffer":{"type":"Buffer","data":[242,98,214,104,116,238,40,136,213,90,220,85,32,232,196,40,68,219,103,134]},"announce":[],"urlList":[]}}