{"title":"Encyclopedia of Islam - 1st Edition (Facts on File) (2009).pdf ","uid":12022290,"size":142277377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f51ee112931ea1ccc410629d1ac61b361b57c37b&amp;dn=Encyclopedia+of+Islam+-+1st+Edition+%28Facts+on+File%29+%282009%29.pdf+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1434462896,"description":"Pages: 750 \nPublisher: Facts on File; 1 edition (February 2009)\nLanguage: English\nISBN-10: 0816054541\nISBN-13: 978-0816054541\n\n&quot;Encyclopedia of World Religions&quot; is a new series from &quot;Facts On File&quot; that explores the major religions of the world, emphasizing the living faiths and their historical and social background. Each volume was written by an expert in the field, and reviewed and approved by series editor, J. Gordon Melton. Ideal for high school and junior college students, these authoritative references are accessible enough to be of use to the general reader as well as the serious scholar. Each volume includes approximately 600 A-to-Z entries that provide easy access to the theological concepts, personalities, historical events, institutions, and movements that helped shape the history of each religion and the way it is practiced today. Fascinating introductions by each author place the religion in context, and further readings, a bibliography, an index, and approximately 80 black-and-white photographs complete these invaluable resources.\n\nAbout the Author\n\nJuan E. Campo is associate professor of religious studies at the University of California in Santa Barbara. Specializing in Islam, he holds a Ph.D. in the history of religions from the University of Chicago. His publications include the award-winning The Other Sides of Paradise: Explorations into the Religious Meanings of Domestic Space in Islam. --This text refers to the Paperback edition","torrent":{"xt":"urn:btih:f51ee112931ea1ccc410629d1ac61b361b57c37b","amp;dn":"Encyclopedia+of+Islam+-+1st+Edition+%28Facts+on+File%29+%282009%29.pdf+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f51ee112931ea1ccc410629d1ac61b361b57c37b","infoHashBuffer":{"type":"Buffer","data":[245,30,225,18,147,30,161,204,196,16,98,157,26,198,27,54,27,87,195,123]},"announce":[],"urlList":[]}}