{"title":"Full Blast - Black Hole (2008)","uid":6391820,"size":348770473,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f5f9bef6d2476456b3be70dd9937bae54833ad4d&amp;dn=Full+Blast+-+Black+Hole+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mariorg","files":-1,"time":1305334493,"description":"Atavistic Records: ALP187 &lt;a href=&quot;\nhttp://www.atavistic.com/albums.php?id=473&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.atavistic.com/albums.php?id=473&lt;/a&gt;\n\n* Peter BrÃƒÂ¶tzmann: b-flat clarinet, tarogato, alto saxophone, tenor saxophone\n* Marino Pliakas: electric bass\n* Michael WertmÃƒÂ¼ller: drums\n\n- http://www.peterbroetzmann.com/\n- http://www.marinopliakas.com/\n- http://www.michaelwertmueller.com/\n\n01. Black hole (02.27)\n02. Suzy (03.40)\n03. Ellis (06.27)\n04. Alice (03.42)\n05. String (03.01)\n06. Atlas (06.26)\n07. Protoneparcel (10.35)\n08. Higgs (04.27)\n09. Teilchencrash (02.32)\n10. Large Hadron Collider (05.57)\n11. Quarks up/down (03.07)\n\nReviews\n~~~~~~~\nBy Garnaalpisser - Ã‚Â© stef &lt;a href=&quot;\nhttp://freejazz-stef.blogspot.com/2009/12/sax-trios.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freejazz-stef.blogspot.com/2009/12/sax-trios.html&lt;/a&gt;\n\nRecorded in March 2008 at Radio Studio ZÃƒÂ¼ric, the titel of the album defines the\nmusic quite well, although on the second track, &quot;Suzy&quot;, BrÃƒÂ¶tzmann plays quite\nsoftly, melodically and sensitively over the wild powerful bass of Marino\nPliakas and the unrelenting drumming of Michael WertmÃƒÂ¼ller. But don't worry,\nBrÃƒÂ¶tzmann fans will find plenty to enjoy here, but it must be said, the quieter\nparts, as on &quot;String&quot;, or on &quot;Protoneparcel&quot; on which he plays tarogato suit him\nquite well, showing a more sensitive and subtle face. All track titles are\nrelated to the extreme experiments of particle physics that took place at CERN\nin Switzerland last year, in search of the Higgs Boson particle, an experiment\nwhich, some claimed, could have devastating results including the creation of a\nblack hole in which everything (EVERYTHING!) would disappear, an inspiring\nconcept to BrÃƒÂ¶tzmann, Pliakas and WertmÃƒÂ¼ller, who are the ideal band to\naccompany this event, in analogy to the string ensemble that kept playing while\nthe Titanic went down. Strong double CD!\n\n\nCERN &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/CERN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/CERN&lt;/a&gt;\n\n\nBy Thom Jurek &lt;a href=&quot;\nhttp://www.allmusic.com/album/black-hole-r1466358&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/black-hole-r1466358&lt;/a&gt;\nThe Full Blast trio includes Peter &quot;Superlungs&quot; BrÃƒÂ¶tzmann on reeds and winds,\nelectric bassist Marino Pliakas, and drummer Michael WertmÃƒÂ¼ller. The trio issued\nan intense workout that was recorded in 2006 on the German Jazzwerkstatt imprint\nand featured five untitled improvisations. This second offering was recorded at\nRadio Zurich over two days in March of 2008. By contrast, there are 11 pieces\nhere, the vast majority structured almost like proper tunes -- yes, they are\ntitled -- and range from two and half to six and a half minutes, most of them on\nthe shorter side of the scale. There is one long workout entitled\n&quot;Protoneparcel&quot; in the middle of the recording. Whereas Full Blast's self-titled\ndebut felt very much like a BrÃƒÂ¶tzmann solo offering with sidemen, this date\nfeels very much like a collaborative effort. The relative comfort of the\nindividuals with one another is quite amazing, given the powerful musical\npersonality of BrÃƒÂ¶tzmann. The electric bass of Pliakas is the real glue in these\nproceedings: it has enough of a dynamic range to actually engage the different\nsides of the saxophonist's nature. WertmÃƒÂ¼ller is a drummer of extreme dexterity\nand range, though his muscular approach to the kit recalls both Milford Graves\nand a younger Billy Cobham. His rim shots, which occur with constancy, are\nactually a trademark.\n\nPerhaps it's because of the flexible but powerful nature of the rhythm section\nthat BrÃƒÂ¶tzmann is able to engage different aspects of his other side -- B-flat\nclarinet is played as much as the tenor saxophone, and his alto and a tarogato\nare heard here with regularity as well. The set kicks off with the title track,\na brief wall of skronk that recalls BrÃƒÂ¶tzmann's days with Last Exit (minus the\nguitar, of course), but the hyper-rolling bassline of Pliakas is amazing -- he\nsounds more like a speed metaller than a vanguard jazzist. But the shimmering\nsnare breaks that kick off &quot;Suzy,&quot; with popping basslines under every one of\nWertmÃƒÂ¼ller's phrases, usher in a very restrained BrÃƒÂ¶tzmann on clarinet and hint\nthat there is something different afoot. No matter how intense the rhythm\nsection becomes, BrÃƒÂ¶tzmann remains focused on his constructed and very\nrestrained melody even as his tones grow longer and shift registers. The knotty,\nintricate polysyllabic scalar line that introduces &quot;Alive&quot; is at a furious\ntempo, but it feels more like mutant bebop with a nearly discernible &quot;melodic&quot;\nline through the first couple of minutes, even as Pliakas gets near funky in his\nbass runs. The shifts, canards, and tricks go on for the entire record,\nproviding plenty in this vanguard free jazz fest for you to sink your ears into\nover and over again. This is free music at its best: fire, fun, and further\nexploration of the heretofore unknown.","torrent":{"xt":"urn:btih:f5f9bef6d2476456b3be70dd9937bae54833ad4d","amp;dn":"Full+Blast+-+Black+Hole+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5f9bef6d2476456b3be70dd9937bae54833ad4d","infoHashBuffer":{"type":"Buffer","data":[245,249,190,246,210,71,100,86,179,190,112,221,153,55,186,229,72,51,173,77]},"announce":[],"urlList":[]}}