{"title":"Chester French &amp; Clinton Sparks Present: Jacques Jams, Vol 1: En","uid":4838416,"size":91190316,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f6010fcf48b4e85d3f9135ab3907daeacc4a227e&amp;dn=Chester+French+%26+Clinton+Sparks+Present%3A+Jacques+Jams%2C+Vol+1%3A+En&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"las311","files":-1,"time":1239405849,"description":"It's 5am and we're sitting in our tour bus with the lights dimmed finalizing mixes while we write this email and invite you to finally check out the first new music we've released since 2007. First, we'd like to thank you for helping us get this far. We started Chester French in 2003, during our freshman year of college, and the past six years have been a remarkable journey. \n\nOn April 21, we'll be releasing our full-length debut album, &quot;Love the Future,&quot; a record that we began more than four years ago. We hope that with that release we'll be able to convert millions of music fans into Chester French supporters. But you've been with us from the start, so we wanted to give you a special gift today: a totally free full-length album. Welcome to &quot;Jacques Jams, Vol. 1: Endurance.&quot; \n\nLast year DJ Clinton Sparks came to us with an offer to make a Chester French mixtape. While we appreciated his enthusiasm (and peerless physique), we wanted &quot;Love the Future&quot; to be the World's first taste of CF. A few months ago, though, we caved to Clinton's relentless advances and agreed to work on a project with him, but only if it would be more than a mixtape. Since then we've had an amazingly fun time making the free album that you're about to experience. \n\n&quot;Jacques Jams, Vol. 1: Endurance&quot; is a chronicle of the past six years of our lives. It tells our story, from the gymnasiums of Harvard to the hills of Hollywood. Unlike &quot;Love the Future,&quot; which we've written, arranged, performed, produced, and engineered by ourselves, &quot;Jacques Jams&quot; features a collection of new, original music that we created in the hills of Massachusetts and then invited some of our favorite artists to grace. \n\nAs young artists, we couldn't be more grateful for this opporunity to collaborate with legends like Jermaine Dupri, Diddy, Pharrell, Pusha, Talib Kweli, Bun B., The Mad Rapper, Kardinal Offishall, N.O.R.E, and Jadakiss as well as younger friends like Janelle Monae, Cassie, Wale, Solange, Lady Gaga, and Mickey Factz. All of these fantastic artists have been more than generous with their creativity and hard work, so we owe them an enormous debt. Clinton Sparks, above all, has tirelessly guided us toward success and endurance, a tall order with obnoxious perfectionists like us! We'd also like to thank Clinton's manager, Daouda Leonard, for his endless help and beautifully manicured beard.  \n\nNow CLICK HERE TO DOWNLOAD &quot;Jacques Jams, Vol. 1: Endurance.&quot;  \n\nThe next month will be pivotal as we put out &quot;Love the Future&quot; through Star Trak / Interscope records. We hope that you will continue to tell all of your friends and family about our music and movement. Consider yourself an ambassador of our VIP Concierge Service, which anyone can join for free at www.chesterfrench.com . Please encourage everyone you meet to visit our site and join. Every single new supporter truly takes us one step closer to sustaining our touring and recording. As always, we love to hear from you so respond to this email or write to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;2d4e45485e59485f6d4e45485e59485f4b5f48434e45034e4240&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; any time with any ideas you might have for how we can better spread the word! \n\nLove the future, \n\nD.A. and Max \n\n","torrent":{"xt":"urn:btih:f6010fcf48b4e85d3f9135ab3907daeacc4a227e","amp;dn":"Chester+French+%26+Clinton+Sparks+Present%3A+Jacques+Jams%2C+Vol+1%3A+En","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6010fcf48b4e85d3f9135ab3907daeacc4a227e","infoHashBuffer":{"type":"Buffer","data":[246,1,15,207,72,180,232,93,63,145,53,171,57,7,218,234,204,74,34,126]},"announce":[],"urlList":[]}}