{"title":"Methodologies and Techniques for Advanced Maintenance","uid":15144716,"size":1938936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f60935dfb4ff1ad35b24098c1d74124620e9c3eb&amp;dn=Methodologies+and+Techniques+for+Advanced+Maintenance&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467219296,"description":"Methodologies and Techniques for Advanced Maintenance - Lorenzo Fedele (Springer, 2011).pdf\r\n\r\nISBN 978-0-85729-102-8\r\n\r\nThe management of technical plants for productivity and safety can often be a complex activity: cases of outsourced plant maintenance by specialized companies are becoming increasingly common, guaranteed quality and cost results are required, and the technology involved is both heterogeneous and innovative.\r\n\r\nMethodologies and Techniques for Advanced Maintenance deals with the most important methodologies and techniques for advanced maintenance solutions. After offering a general overview on system complexity and maintenance politics and strategies it focuses on subjects such as neural networks, fuzzy logic, Markov’s chains and processes, genetic algorithms and expert systems.\r\n\r\nIn particular, this study deals with the diagnostic aspects and safety level of technical plants (such as elevators and thermo-technical plants), and with the involvement of ad hoc designed software analysis tools based on neural networks and reliability indicators. It also explores the development of an &quot;intelligent&quot; maintenance management system has been developed, which allows distant monitoring and controlling by a remote control centre.\r\n\r\nMethodologies and Techniques for Advanced Maintenance is a useful resource for undergraduate students, university professors and researchers in engineering maintenance. Companies involved in maintenance and facilities, as well as those companies operating in industrial, plant and technological fields, will also appreciate the author’s informative approach to maintenance management, reliability and system complexity","torrent":{"xt":"urn:btih:f60935dfb4ff1ad35b24098c1d74124620e9c3eb","amp;dn":"Methodologies+and+Techniques+for+Advanced+Maintenance","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f60935dfb4ff1ad35b24098c1d74124620e9c3eb","infoHashBuffer":{"type":"Buffer","data":[246,9,53,223,180,255,26,211,91,36,9,140,29,116,18,70,32,233,195,235]},"announce":[],"urlList":[]}}