{"title":"Java Fundamental Classes Reference","uid":4734476,"size":1615958,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7147cd5be6e1d902366fe6036324b1c83191a1d&amp;dn=Java+Fundamental+Classes+Reference&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VasiaZozulia","files":-1,"time":1235214590,"description":"The Java Fundamental Classes Reference provides complete reference documentation on the core Java 1.1 classes. These classes contain architecture-independent methods that serve as Java's gateway to the real world, by providing access to resources such as the network and the host filesystem. The core classes also include utilities for working with strings, I/O streams, mathematical functions, vectors, and hash tables. The Java Fundamental Classes Reference covers the classes that comprise the java.lang,java.io, java.net, java.util, java.text, java.math, java.lang.reflect, and java.util.zip packages. These classes provide general-purpose functionality that is fundamental to every Java application.\n\nThis book takes you beyond what you'd expect from a standard reference manual. Classes and methods are, of course, described in detail. But the book does much more. It offers tutorial-style explanations of the important classes in the Java core API. The first section of the book contains chapters that describe the ins and outs of strings and related classes, effective thread programming, and the use of the I/O classes, to name just a few of the topics. These chapters also include lots of sample code, so that you can learn by example.\n\nThis edition of the Java Fundamental Classes Reference describes Version 1.1 of the Java Development Kit and includes:\n\n* Easy-to-use reference material on every core Java class\n* Tutorial-style explanations of important classes and examples that demonstrate their functionality\n* Detailed coverage of all the essential classes in java.lang, including Object, String, and Thread\n* Descriptions of all the I/O classes provided in the java.io package, including all of the new Reader, Writer, and object serialization classes in Java 1.1\n* Material on using the classes in java.util effectively\n* Coverage of all the networking classes in the java.net package\n\nThe Java Fundamental Classes Reference is meant to be used in conjunction with the Java AWT Reference. Together, these two reference manuals cover all of the classes in the Java core API. TheJava Language Reference completes the package by providing a detailed reference of the Java programming language. These manuals comprise the definitive set of documentation that you need to do serious programming with Java 1.1.\n\nO'Reilly &amp; Associates also publishes a tutorial, Exploring Java, if you need to get up to speed with this exciting new technology. For advanced Java programming topics, look for books from O'Reilly on network programming, threads, and database programming.","torrent":{"xt":"urn:btih:f7147cd5be6e1d902366fe6036324b1c83191a1d","amp;dn":"Java+Fundamental+Classes+Reference","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7147cd5be6e1d902366fe6036324b1c83191a1d","infoHashBuffer":{"type":"Buffer","data":[247,20,124,213,190,110,29,144,35,102,254,96,54,50,75,28,131,25,26,29]},"announce":[],"urlList":[]}}