{"title":"Talking Heads - Take Me to the River [RockPop, 1980].VOB","uid":10983186,"size":211083264,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f856eca8b8ba6aba6dcfca32410ef0e3e007130f&amp;dn=Talking+Heads+-+Take+Me+to+the+River+%5BRockPop%2C+1980%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1409885529,"description":"Talking Heads - Take Me to the River [RockPop, 1980].VOB\n\n\nHQ rare promo performance music video from a promo DVD. &quot;Take Me to the River&quot; is a 1974 song written by singer Al Green and guitarist Mabon &quot;Teenie&quot; Hodges. Hit versions were recorded by both Syl Johnson and Talking Heads. In 2004, Al Green's original version was ranked number 117 on Rolling Stone magazine's list of the 500 greatest songs of all time.\n\nIn 1976, Foghat made the first recording of the song by a rock band, on their album Night Shift. Two years later, it was recorded separately by Levon Helm and Bryan Ferry on solo albums, and then by the band Talking Heads on their second album More Songs About Buildings and Food. Their version, recorded with co-producer Brian Eno in Nassau, Bahamas, was edited and released as a single, and reached # 26 on the US Billboard Hot 100 in 1979, as well as hitting the singles charts in Canada, Australia, and New Zealand. Thomas Ryan wrote of Talking Heads' version that it &quot;broadsided the status quo by combining the best ingredients of conventional pop music and classic soul music, stirring them together, and then presenting the mix in the guise of punk rock.&quot;\n\nIn the liner notes for Once in a Lifetime: The Best of Talking Heads, singer David Byrne writes: &quot;Coincidence or conspiracy? There were at least four cover versions of this song out at the same time: Foghat, Bryan Ferry, Levon Helm, and us. More money for Mr Green's full gospel tabernacle church, I suppose. A song that combines teenage lust with baptism. Not equates, you understand, but throws them in the same stew, at least. A potent blend. All praise the mighty spurtin' Jesus.&quot; Live versions were included on Talking Heads' albums The Name of This Band is Talking Heads and Stop Making Sense.\n\n\nTalking Heads were an American rock band formed in 1975 in New York City and active until 1991. The band comprised David Byrne (lead vocals and guitar), Chris Frantz (drums and backing vocals), Tina Weymouth (bass and backing vocals) and Jerry Harrison (keyboards, guitar, and backing vocals). Other musicians also regularly made appearances in concert and on the group's albums. The new wave style of Talking Heads combined elements of punk rock, art rock, avant-garde, pop, funk, world music, and Americana. Frontman and songwriter David Byrne contributed whimsical, esoteric lyrics to the band's songs, and emphasized their showmanship through various multimedia projects and performances.\n\nCritic Stephen Thomas Erlewine described Talking Heads as being &quot;one of the most critically acclaimed bands of the '80s, while managing to earn several pop hits.&quot; In 2002, the band was inducted into the Rock and Roll Hall of Fame. Four of the band's albums appeared on Rolling Stone magazine's 2003 list of the 500 Greatest Albums of All Time, and the Channel 4 100 Greatest Albums poll listed one album (Fear of Music) at number 76. In the 2011 update of Rolling Stone 's &quot;100 Greatest Artists of All Time&quot;, the band was ranked at No. 100.\n(video has a semi-transparent white &quot;zdf.kultur&quot; logo at the top left)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Take_Me_to_the_River#Talking_Heads_and_later_versions&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Take_Me_to_the_River#Talking_Heads_and_later_versions&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/cAaMDAAGd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cAaMDAAGd&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8516kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:04:53\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.6\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t\n*can't begin to tell you how much I love this song, hope you enjoy it too :)","torrent":{"xt":"urn:btih:f856eca8b8ba6aba6dcfca32410ef0e3e007130f","amp;dn":"Talking+Heads+-+Take+Me+to+the+River+%5BRockPop%2C+1980%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f856eca8b8ba6aba6dcfca32410ef0e3e007130f","infoHashBuffer":{"type":"Buffer","data":[248,86,236,168,184,186,106,186,109,207,202,50,65,14,240,227,224,7,19,15]},"announce":[],"urlList":[]}}