{"title":"Crowned with Glory - Dr. Thomas Holland","uid":11773449,"size":206540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8898d5afda8b5035199eeb8345bc8e7c86ff1e0&amp;dn=Crowned+with+Glory+-+Dr.+Thomas+Holland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427168347,"description":"\n\nCrowned With Glory is an insightful look at the history of the Traditional Text and its impact on the crown jewel of English translations, the Authorized Version. Approaching the issue from a scriptural and scholarly perspective, Dr. Holland explores the science of textual criticism in light of biblical preservation.\n\nFrom the rich history of the early English versions to the modern discovery of the Dead Sea Scrolls, this book takes the reader on a captivating journey through the translation and transmission of scripture. Differences between the Traditional and Critical Texts are examined, &quot;mistranslations&quot; and debated passages are explained, corrupting forces in the transmission of scripture are exposed, and the testimonies and sacrifices that paved the way for the Authorized Version are exalted.\n\nRegardless of one's view on this controversial issue, Crowned With Glory is a must-read for the scholar, pastor, or layperson who seeks a greater understanding of the translational debate.\n\n\nAbout the author:\nDr. Thomas Holland has been a pastor and scholar, teaching courses on Bible manuscript evidence and textual criticism, theology, and Christian apologetics at various Bible Institutes","torrent":{"xt":"urn:btih:f8898d5afda8b5035199eeb8345bc8e7c86ff1e0","amp;dn":"Crowned+with+Glory+-+Dr.+Thomas+Holland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8898d5afda8b5035199eeb8345bc8e7c86ff1e0","infoHashBuffer":{"type":"Buffer","data":[248,137,141,90,253,168,181,3,81,153,238,184,52,91,200,231,200,111,241,224]},"announce":[],"urlList":[]}}