{"title":"[Eclipse] Fullmetal Alchemist Brotherhood &lt;COMPLETE&gt;(1280x720 H2","uid":5730316,"size":22794170205,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:fb38af34033b2b8cfd79633f26e4c47f95d150d3&amp;dn=%5BEclipse%5D+Fullmetal+Alchemist+Brotherhood+%3CCOMPLETE%3E%281280x720+H2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zledaren","files":65,"time":1280615345,"description":"I wanted add some public trackers to the .torrent available at:\n &lt;a href=&quot;\nhttp://eclipse.speedsubs.org/projects/alchemist&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://eclipse.speedsubs.org/projects/alchemist&lt;/a&gt;\n\nAnd list it on some public sites, but I realised I don't know how. So I waited, assuming someone else would do it. Then, weeks later, my sister said she couldn't find a complete series torrent, and after a quick search neither could I.\n\nThis torrent is sourced from, but not a duplicate of the Eclipse full series torrent available at the above website. \n\nAll the episodes are renamed to include the eclipse translated episode titles. It includes the episode 46 release from 2/28/10 which included a superimposed tsunami warning map(for the lulz) as well as the clean encode of ep 46. This torrent only contains public trackers and does not include the eclipse tracker because of the altered filenames.\n\n\nShow info:\n\nThis is a redux of a show that aired on Cartoon Network and was very popular in America.(as far as anime goes) This show is also being dubbed by Funimation and is airing weekends on Cartoon Network. Eclipse is a fan subbing group that made these subtitled files available shortly after their Japanese air dates. Theirs is IMO the best of the many available fansubs of the show. \n\n1280x720 \nH264 encoded .mkv files\nw/ Vorbis audio and soft Subtitles. \n\n---------------------------------\n &lt;a href=&quot;\nhttp://www.animenewsnetwork.com/encyclopedia/anime.php?id=10216&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.animenewsnetwork.com/encyclopedia/anime.php?id=10216&lt;/a&gt;\n\nGenres: adventure, comedy, drama, fantasy, mystery, psychological\nThemes: alchemy, conspiracy, demons, fighting, Homunculi, military, steampunk\n\nPlot Summary: \n\nTwo brothers lose their mother to an incurable disease. With the power of &quot;alchemy&quot;, they use taboo knowledge to resurrect her. The process fails, and as a toll for using this type of alchemy, the older brother, Edward Elric loses his left leg while the younger brother, Alphonse Elric loses his entire body. To save his brother, Edward sacrifices his right arm and is able to affix his brother's soul to a suit of armor. With the help of a family friend, Edward receives metal limbs - &quot;automail&quot; - to replace his lost ones. With that, Edward vows to search for the Philosopher's Stone to return the brothers to their original bodies, even if it means becoming a &quot;State Alchemist&quot;, one who uses his/her alchemy for the military.","torrent":{"xt":"urn:btih:fb38af34033b2b8cfd79633f26e4c47f95d150d3","amp;dn":"%5BEclipse%5D+Fullmetal+Alchemist+Brotherhood+%3CCOMPLETE%3E%281280x720+H2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb38af34033b2b8cfd79633f26e4c47f95d150d3","infoHashBuffer":{"type":"Buffer","data":[251,56,175,52,3,59,43,140,253,121,99,63,38,228,196,127,149,209,80,211]},"announce":[],"urlList":[]}}