{"title":"Chester Brown - Underwater","uid":8715272,"size":112875345,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fbae925739a3039f1f84a3f9b83687c4c760232d&amp;dn=Chester+Brown+-+Underwater&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1374318032,"description":"Issues 1-11 of 'Underwater'\n\nDrawn &amp; Quarterly, 1994-1997, 28 pages each\n\nWritten and Illustrated by Chester Brown\n\nUnderwater was an alternative comic book by award-winning Canadian cartoonist Chester Brown that was published from 1994 until 1997, when the ambitious project was abandoned unfinished by its creator.\n\nThe story was unconventional in that it was told from the perspective of a child who is still acquiring language. The dialogue of the characters is encoded into a &quot;language&quot; that at first appears to be gibberish. As the child matures, the parts of the dialogue start to appear as normal, uncoded English.\n\nThe series was unpopular with readers, and Brown gave up on the series after three years, although he has said he may return to it someday.\n\nThe story starts with the birth of twin sisters Kupifam and Juz and was intended to follow Kupifam's life up to her death. In the story as finished, she is still left as a young child who is still acquiring language. The &quot;story seems to weave together dreams with events occurring in the external world. Virtually every panel exudes a dream-like quality.&quot; As the story was left incomplete with Kupifam still a child, it gave the impression that it was about &quot;capturing a state of infancy&quot;, but Brown insists it was &quot;about more than just childhood.&quot;\n\nIn the story (as left incomplete), we see Kupifam and her twin being born, learning to walk and talk, beginning to learn to read, and start to attend school. There are frequent dream sequences, whose beginnings and ends are not clearly separated form the waking narrative, which, along with the artwork, gives the story a surreal feeling. In the cliffhanger that ends the last published issue.... (haha, not givin' ya that bit!).","torrent":{"xt":"urn:btih:fbae925739a3039f1f84a3f9b83687c4c760232d","amp;dn":"Chester+Brown+-+Underwater","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbae925739a3039f1f84a3f9b83687c4c760232d","infoHashBuffer":{"type":"Buffer","data":[251,174,146,87,57,163,3,159,31,132,163,249,184,54,135,196,199,96,35,45]},"announce":[],"urlList":[]}}