{"title":"Awakening Warrior: Revolution in the Ethics of Warfare [blackatk","uid":8632075,"size":1002499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fca4ec86a857f21ceeabbedb9280bac8d0575c37&amp;dn=Awakening+Warrior%3A+Revolution+in+the+Ethics+of+Warfare+%5Bblackatk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1372653818,"description":"Publication Date: May 10, 2007 | ISBN-10: 079147125X | ISBN-13: 978-0791471258 | Edition: 1\nExplores moral progress in the American military.\n\n\n\n\nFrom the Back Cover\nAwakening Warrior argues for a revolution in the ethics of warfare for the American War Machine--those political and military institutions that engage the world with physical force. Timothy L. Challans focuses on the systemic, institutional level of morality rather than bemoaning the moral shortcomings of individuals. He asks: What are the limits of individual moral agency? What kind of responsibility do individuals have when considering institutional moral error? How is it that neutral or benign moral actions performed by individuals can have such catastrophic morally negative effects from a systemic perspective? Drawing upon and extending the ethical theories of Kant, Dewey, and Rawls, Challans makes the case for an original set of moral principles to guide ethical action on the battlefield.\n\n&quot;Challans has written a trenchant, robust, and deeply informed critique of current military morality. He attacks the heavily religious slant given to the moral instruction of warriors, the dogmatic reliance on the idea that the sole end of war is victory, and the refusal to teach even officers to think for themselves about the moral issues raised by their profession. Drawing on years of active duty and of teaching ethics at West Point and other military schools, Challans presents positive recommendations for reforming codes of military ethics and methods of teaching them to young soldiers. The book will no doubt infuriate many of the military leaders who are its chief target. It has policy implications going beyond their concerns, however, and it deserves the thoughtful attention of all citizens who are disturbed by the moral lapses of the American military in the past few decades.&quot; -- J. B. Schneewind, author of The Invention of Autonomy: A History of Modern Moral Philosophy\n&quot;Many in the military community will find Challans's criticism of the U.S. warrior ethos troubling. Good. As the most powerful nation in the world, we are obligated to undertake an open-minded examination and discussion of the ethical foundations and moral boundaries of the profession of arms, even if the process causes angst. Challans speaks to us from a unique background as a scholar, a warrior, and a philosopher, and his views should not be ignored. I strongly recommend that all members of the military profession read this text carefully and reflect on the important arguments found throughout. -- LTC Paul Christopher, USA (Ret.), author of The Ethics of War and Peace: An Introduction to Legal and Moral Issues, Third Edition\n&quot;This is a groundbreaking and potentially controversial book in the context of professional military ethics. It fundamentally challenges the normal ways of teaching ethics in the military.&quot; -- Martin L. Cook, author of The Moral Warrior: Ethics and Service in the U.S. Military\nAbout the Author\nTimothy L. Challans is Associate Professor of Philosophy at the School of Advanced Military Studies (SAMS).\nProduct Details\n\n    Hardcover: 227 pages\n    Publisher: State Univ of New York Pr; 1 edition (May 10, 2007)\n    Language: English\n    ISBN-10: 079147125X\n    ISBN-13: 978-0791471258\n\n &lt;a href=&quot;\nhttp://www.amazon.com/gp/product/079147125X/ref=dp_bookdescription?ie=UTF8&amp;n=283155&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/gp/product/079147125X/ref=dp_bookdescription?ie=UTF8&amp;n=283155&lt;/a&gt;","torrent":{"xt":"urn:btih:fca4ec86a857f21ceeabbedb9280bac8d0575c37","amp;dn":"Awakening+Warrior%3A+Revolution+in+the+Ethics+of+Warfare+%5Bblackatk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fca4ec86a857f21ceeabbedb9280bac8d0575c37","infoHashBuffer":{"type":"Buffer","data":[252,164,236,134,168,87,242,28,238,171,190,219,146,128,186,200,208,87,92,55]},"announce":[],"urlList":[]}}