{"title":"Foul Deeds &amp; Suspicious Deaths In Barking, Dagenham &amp; Ch","uid":11667468,"size":2819183,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd66b8150d71911788acb2766a1f2714318ec49c&amp;dn=Foul+Deeds+%26amp%3B+Suspicious+Deaths+In+Barking%2C+Dagenham+%26amp%3B+Ch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1418082581,"description":"Foul Deeds and Suspicious Deaths In Barking, Dagenham &amp; Chadwell Heath - True Crime BooksFoul Deeds and Suspicious Deaths in Barking, Dagenham and Chadwell Heath takes the reader on a sinister journey through centuries of local crime and conspiracy, meeting villains of all sorts along the way - murderous husbands and lovers, cut-throats, police-killers, highwaymen, Gunpowder Plotters and even a Nazi collaborator sentenced to death for High Treason. Luckless individuals who came to cruel or unjust ends are also recalled, from martyrs and witches to the fishermen who perished in the Great Storm of 1863 and the passengers who lost their lives when the pleasure steamer the Princess Alice sank in the Thames in 1878. There is no shortage of harrowing and revealing tales of accident and evil to recount from the history of this part of Essex to the east of London. The human dramas the authors describe are often played out in the most commonplace of circumstances, but others are so odd as to be stranger than fiction. Their grisly chronicle of the hidden history of Barking, Dagenham and Chadwell Heath will be compelling reading for anyone interested in the dark side of human nature","torrent":{"xt":"urn:btih:fd66b8150d71911788acb2766a1f2714318ec49c","amp;dn":"Foul+Deeds+%26amp%3B+Suspicious+Deaths+In+Barking%2C+Dagenham+%26amp%3B+Ch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd66b8150d71911788acb2766a1f2714318ec49c","infoHashBuffer":{"type":"Buffer","data":[253,102,184,21,13,113,145,23,136,172,178,118,106,31,39,20,49,142,196,156]},"announce":[],"urlList":[]}}