{"title":"Slashback Pictures - (1990) Girlfriend From Hell","uid":4938250,"size":551135616,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fd8b923bbc7d0eb66345c49fd9713b92a78c3401&amp;dn=Slashback+Pictures+-+%281990%29+Girlfriend+From+Hell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JohnSm123","files":1,"time":1244340568,"description":"Cant believe nobody uploaded this so far- one of the funniest comedies i had ever seen. My connection is pretty slow, but will keep uploading it for some months.\n\nAnd there is another comedy that i had seen as a kid and still cant find the name of. Made sometime during end of 80s- beginning of 90s, and i think its a second movie in the serie, and is about groop of problematic kids that their parents deside (if i remember right) to send to military camp for the summer. Instead the kids steal a plane that belongs to father of one of them, get in the air (after the one that the plane belongs to his father tries to ram another one of his father's planes with it), find out that there are 2 terrorists (and a dog) onboard that were planning to steal the plane as well, and it keeps going on from there.\n\nIf somebody has any idea whats the name of the comedy plz post here.\n\nAnyway as for Girlfriend From Hell:\n\nPlot:\n\nDevil is a woman! She is on the run and being pursued by God's &quot;chaser&quot;, (who is an ex-lover coincidently). The chase drops her in the lap of an ongoing birthday party where shy Maggie is on a blind date with equally shy David. As the Devil inhabits Maggie's body the fun starts. First she proves that there is no one that she cannot offend, most especially her girlfriends when she takes their boyfriends upstairs for some killer (no shit) sex. As the bodys pile up the chaser arrives. Lovers tiff doesn't begin to go into the arguing that ensues as the plot reveals that the devil is pissed because she is jealous of her boyfriends over-enthusiastic flirting. Every woman in the film wants to pound our chaser into pulp as his obnoxiousness escalates. Also not to be messed are the crop of Nuns with rocket launchers and semi-automatic weaponry. Quick trips in and out of deep space, bodies in the bathtub, and restaurants where the food attack the patrons. A must see, must rent, and must own for every happy couple ","torrent":{"xt":"urn:btih:fd8b923bbc7d0eb66345c49fd9713b92a78c3401","amp;dn":"Slashback+Pictures+-+%281990%29+Girlfriend+From+Hell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd8b923bbc7d0eb66345c49fd9713b92a78c3401","infoHashBuffer":{"type":"Buffer","data":[253,139,146,59,188,125,14,182,99,69,196,159,217,113,59,146,167,140,52,1]},"announce":[],"urlList":[]}}