{"title":"Winners And Losers - S03E24-E25 - Coming To Terms-All Good Thing","uid":10390034,"size":726761436,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fe250c54d9b0c1564289cd77c3c7712c386f1bc2&amp;dn=Winners+And+Losers+-+S03E24-E25+-+Coming+To+Terms-All+Good+Thing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bullrout","files":1,"time":1403186898,"description":"Winners And Losers - S03E24-E25 - Coming To Terms-All Good Things\n\nSam is caught up in a legal battle between Adam and his parents when Adam gives her power of attorney. Ryan and Bec decide to move to Singapore together after he is offered a teaching job. Frances is in Jasmine's bad books when she removes every trace of Zach from their apartment. Sophie tries to sabotage Carla and Doug's relationship and vows to make Doug realise that he should be with her. Jenny makes the decision to move out when Trish and Brian have an offer made on the house. Flynn continues to dig a deeper hole with Sam. Patrick and Jasmine move in together until their departure. \n\nCarla and Doug's engagement party turns into a reception when they get married. After Jenny asks Gabe to the engagement party, she decides it's time to quit her job and move on. Sam continues to battle Adam's parents. Flynn goes to court and loses the case, but has an idea that could save Adam from his parents. Bec and Ryan move forward with their plans of leaving, despite second thoughts. Sophie has trouble coming to terms after she's rejected by Doug. Jonathan reassures Sophie someone will turn up on her doorstep. Patrick and Jasmine say goodbye. ","torrent":{"xt":"urn:btih:fe250c54d9b0c1564289cd77c3c7712c386f1bc2","amp;dn":"Winners+And+Losers+-+S03E24-E25+-+Coming+To+Terms-All+Good+Thing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe250c54d9b0c1564289cd77c3c7712c386f1bc2","infoHashBuffer":{"type":"Buffer","data":[254,37,12,84,217,176,193,86,66,137,205,119,195,199,113,44,56,111,27,194]},"announce":[],"urlList":[]}}