{"title":"Eric Hufschmid - Why Should We Care About The Armenian Genocide","uid":4826640,"size":5936547,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ffdbba1fa70873f353ccd11ddcfc75bd13ffd334&amp;dn=Eric+Hufschmid+-+Why+Should+We+Care+About+The+Armenian+Genocide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hufschmid_Jr","files":-1,"time":1238968158,"description":"Take A Sit, Boys And Girls.\n\nIn Todays Lesson Were Gonna Look Back In History.\n\n\n- Why doesn't the Armenian issue present a dilemma for US Chinese, US chiropractors, or US basketball players? \n\nArmenians claim that up to 1.5 million Armenians were victims of a genocide between 1915 and 1917. The Turks claim they were &quot;ordinary&quot; deaths from World War 1.\n\nSome of the &quot;intellectual leaders&quot; of the Armenians were killed in public by hanging.\n\t\n\n- So what? Why should we care if they died from a genocide or from a war?\n\n- Because.... if we classify their deaths as a genocide, that leads us to the question, &quot;Who within the Turkish government devised and supervised this genocide?&quot;\n\nAnd that could lead us to an answer! &lt;a href=&quot;\nhttp://www.erichufschmid.net/Hufschmid-23Oct2007.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.erichufschmid.net/Hufschmid-23Oct2007.html&lt;/a&gt;\n\n----------------------------------------------------------------------------------- &lt;a href=&quot;\nhttp://911MissingLinks.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://911MissingLinks.com&lt;/a&gt;\n\n------------------------------------------------------------------------------------\nA transcript of the audio\n \n\nWith the Armenian genocide in the news right now, I thought I'd mention a few interesting aspects of it that you might not have considered.\n\nMost of us think of World War 1 as just another meaningless war from a long time ago, of no significance to those of who are alive today, similar to the way we look at the wars of the Middle Ages. However, there are a lot of peculiar aspects of World War 1 that are still affecting us. For example, during that war, up to 1.5 million Armenians died. Their deaths are currently making the news right now, and there's a resolution in the U.S. Congress, HR 106, that would change their classification from death by war to death by genocide.\n\nWhy should any of us, or our Congress, care what happened to Armenians 90 years ago? And why should we care whether they died from war or genocide? The answer to that question is not immediately apparent, so I thought I would discuss it in this audio file.\n\nFirst, consider that 300,000 to 1.5 million Armenians died in this disputed genocide between 1915 and 1917.  That's a lot of people to die when you consider that the world population at that time was much lower, and compare it to the 120,000 Americans who died during World War 1, or the 400,000 Americans who died in World War 2.\n\nHow could so many Armenians die within two years? Who killed them, and why? And, more importantly, why should you or I care about some dead Armenians?\n\nThe Turkish government claims that the Armenians died because of senseless fights that broke out during World War I between different religious and ethnic groups in the Middle East. They point out that a lot of Turkish people died, also. \n\nOrganized religions and different ethnic groups have always been fighting with each other, so it's easy to believe the Turkish government. However, a lot of Armenians are claiming that their deaths were not ordinary deaths. They claim that there was a deliberate attempt by the Turkish government to exterminate Armenians. If these Armenians are correct, Turkey made the very first attempt, at least on a large scale, to exterminate a group of people.\n\nThe Armenians are currently pushing the US government to pass resolution HR106, which would reclassify those deaths as a genocide. As would be expected, the Turkish government is very angry with the American government for even considering this possibility.\n\nIf the only groups involved in this dispute were the Armenians and the Turks, it should be a simple matter to look through history, figure out what happened, and settle the dispute once and for all.\n\nHowever, there's a third group involved in this dispute to a very significant extent, and that group is the Zionist Jews. Why the Zionists? Why not the Chinese, or the Pakistanis, or the Eskimos?\n\nAn article in the New York Times on Oct. 19 2007 has the heading, &quot;Armenian issue presents a dilemma for US Jews&quot;.\n\nWhy doesn't the Armenian issue present a dilemma for US Chinese, or US Mexicans, or US midgets, or why not US basketball players? Why does a dispute between Turkey and Armenia present a dilemma only for Jews? \n\nFurthermore, the Jews are defending Turkey instead of the Armenians. Why did they decide to defend Turkey?\n\n\nWhen two groups of people are fighting, and when you want to get involved in their fight, you obviously must make a decision on which group you want to help, and which you want to hurt. Therefore, the Zionist Jews contemplated this situation, and they made a decision. But what was it based on? Why did they decide to defend Turkey and attack Armenians? They have reasons, but what are they?\n\nWe should also wonder why the ADL is involved with this issue to such an extent that the city governments of some towns in America with high Armenian populations have been getting into arguments with the ADL. Some of these towns are rebelling against the ADL's hate crimes programs because of this.\n\nWhy would an organization of Jews be so deeply involved in this issue that they get into disputes with city governments in America? Why don't organizations of women, or homosexuals, or Mexicans, or veterans get into similar arguments with Armenians? Why is it that only Jewish groups are interested in fighting with the Armenians over this issue of whether their deaths were a genocide?\n\nIf these Jewish groups and the Turkish government are correct that the Armenians died from ordinary religious and ethnic fighting and from the war, then nobody should care if we look into the issue of how those Armenians died. In such a case, their deaths would be just another tragedy in human history.\n\nHowever, if we classify their deaths as a genocide, that leads us to the question, &quot;Who within the Turkish government devised, authorized, financed, and supervised this genocide?&quot;\n\nCan you see the point I'm trying to make? If those deaths were a genocide, that means that some group of people were responsible. Who were those people?\n\nWhy would the Zionist Jews care if we look closely at the Turkish government and try to figure out who within that government was responsible for this genocide?\n\nSome of you probably already suspect that Zionist Jews were involved in killing those Armenians because Daryl Smith interviewed Mohammad Rafiq many times about Crypto Jews getting into the Turkish government and instigating this genocide. I also have an article about the Crypto Jews are still working today to sabotage and control the so-called 9/11 &quot;truth movement&quot;.\n\nOnce you understand this issue of Crypto Jews, you can understand why the Zionists are trying desperately to stop us from considering the Armenians to be victims of a genocide. But that still doesn't answer the question, why should you or I care? How does that genocide affect us of today? The Zionists have killed a lot of people in a lot of countries; what's so special about those dead Armenians?\n\nActually, there's nothing special about Armenians, but we must to understand and expose the Zionist techniques in order to stop them. It would help us tremendously if we could figure out how the Crypto Jews got into the Turkish government to such an extent that they could conduct an enormous slaughter without anybody in the world noticing or complaining. We should also wonder if the Crypto Jews can infiltrate the Turkish government to such an extent, can infiltrate the governments of other nations, also?\n\nI'm sure anybody listening to this audio file already knows the answer to that question. Yes, the Crypto Jews have infiltrated other governments. There's a lot of evidence that the Nazi party was started by, or dominated by, the Zionists, and there is evidence that the Zionist Jews are dominating the European Union and the governments of Britain, America, Australia, and dozens of others. \n\nUntil we understand their techniques, it's going to be difficullt to stop them. So how did the Crypto Jews getting such amazing control of the Turkish government? This issue had me confused until somebody sent me a recent news article from the Jerusalem Post that had the following remark:\n\nThe mass killings of Armenians by Ottoman Turkish troops took place between 1915 and 1917 as the 600-year-old empire collapsed. \n\nI think that remark about the Empire collapsing explains it. When the Zionist organization became officially established in 1897, Turkey had control of Palestine. It was known as the Ottoman Empire.\n\nThe Zionists asked the Turkish government if they could have a portion of Palestine for their homeland, but the Turkish government refused. So what should the Zionists do? They want Palestine, but it has been under the control of Turkey for hundreds of years. How can they get that land away from Turkey? If you wanted a portion of Russia, or China, or Brazil for your own nation, how would you go about getting it?\n\nWell, in 1914 a student kills an Austrian. None of the people who write history books can adequately explain how this event caused Russia, Britain, France, Germany, Austria, and other nations to start a vicious war with one another. The historians also cannot adequately explain why Britain sent troops down to Palestine to fight the Turks and drive them out of Palestine.\n\nHistorians provide a lousy explanation for World War I. They also provide a lousy explanation for the 9/11 attack, and the mysterious breaking of the New Orleans levees, and the mysterious inability of the government to help the people who're drowning after the levees mysteriously broke. Your first reaction is to assume these historians are just stupid.\n\nWhen I was in high school, I didn't know what Zionism was, but I could sense that historians were not giving a very good explanation of history. My assumption was that the people who became historians just weren't smart enough for any other job.\n\nToday I can see that, while many historians probably are rather stupid, their crummy explanation for world events is because they're lying, not because of stupidity. It doesn't take much intelligence to figure out why World War I got started. All you have to do is look at Zionism and the events of the 20th century will start to make sense.\n\nThe key to understanding what the Zionists have been doing is to realize that they're like intelligent maggots. Maggots eat only dead flesh. They don't bother with healthy creatures. This is why it is safe to put maggots into open wounds on your body. The maggots will eat the dead flesh, and that can help the wound to heal. \n\nThe Zionists are like maggots in the sense that they prey on the sickly and dying nations, businesses, and people. But they are like intelligent maggots because when they want to take control of a group that is in good condition, they will first destroy it, and then they take advantage of the chaos they create.\n\nThe Zionists instigated World War I. While this war was going on, Lord Rothschild tricked the British government into signing that document we know as the Balfour Declaration. I'll explain some of this in more detail in another audio file. For now I just want to concentrate on this Armenian genocide.\n\nWorld War I was a trick to get nations fighting with each other, and to trick the British into driving the Turks out of Palestine. While this war was going on, the Crypto Jews were getting into the Turkish government. They were taking advantage of the chaos created by the war.\n\nRemember that what the Jerusalem Post said, was that the Armenians were being slaughtered as the Ottoman Empire collapsed. As the government of Turkey was involved with war, the Crypto Jews were taking advantage of the situation by getting into the Turkish government, destroying it from within, and taking control of the nation. The more chaos they created, the easier it was for them to get even more of people inside the government. Eventually they had so much control of the Turkish government that they could send the Turkish people out to exterminate Armenians, and kill themselves at the same time. It is very likely that the Crypto Jews have been in control of Turkey ever since. \n\nThe lesson to learn from the Armenian massacre is that the Zionists cannot hurt healthy nations, businesses, or people. In order for them to get control of a healthy nation, they must create chaos and misery. \n\nTake a look at the Nazi party in Germany. Nobody disputes that the Nazi philosophy came from Alfred Rosenberg of Russia, it didn't come from Germans. And nobody disputes that prior to the war there was a deliberate attempt by Zionist Jews to create economic problems for Germans.\n\nI don't want to talk about the Nazis in this audio file, but I want to point out that the evidence suggests that the Nazis were created by the Zionists, and then the Zionists created economic problems for Germany, and then they took advantage of the chaos by getting control of Germany, started another war, which created even more chaos, thereby allowing them to get even more control of other nations.\n\nI have some documents on my site that discuss the Nazis and the Holocaust, and I urge you to find the emotional strength to look into this issue.\n\nOnce you understand these Zionist techniques, you can see it happening here in America and in other nations. All over the world you can find Zionist Jews trying to instigate fights between different races, religions, and between men and women. They try to instigate fights between different nations also, such as between India and Pakistan, between China and Taiwan, and there's even evidence that they are involved in the Irish Republican Army in an attempt to create fights between the Irish and English. The Zionists have also been creating economic problems for nations and then taking advantage of that situation. You should watch the video the Money Masters if you haven't seen it yet. It gives a history of the Rothschilds and how these banking families have been manipulating nations and creating financial problems, and then getting even more control because of these problems they create.\n\nThe Zioinst Jews also try to destroy our societies by encouraging destructive attitudes, such as encouraging us to do whatever makes us feel good, and encouraging us to strive for phenomenal amounts of money, fame, sex, and pampering by servants.\n\nIf most people in the world were in good mental health and happy, the Zionist Jews would have a lot of trouble instigating fights between us and taking control of our societies. However, an enormous percentage of the population is very unhappy. They have problems with their relationships, with money, gambling, drugs, alcohol, and other issues. The Zionists prey on these sad people. They manipulate them with offers of whatever they want, such as money, sex, gambling or fame.\n\nThe Zioinst Jews then make the situation worse by killing some of the healthy people. There is evidence that they're doing this in Iraq right now. Specifically, there are occasional news reports about mysterous murders and disappearnces of some of the educated and skilled Iraqis. Don't assume that this is a meaningless coincidence. After tricking the American military into destroying Iraq, the Crypto Jews sneak into Iraq to kill people. They want to get rid of the healthy and skilled Iraqis and leave behind the mentally ill and the stupid. They have probably been doing this in Germany, Russia, and other nations for decades.\n\nSo hopefully by now you can understand that the Armenian issue is very significant to all of us. If those Armenians were killed in a genocide, then somebody is responsible, and the evidence suggests it's the Zionist Jews.\n\nThis genocide issue should be brought up whenever somebody talks about Israel's right to exist. How can anybody justify Israel has a right to exist when these people have proven over and over that they are the most dangerous creatures on this planet?\n\nIf you've ever have looked through my articles and listened to some of my audio files, then you know that I believe that after the Zionists commit a crime, they have their own agents in the role of investigator in order to dominate the investigation. They want to lure people over to their agents and away from the honest investigators, and they want to deflect attention away from them, or minimize the damage if they can't completely deflect it away.\n\nTherefore, if the Armenians were killed by Zionist Jews in a deliberate attempt to exterminate the Armenians, then we must assume that most of the investigators of this Armenian genocide are Zionist agents.\n\nOne man who has been trying for the past year to become known as an expert on the Armenian genocide is Chris Bjerknes. Bjerknes claims that he's a good Jew who opposes Zionism, but as I've mentioned in some of my documents and audio files, the evidence suggests that he is actually a bad Jew who is secretly supporting some faction within the Zionist movement.\n\nHe provides a lot of information about the Armenian genocide, but he may be doing so only to lure us over to his site and away from other, honest researchers. He may also be mixing in a little deception with his information.\n\nHe wrote a book about that genocide, and it's available for free at his website, jewishracism.com. His audio interviews about this genocide are also available for free at his site.\n\nThere's nothing wrong with looking at his information, but you should not trust him. You gain nothing by trusting people in this truth movement. \n\nBjerknes also provides a lot of evidence that Einstein was a plagiarist, but this may also be bait to lure us over to his site and away from other people who were making this accusation years earlier.\n\nI criticize so many people in this truth movement that some people have a hard time taking me seriously. They tell me that if what I say is true, everybody in this truth movement is a liar, except me. Well, sorry, but that's how it seems, so that's why I say it. If you think you can trust him Bjerknes, ask yourself why he has such a fascination with this Armenian genocide . Why is he struggling so hard to expose this genocide? Why is he writing such extensive books, doing so many interviews, and even traveling at his own expense from his home in Chicago to Glendale, California to give a speech about the genocide to a group of Armenians?\n\nHe's spending a lot of his time and money to educate the Armenian people. He appears to be as he says, a good Jew who wants to expose the bad Jews. But what are the chances that this is really what's happening? If he really wanted to expose the bad Jews, why doesn't he also expose the Holocaust, the Apollo moon landing, the world wars, and everything else? \n\nWhy has he selected only a couple of Zionist crimes to expose? And why does he imply that the Holocaust really happened as the official Zionist movement claims?\n\nYou might respond that he has simply not had the time to look into the Apollo moon landing, or the Holocaust, and that he may find the time to deal with those issues later. As I have tried to explain many times, we are foolish to make excuses for people in leadership positions. Instead of excusing their stupidity and ignorance, we should tell them find another job, and let somebody with more abilities take their position.\n\nBjerknes claims to be a highly educated intelligent person with the ability to analyze Einstein's theories and show us that Einstein plagiarized those theories. However, if he's that intelligent and educated, they should take about 20 seconds to figure out that the Apollo moon landing was a hoax, and maybe two minutes to figure out that the Holocaust is a hoax.\n\nI'm just a lowly high school graduate, and once I looked at the Apollo moon landing information, it only took me a couple minutes to figure out that it was a hoax. Therefore, these super-smart, highly educated college graduates should to do it in less time than me.\n\nFurthermore, Bjerknes admits to being at least partly Jewish, and if you have read the book The Jewish Mystique, or read such magazine articles with titles as, Are Jews Smarter?, then you know that Jews are smarter than the rest of us. Therefore, a Jew with a college degree should need only 20 seconds to figure out the Apollo moon hoax.\n\nSo why is Bjerknes is having so much trouble figuring out Apollo moon hoax and the HoloHoax if he has both a college degree, and the superior Jewish intellect? \n\nThe only conclusion is that he's deliberately lying to cover up those Zionist crimes. He's a fraud.\n\nSince he protects some Zionist crimes, why should you trust him to expose any Zionist crimes? I suspect that he is exposing Einstein and the Armenian genocide only to lure you over to his site and put himself into the position of &quot;Einstein expert&quot; and &quot;Armenian genocide expert&quot;. If you fall for this trick, you will gather around a Jew who will tell you what to think about Jewish crimes. Can you see the trick?\n\nBefore I end this audio file, I want to mention that there are a lot of extremely suspicious fires in Southern California right now. The last time this happened I told some people that they were probably set by Zionist Jews, but most people have a difficult time believing me when I say Zionists would set fires. They can't understand how Zionists could benefit from fires. \n\nThe answer to this mystery is that they don't benefit from the fires, they benefit from the chaos that results. There are lots of ways that they can benefit. For example, if some government officials were giving him trouble, they could tell the officials that if they don't do what they're told, such as get the war with Iran going, they're going to set Southern California on fire. If the officials responded Ã¢â‚¬Å“I don't believe youÃ¢â‚¬Â�, or Ã¢â‚¬Å“You'd never get away with thatÃ¢â‚¬Â�, the Zionists could set the fires, and the government officials would realize that the Zionists are not fooling around, and that the firemen don't care that the fires are suspicious, and neither do the police, the military, or anybody else.\n\nThe Zionists would also be able to take advantage of the chaos by killing some of their critics who lived near the fire area, or burning down some of their homes or businesses. You might respond that the police and firemen would complain about the suspicious deaths or fires, but the police and firemen don't say anything about 9/11, the mysterious breaking of the levees in New Orleans, the attack on the USS Liberty, the Apollo moon landing, or anything else. So don't overestimate people.\n\nThe only time you can find the ordinary people getting together and standing up to their leadership is when they go on strike to demand a few more pennies per hour. There are strikes all the time all over the world. It's possible for ordinary people to get together for something beneficial, such as demanding the police do a proper investigation of 9/11 and put an end to this Zionist crime network, but the ordinary people truly don't care about anything other than themselves.\n\nI realize that it's difficult to believe that these mysterious fires could be coming from Zionist Jews, but consider the possibility. They've got to ruin America in order to get control of it. Sure, the fires do only a little damage overall, but they are doing lots of other things also. For example, the war is still going on, and so are the crazy television shows, and the mysterious school shootings, and the mysterious destructions of bridges, and the attempt to stir up racial fights between Mexians and Americans. America is being destroyed, and we should look at what happened to Turkey, the Armenians, the Germans, and the Russians, and try to learn from their mistakes.\n \n","torrent":{"xt":"urn:btih:ffdbba1fa70873f353ccd11ddcfc75bd13ffd334","amp;dn":"Eric+Hufschmid+-+Why+Should+We+Care+About+The+Armenian+Genocide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffdbba1fa70873f353ccd11ddcfc75bd13ffd334","infoHashBuffer":{"type":"Buffer","data":[255,219,186,31,167,8,115,243,83,204,209,29,220,252,117,189,19,255,211,52]},"announce":[],"urlList":[]}}